{"Title": "Towards a Pervasive Paradigm: Enabeling Patients Privacy Through Decentralized Identity and Data Control in E-Health", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/InCACCT61598.2024.10551158", "Date of Publication": "02-03 May 2024", "abstract": "Patient care has certainly enriched by implementing digitalization in healthcare. This digital transformation has posed obstacles with data security and privacy. By the introduction of e-health, huge volumes of sensitive and classified data is digitally processed and the likelihood of numerous personal health records (PHR) rules infractions or breaches has drastically increased by implementation of digitalization. Even with the advancement in technologies, it will take due time before a system development can effectively address the security issues and give patients, who are the natural guardians of their health data a total control over their personal data. Hence, there is an urgent need for a patient-centric system that maintains data privacy and gives patients a total control over their PHR. To redefine E-Health security, the cutting-edge technologies comprising of Distributed Hash Table (DHT), Blockchain, Self-Sovereign Identity (SSI), and Inter Planetary File solution (IPFS) needs integration. IPFS and DHT enables in improving Data privacy by providing a reliable and effective decentralized and distributed storage solution. Enabling safe access control over this information, a Decentralized Ledger Technology (DLT) leverages the transparent and unchangeable characteristics of Blockchain. The idea of SSI, which gives patients control over their digital identities and to manage their E-Health data, is fundamental to this paradigm. This study advocates for the widespread implementation of patient-powered electronic health record management system. Additionally providing encouraging paths to improve data security and privacy in the domain of digital healthcare.", "Published in": [{"name": "2024 2nd International Conference on Advancement in Computation & Computer Technologies (InCACCT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550186/proceeding"}], "Authors": [{"name": "Mohammed H. Al Muharif", "from": "Computer Science Department, CCSIT, King Faisal University, Alhassa, Saudi Arabia"}, {"name": "Shakeel Ahmed", "from": "Computer Science Department, CCSIT, King Faisal University, Alhassa, Saudi Arabia"}], "IEEE keywords": ["Access control", "Data privacy", "Data security", "Digital transformation", "Blockchains", "Electronic healthcare", "InterPlanetary File System"], "Author Keywords": ["E-Health", "Privacy", "Security", "PHR", "Blockchain", "Self-Sovereign", "SSI", "IPFS", "DHT", "DLT"]}