{"Title": "Safeguarding DeFi Smart Contracts Against Oracle Deviations", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1145/3597503.3639225", "Date of Publication": "14-20 April 2024", "abstract": "This paper presents OVer, a framework designed to automatically analyze the behavior of decentralized finance (DeFi) protocols when subjected to a “skewed” oracle input. OVer firstly performs symbolic analysis on the given contract and constructs a model of constraints. Then, the framework leverages an SMT solver to identify parameters that allow its secure operation. Furthermore, guard statements may be generated for smart contracts that may use the oracle values, thus effectively preventing oracle manipulation attacks. Empirical results show that OVer can successfully analyze all 10 benchmarks collected, which encompass a diverse range of DeFi protocols. Additionally, this paper illustrates that current parameters utilized in the majority of benchmarks are inadequate to ensure safety when confronted with significant oracle deviations. It shows that existing ad-hoc control mechanisms such as introducing delays are often insufficient or even detrimental to protect the DeFi protocols against the oracle deviation in the real-world.", "Published in": [{"name": "2024 IEEE/ACM 46th International Conference on Software Engineering (ICSE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548016/proceeding"}], "Authors": [{"name": "Xun Deng", "from": "University of Toronto, Toronto, Canada"}, {"name": "Sidi Mohamed Beillahi", "from": "University of Toronto, Toronto, Canada"}, {"name": "Cyrus Minwalla", "from": "Bank of Canada, Ottawa, Canada"}, {"name": "Han Du", "from": "Bank of Canada, Ottawa, Canada"}, {"name": "Andreas Veneris", "from": "University of Toronto, Toronto, Canada"}, {"name": "Fan Long", "from": "University of Toronto, Toronto, Canada"}], "IEEE keywords": ["Analytical models", "Source coding", "Smart contracts", "Finance", "Benchmark testing", "Decentralized applications", "Safety"], "Author Keywords": ["Blockchain", "Decentralized Finance", "Smart Contracts", "Oracle Deviation", "Static Program Analysis", "Code Summary", "Parameter Optimization"]}