{"Title": "Efficient Vehicular Data Sharing using Aerial P2P Backbone", "Pages": "1 - 14", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/TIV.2024.3414140", "Date of Publication": "13 June 2024", "abstract": "Peer-to-Peer (P2P) concept within Vehicular Ad-Hoc Networks (VANETs) facilitates instantaneous information sharing among vehicles, leading to a seamless exchange of multimedia content, enhanced traffic management, heightened road safety, and ultimately contributing to a transportation ecosystem that is both more enjoyable and secure. However, the paradigm of P2P faces various challenges ranging from network scalability and reliability to the frequent topology changes of vehicular environments and weak resource management. As a result, a set of problems could be generated, such as data inconsistency and unreliability, weak lookup success rate, and low end-to-end delay, especially when requesting data. To address all these issues, we propose an innovative solution that leverages an aerial backbone consisting of a connected group of Unmanned Aerial Vehicles (UAVs). This system efficiently covers the integrality of the terrestrial vehicular environment while ensuring efficient data sharing and distribution towards it, thus playing the role of an aerial P2P overlay. The establishment of the aerial backbone takes into account two factors: (i) the connectivity degree among UAVs and (ii) their remaining energy levels. To ensure that these two factors are constantly verified and maintain permanent data availability for the vehicular environment, a Deep Q Network (DQN) method is adopted to optimize the movements of UAVs according to the terrestrial environment dynamics. After conducting a series of simulations, our methodology exhibits a marked superiority over existing baseline techniques regarding lookup time and success rate.", "Published in": [{"name": "IEEE Transactions on Intelligent Vehicles", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7274857"}], "Authors": [{"name": "Abdelkader Ilyes Ameur", "from": "Computer Science and Mathematics Laboratory, University of Laghouat, Laghouat, Algeria"}, {"name": "Omar Sami Oubbati", "from": "LIGM, University Gustave Eiffel, Marne-la-Vallée, France"}, {"name": "Abderrahmane Lakas", "from": "College of Information Technology, United Arab Emirates University, United Arab Emirates"}, {"name": "Abderrezak Rachedi", "from": "LIGM, University Gustave Eiffel, Marne-la-Vallée, France"}, {"name": "Mohamed Bachir Yagoubi", "from": "Computer Science and Mathematics Laboratory, University of Laghouat, Laghouat, Algeria"}], "IEEE keywords": ["Vehicular ad hoc networks", "Autonomous aerial vehicles", "Intelligent vehicles", "Blockchains", "Vehicle dynamics", "Reliability", "Peer-to-peer computing"], "Author Keywords": []}