{"Title": "Machine Learning-Driven Blockchain for Enhanced Transparency in Government Public Records", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/CSNT60213.2024.10545708", "Date of Publication": "06-07 April 2024", "abstract": "With more things done online, citizens have never wanted government data to be more available and dependable. This paper proposes a solution using blockchain and powerful algorithms. The recommended approach uses blockchain's immutability and safety, machine learning to discover outliers, and NLP to organize data. This coordinated strategy automates and opens government records to increase data quality, accessibility, and speed. Several tests and performance assessments compared the recommended solution to the traditional record-keeping method. Finding anomalies is faster using machine learning anomaly detection and natural language processing record sorting. This ensures data accuracy and clarity in real time. Spreading blockchain keeps documents secure and unchangeable. This makes changing difficult for those who shouldn't. The study found that the proposed strategy might improve public record management. It improves transparency, a crucial trait for responsible leadership, in a powerful, safe, and automated way using blockchain technology and cutting-edge algorithms.", "Published in": [{"name": "2024 IEEE 13th International Conference on Communication Systems and Network Technologies (CSNT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10545643/proceeding"}], "Authors": [{"name": "Sorabh Lakhanpal", "from": "Lovely Professional University, Phagwara"}, {"name": "CH Vijendar Reddy", "from": "Institute of Aeronautical Engineering, Dundigal, Hyderabad"}, {"name": "Uma Reddy", "from": "Department of Artificial Intelligence and Machine Learning, New Horizon College of Engineering, Bangalore"}, {"name": "Akshay Varkale", "from": "Department of Computer Science & Engineering, IES Insititute of Technology and Management, IES University, Bhopal, M.P., India"}, {"name": "Ashwani Kumar", "from": "Lloyd Institute of Engineering & Technology, Greater Noida, Uttar Pradesh"}, {"name": "Ali Albawi", "from": "Radiology Techniques Department, College of Medical Technology, The Islamic University, Najaf"}], "IEEE keywords": ["Machine learning algorithms", "Government", "Machine learning", "Real-time systems", "Natural language processing", "Blockchains", "Safety"], "Author Keywords": ["Anomaly Detection", "Blockchain Technology", "Data Integrity", "Decentralized", "Efficiency", "Government Records", "Machine Learning", "NLP", "Performance Evaluation", "Public Records", "Security", "Transparency"]}