{"Title": "A novel dynamic model for ranking cryptocurrencies in different time horizons based on Deep Learning and Sentiment Analysis", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ACCESS.2024.3413201", "Date of Publication": "12 June 2024", "abstract": "This paper addresses the imperative task of assessing and ranking cryptocurrencies, particularly pertinent in the context of the burgeoning popularity of public blockchains. The proliferation of available options necessitates a rigorous evaluation, prompting the formulation of a novel model grounded in both objective and subjective criteria. To contend with the challenge posed by the expanding landscape of public blockchains, ten discerning criteria are delineated, encompassing facets such as Technology, TPS, Market capitalization, GitHub fork, GitHub stars, Twitter followers, Twitter hashtags, trading volume, sentiment score, and the price range differential. Leveraging expert opinions, the pairwise impact of these criteria is ascertained, and the DEMATEL method is judiciously employed to derive their respective weights. Subsequently, the PROMETHEE method is harnessed to effectuate the ranking of 20 cryptocurrencies predicated on the identified criteria. Furthermore, the integration of LSTM enables the prediction of values for four predictable criteria, seamlessly incorporated into the PROMETHEE model to furnish rankings across diverse temporal intervals. The proposed model, thus, presents a holistic and pragmatic approach to inform investment decision-making within the dynamic cryptocurrency market. By embracing a comprehensive set of criteria and integrating predictive analytics, this model stands as a valuable contribution to the field, offering nuanced insights to stakeholders navigating the complexities of cryptocurrency investment.", "Published in": [{"name": "IEEE Access", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6287639"}], "Authors": [{"name": "Aida Mohagheghzadeh", "from": "Iran University of Science and Technology, Iran"}, {"name": "Babak Amiri", "from": "Iran University of Science and Technology, Iran"}, {"name": "Ahmad Makui", "from": "Iran University of Science and Technology, Iran"}], "IEEE keywords": ["Cryptocurrency", "Bitcoin", "Predictive models", "Measurement", "Machine learning", "Analytical models", "Machine learning algorithms"], "Author Keywords": []}