{"Title": "Green Energy and Blockchain: Sustainable Technology Innovation", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IRASET60544.2024.10548446", "Date of Publication": "16-17 May 2024", "abstract": "Today, the concept of green energy has a critical role in achieving sustainability goals. The effective utilization of green energy resources and the management of energy from generation to distribution has become a key priority of sustainable energy transformation today. In this context, the use of blockchain technology provides an important infrastructure for transparent and secure management of energy processes. Blockchain is known as distributed ledger technology and represents a database that is updated simultaneously between many computers on a network. This technology is used in many application areas, ensuring data integrity and security. In the green energy sector, the use of blockchain technology is possible in various scenarios. Issues such as more effective use of green energy resources, monitoring and verifying energy consumption, and reducing carbon emissions include potential applications of blockchain in this field. The article aims to make a valuable contribution to the transformation process in the energy sector by examining green energy, sustainability goals, and how blockchain technology can be integrated into sustainability studies in the green energy sector and the studies carried out in this direction.", "Published in": [{"name": "2024 4th International Conference on Innovative Research in Applied Science, Engineering and Technology (IRASET)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548014/proceeding"}], "Authors": [{"name": "Büşra Tural", "from": "Research & Development Center, Vakıf Participation, Istanbul, Turkey"}, {"name": "Zeynep Örpek", "from": "Research & Development Center, Vakıf Participation, Istanbul, Turkey"}, {"name": "Samet Özmen", "from": "Research & Development Center, Vakıf Participation, Istanbul, Turkey"}], "IEEE keywords": ["Computers", "Technological innovation", "Energy consumption", "Distributed ledger", "Data integrity", "Carbon dioxide", "Blockchains"], "Author Keywords": ["Blockchain", "Renewable Energy", "Sustainability", "Green Energy"]}