{"Title": "Ethereum Powered E-Tendering System", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IC3IoT60841.2024.10550251", "Date of Publication": "17-18 April 2024", "abstract": "The use of information technology to trade information, deliver services, and other things is becoming more and more commonplace in the era of technological advancement. Tendering is one such area where the public and private sectors collaborate. E-tendering is a procurement technique that uses the internet and digital technologies to automate and simplify the whole bidding or tendering process. This makes it easier for the bidders to browse through all of the open tenders and select one to proceed with. But it frequently results in a number of challenges that both bids and bidders must deal with. The system is inefficient because of scale and transparency problems brought on by its centralized architecture. Additionally, the system frequently shares information about tenders with other outside organizations, which compromises the confidentiality and integrity of the tenders. To manage these issues, a decentralized method is used in the deployment of the Blockchain e-tendering system. Consequently, the procurement procedures will have the opportunity to leverage the potential of blockchain technology to enhance security and transparency. This research aims to provide an electronic tendering system that is transparent, liquidate, and safe. It will manage tender allocation and use smart contracts to automate the underlying processes with the least amount of human interaction possible.", "Published in": [{"name": "2024 International Conference on Communication, Computing and Internet of Things (IC3IoT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550185/proceeding"}], "Authors": [{"name": "K Ananthajothi", "from": "Dept. of computer science and engineering, Rajalakshmi Engineering College, Chennai, India"}, {"name": "P K Jaisuriya", "from": "Dept. of computer science and engineering, Rajalakshmi Engineering College, Chennai, India"}, {"name": "S Haribala", "from": "Dept. of computer science and engineering, Rajalakshmi Engineering College, Chennai, India"}], "IEEE keywords": ["Procurement", "Electric potential", "Smart contracts", "Organizations", "Blockchains", "Telecommunication computing", "Security"], "Author Keywords": ["Ethereum", "smart contracts", "blockchain", "digital signatures", "tendering"]}