{"Title": "Design and Implementation of an Efficient Fingerprint Authentication Algorithm using SHA-512", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICDCECE60827.2024.10548466", "Date of Publication": "26-27 April 2024", "abstract": "We propose a novel approach to strengthen authen-tication techniques by integrating fingerprint recognition with cryptographic methods, particularly leveraging the Secure Hash Algorithm SHA-512. Our research combines advanced image processing methods with SHA-512 to enhance the efficiency of fingerprint-based authentication while maintaining security. By processing fingerprint images and extracting unique features, we feed the data into the SHA-512 algorithm to create a robust iden-tity verification system. Additionally, we employ SHA-512 loop unrolling to expedite the hashing process, improving performance without compromising security. Our enhancements result's in a significant reduction in Look-Up Table (LUT) utilization from 63 percent to 33.07 percent, indicating a 47.62 percent improvement, and a decrease in Flip-Flop (FF) utilization from 36 percent to 13 percent, showcasing more efficient resource utilization. These optimizations expedite the hashing process, particularly advantageous for time-sensitive applications.", "Published in": [{"name": "2024 Third International Conference on Distributed Computing and Electrical Circuits and Electronics (ICDCECE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548017/proceeding"}], "Authors": [{"name": "Ankush Gupta", "from": "Electronics and Communication, PES University, Bengaluru, India"}, {"name": "Nehal Banakar", "from": "Electronics and Communication, PES University, Bengaluru, India"}, {"name": "Chetan Kumar N", "from": "Electronics and Communication, PES University, Bengaluru, India"}, {"name": "Aryan M", "from": "Electronics and Communication, PES University, Bengaluru, India"}, {"name": "Purushotham U", "from": "Electronics and Communication, PES University, Bengaluru, India"}], "IEEE keywords": ["Power demand", "Image matching", "Authentication", "Fingerprint recognition", "Feature extraction", "Table lookup", "Resource management"], "Author Keywords": ["Fingerprint", "SHA", "Efficient", "Authentication", "Hash"]}