{"Title": "Secure and Fine-grained Access Control with Optimized Revocation for Outsourced IoT EHRs With Adaptive Load-Sharing in Fog-Assisted Cloud Environment", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ACCESS.2024.3412754", "Date of Publication": "11 June 2024", "abstract": "With the employment of IoT technology and cloud computing in healthcare, outsourcing Electronic Health Records (EHRs) generated by IoT devices becomes the critical issue. In fact, as EHRs may be collected by different units within a hospital and traverse intranet or public networks, this introduces vulnerabilities to privacy breaches. Existing research efforts employ cloud-based access control with encryption solutions to secure outsourced EHRs. Nevertheless, in the context of an IoT cloud data-sharing environment, where data originates from numerous devices and user authorization status undergoes frequent changes, a gap persists in achieving a comprehensive and systematic integration of secure IoT data transfer and aggregation, coupled with efficient user revocation procedures. In this research, we proposed a cloud-based access control scheme for outsourced IoT-enabled EHRs. Our proposed scheme achieves fine-graindness, scalable and efficient revocation based on the pseudo-random encryption, symmetric encryption, and ciphertext-policy attribute-based encryption (CP-ABE), and graph-based modeling. In our scheme, we utilized fog computing to transfer the resource-intensive tasks of encrypting and decrypting CP-ABE, while also streamlining communication expenses between IoT devices and cloud storage. Additionally, we implemented an adaptive load sharing algorithm to facilitate effective distribution of workloads among fog nodes. Moreover, we integrate the blockchain as the integrity validation to help checking the integrity of the EHRs in the system. Finally, we provided security analysis, comparative computation analysis and conducted experiments to show that our scheme is secure and efficient in practice.", "Published in": [{"name": "IEEE Access", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6287639"}], "Authors": [{"name": "Somchart Fugkeaw", "from": "Sirindhorn International Institute of Technology, Thammasat University, Thailand"}, {"name": "Rohan Prasad Gupta", "from": "Sirindhorn International Institute of Technology, Thammasat University, Thailand"}, {"name": "Khanadech Worapaluk", "from": "Sirindhorn International Institute of Technology, Thammasat University, Thailand"}], "IEEE keywords": ["Internet of Things", "Cloud computing", "Access control", "Encryption", "Edge computing", "Computational modeling", "Blockchains", "Electronic medical records", "Blockchains"], "Author Keywords": []}