{"Title": "SRAM-PUF Authentication Schemes Empowered with Blockchain on Resource-Constrained Microcontrollers", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ISORC61049.2024.10551352", "Date of Publication": "22-25 May 2024", "abstract": "The pervasive presence of Internet of Things (IoT) devices across diverse critical industrial contexts underscores the crucial role of authentication mechanisms to protect applications from misuses and violations. Those authentication schemes not relying on passwords are built by using cryptography protocols so as to achieve high security levels. However, their efficacy relies on the confidentiality of cryptographic keys and has limitations when implemented on resource-constrained devices. This paper introduces a novel approach to devise an authentication scheme without relying on the storage of keys in device memory and without the presence of a centralised entity. We develop a lightweight mutual authentication scheme utilizing Static Random Access Memory (SRAM)-Physical Unclonable Function (PUF), which leverage on the inherent randomness of SRAM obtained during its manufacturing process to create keys. The proposed solution is further fortified by blockchain technology that is used to provide a decentralised management authority. By incorporating decentralization, scalability, freshness, and non-repudiation, this research contributes to the advancement of secure authentication protocols for IoT-enabled critical industrial applications.", "Published in": [{"name": "2024 IEEE 27th International Symposium on Real-Time Distributed Computing (ISORC)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10551300/proceeding"}], "Authors": [{"name": "Mario Barbareschi", "from": "University of Naples Federico II, Napoli, Italy"}, {"name": "Franco Cirillo", "from": "University of Salerno, Fisciano, Italy"}, {"name": "Christian Esposito", "from": "University of Naples Federico II, Napoli, Italy"}], "IEEE keywords": ["Protocols", "Scalability", "Authentication", "Random access memory", "Passwords", "Non-repudiation", "Physical unclonable function"], "Author Keywords": ["Static Random Access Memory (SRAM)- Physical Unclonable Function (PUF)", "Authentication", "Blockchain", "IoT Security", "InterPlanetary File System (IPFS)", "Key Exchange", "Arduino"]}