{"Title": "Low latency PBFT parallel consensus for IoT blockchain platform", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ISORC61049.2024.10551353", "Date of Publication": "22-25 May 2024", "abstract": "With the success of blockchains for providing a high security platform for distributed systems, new challenges are presented in relation with the deployment of this technology for IoT applications with time constraints. In this paper, we present a new lightweight blockchain platform that is scalable to hold a large number of transactions and with acceptable latency times. We have designed a new rapid consensus algorithm that improves PBFT to apply it in a random cluster with a small number of Miners. This will enable multiple consensus on different clusters to be executed in parallel to reduce the complexity of PBFT, have acceptable latency and increase the scalability. The evaluations carried out on our proposal by comparing it with other pipeline PBFT improvement approaches, show that our approach has better latency that is still accessible even with a high load of transactions.", "Published in": [{"name": "2024 IEEE 27th International Symposium on Real-Time Distributed Computing (ISORC)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10551300/proceeding"}], "Authors": [{"name": "Rabeb Ben Othmen", "from": "CRISTAL Lab, RAMSIS Team, (ENSI), University of Manouba, Manouba, Tunisia"}, {"name": "Wassim Abbessi", "from": "CRISTAL Lab, RAMSIS Team, (ENSI), University of Manouba, Manouba, Tunisia"}, {"name": "Sofiane Ouni", "from": "CRISTAL Lab, RAMSIS Team, (ENSI), University of Manouba, Manouba, Tunisia"}, {"name": "Wafa Badreddine", "from": "Laboratoire Modelisation, Information, Systemes (MIS), Université de Picardie Jules Verne, Amiens, France"}, {"name": "Gilles Dequen", "from": "Laboratoire Modelisation, Information, Systemes (MIS), Université de Picardie Jules Verne, Amiens, France"}], "IEEE keywords": ["Scalability", "Pipelines", "Real-time systems", "Blockchains", "Proposals", "Internet of Things", "Security"], "Author Keywords": ["PBFT", "parallel consensus", "Blockchain platform", "low latency", "IoT blockchain"]}