{"Title": "Warehousing and Distribution of Agricultural products using Blockchain", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IC3IoT60841.2024.10550328", "Date of Publication": "17-18 April 2024", "abstract": "The Agri-Connect2.0 technology set up a problem with the farming business workshop. This weakness is shown by how hard it's for growers to sell their crops at prices that are allowed to be fair. In order to break this problem, our group came up with the idea for the Agri-Connect PWA app, which is a web operation that makes life easy for growers. Our PWA, which is called Agri-Connect, gives growers the freedom to decide how important they want to charge for their recently gathered goods. growers are more likely to get the plutocrat they earn from the trade of their goods if they do not pay commissions to mediators and rather make direct connections with guests. Also, the original portion shops, which are also used to store the particulars, help with the distribution of ranch goods and with getting those goods to where they need to go. Within each portion shop, there are separate doors for managing orders and storing information about guests and growers. All of these spots are translated with blockchain technology to make sure they work and are open to everyone. Our Progressive Web operation(PWA) works well with WhatsApp, so growers can now partake information about their crops and talk to buyers through an easy-to-use point. This was possible because our PWA was linked to WhatsApp. Because of this, it's easier for growers to vend their goods. Our thing is to close the gap between husbandry and technology so that growers can have further control over their businesses and make further plutocrats. We plan to do this by taking advantage of how numerous people use WhatsApp and how easy it's to use. It's a one-of-a-kind result that was made to change the agrarian business and give growers more fair ways to vend their goods. This exact answer is called Agri-Connect PWA.", "Published in": [{"name": "2024 International Conference on Communication, Computing and Internet of Things (IC3IoT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550185/proceeding"}], "Authors": [{"name": "Suthahar Ponnuchamy", "from": "Department of Information Technology, Sri Sai Ram Institute of Technology, Chennai, India"}, {"name": "S Vinish", "from": "Department of Information Technology, Sri Sai Ram Institute of Technology, Chennai, India"}, {"name": "N Sowrerajan", "from": "Department of Information Technology, Sri Sai Ram Institute of Technology, Chennai, India"}, {"name": "K A Jagadishwaran", "from": "Department of Information Technology, Sri Sai Ram Institute of Technology, Chennai, India"}], "IEEE keywords": ["Freeware", "Conferences", "Warehousing", "Crops", "Blockchains", "Telecommunication computing", "Internet of Things"], "Author Keywords": ["Progressive web Application", "Digital Marketing", "No brokerage amount", "Ration shops", "User friendly"]}