{"Title": "Generative AI-enabled Blockchain Networks: Fundamentals, Applications, and Case Study", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/MNET.2024.3412161", "Date of Publication": "11 June 2024", "abstract": "Generative Artificial Intelligence (GAI) has recently emerged as a promising solution to address critical challenges of blockchain technology, including scalability, security, privacy, and interoperability. In this paper, we first introduce GAI techniques, outline their applications, and discuss existing solutions for integrating GAI into blockchains. Then, we discuss emerging solutions that demonstrate the effectiveness of GAI in addressing various challenges of blockchain, such as detecting unknown blockchain attacks and smart contract vulnerabilities, designing key secret sharing schemes, and enhancing privacy. Moreover, we present a case study to demonstrate that GAI, specifically the generative diffusion model, can be employed to optimize blockchain network performance metrics. Experimental results clearly show that, compared to a baseline traditional AI approach, the proposed generative diffusion model approach can converge faster, achieve higher rewards, and significantly improve the throughput and latency of the blockchain network. Additionally, we highlight future research directions for GAI in blockchain applications, including personalized GAI-enabled blockchains, GAI-blockchain synergy, and privacy and security considerations within blockchain ecosystems.", "Published in": [{"name": "IEEE Network", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=65"}], "Authors": [{"name": "Cong T. Nguyen", "from": "Institute of Fundamental and Applied Sciences and the Faculty of Information Technology, Duy Tan University, Vietnam"}, {"name": "Yinqiu Liu", "from": "School of Computer Science and Engineering, Nanyang Technological University, Singapore"}, {"name": "Hongyang Du", "from": "School of Computer Science and Engineering, Nanyang Technological University, Singapore"}, {"name": "Dinh Thai Hoang", "from": "School of Electrical and Data Engineering, University of Technology Sydney, Australia"}, {"name": "Dusit Niyato", "from": "School of Computer Science and Engineering, Nanyang Technological University, Singapore"}, {"name": "Diep N. Nguyen", "from": "School of Electrical and Data Engineering, University of Technology Sydney, Australia"}, {"name": "Shiwen Mao", "from": "Department of Electrical and Computer Engineering, Auburn University, Auburn, USA"}], "IEEE keywords": ["Blockchains", "Smart contracts", "Security", "Consensus protocol", "Scalability", "Privacy", "Data privacy"], "Author Keywords": []}