{"Title": "Uncover the Premeditated Attacks: Detecting Exploitable Reentrancy Vulnerabilities by Identifying Attacker Contracts", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1145/3597503.3639153", "Date of Publication": "14-20 April 2024", "abstract": "Reentrancy, a notorious vulnerability in smart contracts, has led to millions of dollars in financial loss. However, current smart contract vulnerability detection tools suffer from a high false positive rate in identifying contracts with reentrancy vulnerabilities. Moreover, only a small portion of the detected reentrant contracts can actually be exploited by hackers, making these tools less effective in securing the Ethereum ecosystem in practice. In this paper, we propose BlockWatchdog, a tool that focuses on detecting reentrancy vulnerabilities by identifying attacker contracts. These attacker contracts are deployed by hackers to exploit vulnerable contracts automatically. By focusing on attacker contracts, BlockWatchdog effectively detects truly exploitable reentrancy vulnerabilities by identifying reentrant call flow. Additionally, BlockWatchdog is capable of detecting new types of reentrancy vulnerabilities caused by poor designs when using ERC tokens or user-defined interfaces, which cannot be detected by current rulebased tools. We implement BlockWatchdog using cross-contract static dataflow techniques based on attack logic obtained from an empirical study that analyzes attacker contracts from 281 attack incidents. BlockWatchdog is evaluated on 421,889 Ethereum contract bytecodes and identifies 113 attacker contracts that target 159 victim contracts, leading to the theft of Ether and tokens valued at approximately 908.6 million USD. Notably, only 18 of the identified 159 victim contracts can be reported by current reentrancy detection tools.", "Published in": [{"name": "2024 IEEE/ACM 46th International Conference on Software Engineering (ICSE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548016/proceeding"}], "Authors": [{"name": "Shuo Yang", "from": "Sun Yat-sen University, Zhuhai, China"}, {"name": "Jiachi Chen", "from": "Sun Yat-sen University, Zhuhai, China"}, {"name": "Mingyuan Huang", "from": "Sun Yat-sen University, Zhuhai, China"}, {"name": "Zibin Zheng", "from": "Sun Yat-sen University, Zhuhai, China"}, {"name": "Yuan Huang", "from": "Sun Yat-sen University, Zhuhai, China"}], "IEEE keywords": ["Computer hacking", "Smart contracts", "Ecosystems", "Focusing", "Software", "Contracts", "Software engineering"], "Author Keywords": ["Software and its engineering →Software verification and validation", "Smart Contract", "Dataflow Analysis", "Reentrancy", "Attacker Identification", "Ethereum"]}