{"Title": "Blockchain Technology for Medical Records Security Using Fit Viability Approach", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/InCACCT61598.2024.10551119", "Date of Publication": "02-03 May 2024", "abstract": "For patients, accurate and comprehensive medical records are an incredible asset. During medical services, privacy protection and the integrity of sensitive medical information are critical concerns. Blockchain technology, renowned for its immutable and decentralized nature, presents a promising solution to safeguarding these critical records. This research paper delves into the patient perspective concerning the utilization of blockchain to fortify healthcare document security. In addition, the blockchain’s properties were assessed concerning the healthcare supply chain using the Task Technology Fit (TTF) framework and the Fit-Viability Model (FVM). An empirical study of 296 customers/patients and healthcare professionals from medical sector shall evaluate fit and viability of blockchain technology adoption for storage and protection of medical records. The Fit and Viability framework was analyzed implementing structural equation modelling to access the adoption of blockchain technology in medical sector. Research findings indicate that task-technology fit, and environment technology fit significantly influenced functional benefits and symbolic benefits respectively. Further function benefits and viability had significant positive impact on BCT adoption. However Symbolic benefits were found to be insignificant for BCT adoption. In conclusion, this research advocates for a paradigm shift in healthcare document security, emphasizing patient empowerment and trust through blockchain technology. By centering on patient perspectives, concerns, and preferences, this paper advocates for the adoption of blockchain solutions having a significant impact due to functional benefits that not only fortify document security but also prioritize consumers/patient’s confidence and participation in their healthcare journey.", "Published in": [{"name": "2024 2nd International Conference on Advancement in Computation & Computer Technologies (InCACCT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550186/proceeding"}], "Authors": [{"name": "Rashi Agrawal", "from": "Symbiosis Centre for Information Technology, Symbiosis International (Deemed University), Pune, India"}, {"name": "Kanchan Pranay Patil", "from": "Symbiosis Centre for Information Technology, Symbiosis International (Deemed University), Pune, India"}], "IEEE keywords": ["Industries", "Privacy", "Supply chains", "Medical services", "Organizations", "Mathematical models", "Blockchains"], "Author Keywords": ["Blockchain", "Medical Records", "Fit-viability Model", "Task Technology fit", "Environmental Technology Fit", "Symbolic benefits", "Functional benefits"]}