{"Title": "Blockchain-enabled Secure and Reliable Management for Digital Components in Digital Twin Optical Network", "Pages": "1 - 16", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/JLT.2024.3412960", "Date of Publication": "11 June 2024", "abstract": "Digital twin (DT) technology facilitates the integration of physical and virtual worlds, enabling optical networks to realize efficient, intelligent, and accurate monitoring, prediction, and maintenance. However, the combination of DT and optical networks creates new security challenges on network management. Accurate and complete modeling, decision-making, and feedback of DT optical networks (DTONs) are unattainable without ensuring the reliability and integrity of data sources, collected data, models, and feedback instructions. To address these problems, a blockchain-based DTON architecture is designed, along with a blockchain-based solution to ensure the security and credibility of data sources, and the integrity and immutability of collected data, models, and instructions. The chaincode was developed to implement the functions of blockchain-based DTON, including device registration, mirror and functional model registration, data storage, and decision making delivery. Furthermore, the proposed solution is deployed using Hyperledger Fabric, and validated with multiple examples, such as routing computation, quality of transmission (QoT) estimation and link optimization, and failure prediction. Hyperledger Caliper was used for determining the effects of send rate, database, number of organizations on the performance, and resource consumption. The experimental results have demonstrated improvements in network performance, model accuracy, and service quality with the implementation of blockchain-based DTON.", "Published in": [{"name": "Journal of Lightwave Technology", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=50"}], "Authors": [{"name": "Yue Pang", "from": "College of Electronic Engineering, Beijing University of Posts and Telecommunications, Beijing, China"}, {"name": "Min Zhang", "from": "College of Electronic Engineering, Beijing University of Posts and Telecommunications, Beijing, China"}, {"name": "Yidi Wang", "from": "College of Electronic Engineering, Beijing University of Posts and Telecommunications, Beijing, China"}, {"name": "Mingzhi Tang", "from": "College of Electronic Engineering, Beijing University of Posts and Telecommunications, Beijing, China"}, {"name": "Yao Zhang", "from": null}, {"name": "Yonghan Wu", "from": null}, {"name": "Chunyu Zhang", "from": null}, {"name": "Lifang Zhang", "from": null}, {"name": "Danshi Wang", "from": "College of Electronic Engineering, Beijing University of Posts and Telecommunications, Beijing, China"}], "IEEE keywords": ["Optical fiber networks", "Data models", "Blockchains", "Security", "Reliability", "Physical layer", "Optimization"], "Author Keywords": []}