{"Title": "A Smart contract based automated cervical cancer prediction using ensemble machine learning", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/InCACCT61598.2024.10551245", "Date of Publication": "02-03 May 2024", "abstract": "Cervical cancer is a serious health concern that entails high risks for individuals due to delayed detection and treatment worldwide. Formal screening for the condition is challenging in both developed and developing countries due to a number of factors, including medical costs, access to healthcare facilities, social norms, and delayed symptom manifestation. Bypassing conventional, time-consuming medical procedures, machine learning presents a promising path for the efficient and economical early diagnosis of a variety of diseases, including cervical cancer. However, the fact that existing machine classification techniques for identifying diseases rely heavily on the predictive accuracy of a single classifier poses a significant drawback. Single classification methods alone might not provide the best predictions because of bias, over-fitting, improper handling of noisy data, and outliers, among other issues. Moreover, machine learning algorithms deals with sensitive patient data therefore Security measures are necessary to prevent unauthorized access and safeguard individual and organisations’ privacy, guard against model tampering. This paper proposes a novel framework for cervical cancer automated prediction using ensemble model training and blockchain smart contracts. The research records a noteworthy improvement in prediction test accuracy of 99.7% and train accuracy of 93%, surpassing the accuracy of predictions made by individual categorization techniques.", "Published in": [{"name": "2024 2nd International Conference on Advancement in Computation & Computer Technologies (InCACCT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550186/proceeding"}], "Authors": [{"name": "Jaideep Kaur Mudhar", "from": "Chandigarh University, Mohali, India"}, {"name": "Jyoteesh Malhotra", "from": "NIT, Delhi, Delhi, India"}, {"name": "Shalli Rani", "from": "Chitkara University Institute of Engineering and Technology, Chitkara University, Punjab, India"}], "IEEE keywords": ["Training", "Computational modeling", "Smart contracts", "Medical services", "Machine learning", "Predictive models", "Blockchains"], "Author Keywords": ["machine learning", "blockchain", "cervical cancer", "IoMT", "Smart contract"]}