{"Title": "A Threshold-Based Full-Decentralized Authentication and Key Agreement Scheme for VANETs Powered by Consortium Blockchain", "Pages": "1 - 17", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/TMC.2024.3412106", "Date of Publication": "11 June 2024", "abstract": "The authentication and key agreement (AKA) scheme for VANETs can produce a series of short-term session keys, which can be used to secure the vehicular communications across open and insecure wireless channels. Traditional VANETs AKA schemes tend to employ the centralized trust architecture as the core authentication backend, which raises concerns about system security and reliability. Recently, several VANETs AKA schemes that are constructed on decentralized trust architecture have been proposed. However, these schemes do not achieve full decentralization and tend to suffer from key exposure issues, insufficient performance, and lack of optimization for on-chain storage costs. To address these shortcomings, we propose a threshold-based full-decentralized VANETs AKA scheme that is powered by consortium blockchain. In our proposed scheme, the threshold-based voting concept is employed to mitigate the key exposure issue inherent to the network infrastructure. Furthermore, we leverage lightweight cryptography in conjunction with the Cuckoo filter to reduce computational, communication, and on-chain operation costs brought by cryptographic operations and smart contracts. The security proof together with the cryptographic protocol validation tool prove the security of our proposed scheme, whereas the simulation experiment demonstrates the efficiency of our proposed scheme.", "Published in": [{"name": "IEEE Transactions on Mobile Computing", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7755"}], "Authors": [{"name": "Lu Wei", "from": "Key Laboratory of Intelligent Computing and Signal Processing of Ministry of Education, the School of Computer Science and Technology, Anhui University, Hefei, China"}, {"name": "Yongjuan Zhang", "from": "Key Laboratory of Intelligent Computing and Signal Processing of Ministry of Education, the School of Computer Science and Technology, Anhui University, Hefei, China"}, {"name": "Jie Cui", "from": "Key Laboratory of Intelligent Computing and Signal Processing of Ministry of Education, the School of Computer Science and Technology, Anhui University, Hefei, China"}, {"name": "Hong Zhong", "from": "Key Laboratory of Intelligent Computing and Signal Processing of Ministry of Education, the School of Computer Science and Technology, Anhui University, Hefei, China"}, {"name": "Irina Bolodurina", "from": "Faculty of Mathematics and Information Technologies, Orenburg State University, Orenburg, Russia"}, {"name": "Debiao He", "from": "School of Cyber Science and Engineering, Wuhan University, Wuhan, China"}], "IEEE keywords": ["Authentication", "Costs", "Blockchains", "Computer architecture", "Computational efficiency", "Hash functions", "Cryptography"], "Author Keywords": []}