{"Title": "Blockchain Security Using Q-Pragmatic-Sensitive Feature Analysis to Preserve Privacy", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICDCECE60827.2024.10549203", "Date of Publication": "26-27 April 2024", "abstract": "Healthcare data contains large amounts of personal information and is privacy sensitive. The healthcare sector needs privacy protection to keep private and sensitive information safe from unauthorized access. Security problems are raised by fundamental sharing difficulties involving personal information setting to securely forecast sensitive medical data using blockchain technology to address this issue. To solve the problem issue, propose a quasi-sensitive identification of blockchain security using tried-and-true partition fold padding encryption (PFPE) to improve the security of healthcare transactions. The Q-Pragmatic-Sensitive Feature Analysis (QPSFA) determines the terms related to sensitive privacy features. Finally, the Provable Fold Padding Encryption, and the authentication procedure is completed by using an Access Verification-based role to verify it. To ensure that, in a blockchain, the private data are cleansed and placed into data blocks. This suggests that the proposed system outperforms high accuracy up to 90%, as well security up to 94 % high insecurity compared to previous approaches regarding sensitivity and specificity rate performance and prediction accuracy.", "Published in": [{"name": "2024 Third International Conference on Distributed Computing and Electrical Circuits and Electronics (ICDCECE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548017/proceeding"}], "Authors": [{"name": "S. Punithavathi", "from": "Department of Computer Science, Vels Institute of Science Technology & Advanced Studies, Chennai, India"}, {"name": "S. Jeyalaksshmi", "from": "Department of Information Technology, School of Computing Science Vels Institute of Science Technology & Advanced Studies, Chennai, India"}], "IEEE keywords": ["Privacy", "Sensitivity", "Authentication", "Medical services", "Organizations", "Sensitivity and specificity", "Blockchains"], "Author Keywords": ["Security", "Blockchain", "Term Frequency Behavior Analysis", "privacy-preserving", "user", "quasi-identifier"]}