{"Title": "Blockchain-Based Mobile Application for Traffic Accident Report's Management", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IRASET60544.2024.10548282", "Date of Publication": "16-17 May 2024", "abstract": "Nowadays, the proportion of traffic incidents is on the increase due to the rapid growth of vehicles, making it a per-sistent problem. Consequently, the number of amicable accident reports is unmeasurable. An effective management of accident information is a crucial element, especially in the absence of an information system for amicable accident report management. However, the use of traditional centralized systems is critical, as long as they fail to present secure, transparent, reliable, and trustworthy platforms for accident's report management. This paper provides an innovative solution. It's a use case study of developing a Blockchain and interplanetary file system (IPFS) protocol-based system for traffic report management, using a mobile application. This application could be used at the time of the traffic accident. By using the application, road users can fill out the accident report at the same time as the accident while maintaining data authenticity, integrity, and reliability, and without the need for a third trusted party. Furthermore, the application reflects the safety performance of insurance companies and allows them to put an end to oversights, inaccuracies, or incorrect information when completing the amicable accident report. A better understanding and streamlining the process of handling accident reports is an essential component to enhance emergency response, promote road safety, and mitigate the economic impacts of traffic incidents, for both users and insurance companies.", "Published in": [{"name": "2024 4th International Conference on Innovative Research in Applied Science, Engineering and Technology (IRASET)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548014/proceeding"}], "Authors": [{"name": "Manal Jlil", "from": "LISAC Laboratory, Faculty of Sciences Dhar EI Mahraz, Sidi Mohamed Ben Abdellah University, FEZ, Morocco"}, {"name": "Kaoutar Jouti", "from": "LISAC Laboratory, Faculty of Sciences Dhar EI Mahraz, Sidi Mohamed Ben Abdellah University, FEZ, Morocco"}, {"name": "Jaouad Boumhidi", "from": "LISAC Laboratory, Faculty of Sciences Dhar EI Mahraz, Sidi Mohamed Ben Abdellah University, FEZ, Morocco"}, {"name": "Chakir Loqman", "from": "LISAC Laboratory, Faculty of Sciences Dhar EI Mahraz, Sidi Mohamed Ben Abdellah University, FEZ, Morocco"}], "IEEE keywords": ["Insurance", "Companies", "Road safety", "Mobile applications", "Blockchains", "Reliability", "InterPlanetary File System"], "Author Keywords": ["Blockchain technology", "Smart Contracts", "ami-cable reports", "traffic accidents", "data security"]}