{"Title": "Enhancing Pharmaceutical Security: SecureMeds -A Robust Drug Traceability Platform", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/InCACCT61598.2024.10550976", "Date of Publication": "02-03 May 2024", "abstract": "This paper presents a blockchain and AI-based methodology to prevent drug counterfeiting within the supply Chain. Incidents of counterfeit medicines, particularly in densely populated developing nations like India, have the potential to spiral into major disasters. This paper examines the effect of counterfeit medicine impacting the health & life of countless individuals. Additionally, it could also result in substantial financial and reputational repercussions for both governmental bodies and pharmaceutical companies. Thorough research and detailed investigation have shown substantial advantages to using blockchain technology over traditional systems. The traditional client-server centralized systems face significant complications concerning security and traceability. In contrast, the proposed blockchain-based architecture assures transparency and open-ness within the medicine supply chain. The architecture takes advantage by leveraging blockchain technology with respect to decentralization, tamper-proofing, and Traceability. Each product registered on the blockchain possesses a QR code for detailed information retrieval and ownership history, aiding in identifying counterfeit origins. Furthermore, each product also comes with authenticated certificates and lab reports. These reports are verified by drug administration authorities to strengthen the reliability of the product. As a result, developed system offers robust measures against counterfeit origins as compared to traditional and other blockchain based systems.", "Published in": [{"name": "2024 2nd International Conference on Advancement in Computation & Computer Technologies (InCACCT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550186/proceeding"}], "Authors": [{"name": "Aseem Kulkarni", "from": "Department of Information Technology, Vivekanand Education Society’s Institute of Technology, Mumbai, India"}, {"name": "Vineet Vijayakumar", "from": "Department of Information Technology, Vivekanand Education Society’s Institute of Technology, Mumbai, India"}, {"name": "Dev Nikam", "from": "Department of Information Technology, Vivekanand Education Society’s Institute of Technology, Mumbai, India"}, {"name": "Abhishek Patil", "from": "Department of Information Technology, Vivekanand Education Society’s Institute of Technology, Mumbai, India"}, {"name": "Asma Parveen I. Siddavatam", "from": "Department of Information Technology, Vivekanand Education Society’s Institute of Technology, Mumbai, India"}], "IEEE keywords": ["Drugs", "Sentiment analysis", "Spirals", "Supply chains", "QR codes", "Companies", "Blockchains"], "Author Keywords": ["Blockchain", "AI", "Ethereum", "Smart contracts", "traceability", "Supply chain", "Drug counterfeiting", "RBAC"]}