{"Title": "A Blockchain Framework for Efficient Resource Allocation in Edge Computing", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/TNSM.2024.3411796", "Date of Publication": "12 June 2024", "abstract": "Edge computing provides low-latency computing services. Since Edge computing Service Providers (ESPs) are competitors, mutual distrust and distrust towards the platform may exist if a centralized resource allocation platform is used. To address trust issues, we propose a blockchain framework for resource allocation in edge computing that ensures decentralization and transparency in resource allocation. We also offer a novel consensus mechanism for the framework, Proof of Efficient Resource Allocation (PoERA), where ESPs compete to give the best solution to the resource allocation problem to become the leader and earn rewards. The framework addresses the trust issue, single-point failure, and the biased nature of the centralized platform. PoERA includes a novel self-stabilizing leader election algorithm, ensuring no forking, final consensus and consistency, which is lacking in most existing works. The work encourages the participation of both leader and non-leader ESPs by rewarding them based on the quality of their solutions. We perform CAP theorem analysis, demonstrating that Consistency (C) and Availability (A) are more important for the proposed framework than Partition tolerance (P). We conduct experiments to show that the work ensures decentralization, fair competition, and fair reward distribution to miners, eventually improving resource allocation in edge computing.", "Published in": [{"name": "IEEE Transactions on Network and Service Management", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028"}], "Authors": [{"name": "Gaurav Baranwal", "from": "Department of Computer Science, BHU, Varanasi, India"}, {"name": "Dinesh Kumar", "from": "Department of Computer Science and Engineering, NIT, Jamshedpur, India"}, {"name": "Amit Biswas", "from": "Department of Computer Science and Engineering, MNNIT, Allahabad, India"}, {"name": "Ravi Yadav", "from": "School of Computer Science, UPES, Dehradun, India"}], "IEEE keywords": ["Resource management", "Consensus protocol", "Edge computing", "Peer-to-peer computing", "Probabilistic logic", "Smart contracts", "Voting"], "Author Keywords": []}