{"Title": "Digital Land Registration Using Smart Contracts", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/InCACCT61598.2024.10551084", "Date of Publication": "02-03 May 2024", "abstract": "Digital land registration plays a pivotal role in modernizing and securing land ownership records. Issues with traditional land registration processes include slowness, fraud, and a lack of openness. The conventional land registration system, which is still in use in many nations, has several problems, including corruption, integrity issues, and inaccurate data. Document discrepancies resulting from data errors discovered during the land registration procedure give rise to ownership rights disputes. One use case involves several middleman and central institutions is land registration, which boosts trust and confidence in the system. By eliminating intermediaries and centralized organizations, land registration will be quicker. It is challenging to keep track of who owns what land when hundreds or even thousands of land records need to be kept up to date. A straightforward decentralized land registration application was created using the Ethereum Blockchain. This technology allows the transaction process to have just two clients (buyer, seller) and to be visible at all times. This paper presents a novel approach to digital land registration using blockchain technology and smart contracts. The research looks at these technologies’ intricacies and speculates on how they might totally change the process of registering land. This paper offers a thorough examination of existing state of affairs and potential obstacles with regard to the integration of blockchain technology and smart contracts into land registration increases efficiency and computational costs thus by enhancing digitizing land records by improving trust and transparency.", "Published in": [{"name": "2024 2nd International Conference on Advancement in Computation & Computer Technologies (InCACCT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550186/proceeding"}], "Authors": [{"name": "A. Ramana Lakshmi", "from": "Department of Computer Science and Engineering, Prasad V Potluri Siddhartha Institute of Technology, Vijayawada, Andhra Pradesh"}, {"name": "Chitluri Nandini", "from": "Department of Computer Science and Engineering, Prasad V Potluri Siddhartha Institute of Technology, Vijayawada, Andhra Pradesh"}, {"name": "Gadde Venkata Maruthi Durga Rayudu", "from": "Department of Computer Science and Engineering, Prasad V Potluri Siddhartha Institute of Technology, Vijayawada, Andhra Pradesh"}, {"name": "Gorantla Mownisha", "from": "Department of Computer Science and Engineering, Prasad V Potluri Siddhartha Institute of Technology, Vijayawada, Andhra Pradesh"}, {"name": "Bondalapati Jaswanth Sai", "from": "Department of Computer Science and Engineering, Prasad V Potluri Siddhartha Institute of Technology, Vijayawada, Andhra Pradesh"}], "IEEE keywords": ["Smart contracts", "Organizations", "Proof of Work", "Real-time systems", "Blockchains", "Peer-to-peer computing", "Fraud"], "Author Keywords": ["Blockchain", "Decentralization", "Ethereum", "Smart Contracts", "Avalanche Effect", "Peer to Peer", "Ganache", "Application Binary Interface", "Truffle", "Proof of Work"]}