{"Title": "Construction of Enterprise Financial Information Management System Based on Blockchain Technology", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICDCECE60827.2024.10548982", "Date of Publication": "26-27 April 2024", "abstract": "As a software system used to manage and process enterprise financial data, the enterprise financial information management system covers many aspects including financial accounting, cost management, budgeting and personnel management. It can be said that it can effectively manage many financial activities within the enterprise and make decisions to a certain extent. In order to improve the performance of the enterprise financial information management system and ensure its security and privacy, this paper believes that it is necessary to use blockchain technology to optimize the enterprise financial information management system from these two perspectives. In the security experiment, the experimental group based on the proposed method and the comparison group based on other mainstream methods was compared. The average recognition rate of the experimental group for malicious attacks was 98.10%, while the average recognition rate of the control group was only 95.38%. Through the difference of experimental results between the two groups, it can be said that the method in this paper has excellent performance in improving the security of enterprise financial information management system.", "Published in": [{"name": "2024 Third International Conference on Distributed Computing and Electrical Circuits and Electronics (ICDCECE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548017/proceeding"}], "Authors": [{"name": "Yanqing Chen", "from": "College of Accounting, Zhanjiang University of Science and Technology, Zhanjiang, Guangdong, China"}], "IEEE keywords": ["Privacy", "Face recognition", "Feature extraction", "Software systems", "Information management", "Blockchains", "Security"], "Author Keywords": ["blockchain technology", "enterprise financial information", "management system", "face feature point detection algorithm"]}