{"Title": "Navigating Emerging Technologies: A Comprehensive Review of 5G and the Evolving Landscape of 6G Communication", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IC3IoT60841.2024.10550305", "Date of Publication": "17-18 April 2024", "abstract": "The purpose of this review is to investigate the application of artificial intelligence (AI), machine learning (ML), and the internet of things (IoT) within the context of 5G and 6G. The abstract provides an overview of this investigation. It sheds light on the growing demand for these technologies as well as the ways in which they could encourage innovation across a variety of business sectors. The most recent work in these disciplines will be examined, and insights into the potential and difficulties of implementing it in 5G and 6G networks will be provided by the study. The focus of the review is discussed briefly in the abstract; however, additional information on specific research and development fields would be valuable. It is also important to explore the potential repercussions that these technologies may have in the context of 5G and 6G, including the implications that they may have on businesses and on society.", "Published in": [{"name": "2024 International Conference on Communication, Computing and Internet of Things (IC3IoT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550185/proceeding"}], "Authors": [{"name": "R. Dhanasekar", "from": "DEEE SRI SAIRAM INSTITUTE OF TECHNOLOGY, CHENNAI, INDIA"}, {"name": "L. Vijayaraja", "from": "DEEE SRI SAIRAM INSTITUTE OF TECHNOLOGY, CHENNAI, INDIA"}, {"name": "C Rithika", "from": "DEEE SRI SAIRAM INSTITUTE OF TECHNOLOGY, CHENNAI, INDIA"}, {"name": "S Avanthika", "from": "DEEE SRI SAIRAM INSTITUTE OF TECHNOLOGY, CHENNAI, INDIA"}, {"name": "S. Thalapathiraj", "from": "DEPARTMENT OF MATHEMATICS, SRM INSTITUTE OF SCIENCE AND TECHNOLOGY,VADAPALANI CAMPUS, CHENNAI, INDIA"}, {"name": "R Premkumar", "from": "DEPARTMENT OF ELECTRONICS AND INSTRUMENTATION ENGINEERING, SRI SAIRAM ENGINEERING COLLEGE, CHENNAI, INDIA"}], "IEEE keywords": ["6G mobile communication", "Technological innovation", "5G mobile communication", "Reviews", "Navigation", "Machine learning", "Telecommunication computing"], "Author Keywords": ["Artificial Intelligence", "Machine learning", "Internet of Things"]}