{"Title": "Analysing the Quality and Management of Data in Big Data", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICDCECE60827.2024.10548691", "Date of Publication": "26-27 April 2024", "abstract": "Big data analytics delves into these immense datasets to reveal hidden patterns and correlations, yet its pervasive use raises substantial security and privacy concerns. This article centers on the specific issues concerning privacy and security within the realm of big data, distinguishing between these concerns and outlining their distinct requirements. The focus is on various privacy strategies, including L-diversity, k-anonymity, HyBrEx, and T-closeness, examining their practical applications in diverse business contexts. Privacy protection methods have surfaced throughout various stages of the big data life cycle, aiming to ensure privacy during data creation, retention, and handling. This paper provides an extensive review of these privacy mechanisms while addressing the challenges encountered by current approaches. As the extended comprehensive study is experimented with features extraction techniques such as Principle component analysis (PCA), Independent component analysis (ICA), Linear discriminant analysis(LDA) the evaluated performance in terms of accuracy achieved with 98%, 99% and 95% respectively.", "Published in": [{"name": "2024 Third International Conference on Distributed Computing and Electrical Circuits and Electronics (ICDCECE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548017/proceeding"}], "Authors": [{"name": "Pratheesh R", "from": "School of Computing Sciences, Vels Institute of Science, Technology & Advanced Studies"}, {"name": "V. Divya", "from": "Department of Information Technology, School of Computing Sciences, Vels Institute of Science, Technology & Advanced Studies, Chennai, India"}], "IEEE keywords": ["Privacy", "Differential privacy", "Technological innovation", "Shape", "Reviews", "Big Data", "Security"], "Author Keywords": ["big data", "data analytics", "security", "privacy concerns", "utilization", "privacy strategies", "k-anonymity", "t-closeness", "l-diversity"]}