{"Title": "Dual-Signature Blockchain-Based Key Sharing Protocol for Secure V2V Communications in Multi-Domain IoV Environments", "Pages": "1 - 0", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/TITS.2024.3410114", "Date of Publication": "13 June 2024", "abstract": "Vehicle to vehicle (V2V) communications can facilitate traffic congestion control, reduce crashes, and enhance general safety. These goals can be reached only if vehicles communicate securely and anonymously. To this end, numerous key sharing protocols have been devised and proposed in recent years. Nevertheless, delving into the current vehicular protocols demonstrates that they have several drawbacks. First and the foremost, near all of them are improper for multi-domain internet of vehicle (IoV) environments and second, most of them failed to reach a proper tradeoff between security and effectiveness. Besides, the existing multi-domain protocols, which have been suggested for other applications, cannot still meet the desired requirements. To bridge this gap, this paper presents a resource-efficient privacy-preserving key sharing protocol for anonymous V2V communications in the IoV environments. In the proposed protocol, we utilize the blockchain and an inventive dual-signature approach. The former eases cross-domain authentication and the latter reduces the communication rounds. Security and efficiency analyses, respectively, indicate the protocol can withstand attacks and execute quite fast. Additionally, comparisons with top-related protocols show the suitable stage and precedence of the proposed multi-domain protocol.", "Published in": [{"name": "IEEE Transactions on Intelligent Transportation Systems", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6979"}], "Authors": [{"name": "Dariush Abbasinezhad-Mood", "from": "Department of Computer Engineering, Imam Reza International University, Mashhad, Iran"}, {"name": "Hadi Ghaemi", "from": "Department of Computer Engineering, Ferdowsi University of Mashhad, Mashhad, Iran"}], "IEEE keywords": ["Protocols", "Servers", "Blockchains", "Security", "Authentication", "Vehicular ad hoc networks", "Computational efficiency"], "Author Keywords": []}