{"Title": "Securing EHRs with a Novel Token-based and PPoS Blockchain Methodology", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ACCESS.2024.3412793", "Date of Publication": "11 June 2024", "abstract": "Blockchain technology is vital in strengthening the security of private information, particularly in the healthcare sector. Its features, such as confidentiality, decentralization, security and privacy, address challenges traditional healthcare systems face, such as phishing, denial of service and identity theft attacks. In this regard, our research paper presents a security solution specifically tailored for healthcare applications. This solution integrates decentralized identity management (DIDs) for identity verification, employs the advanced ChaCha20-Poly1305 encryption algorithm to ensure data confidentiality, and utilizes a token-based mechanism for immutable record keeping. Furthermore, it incorporates a pure proof of stake (PPoS) consensus mechanism to enhance system security while optimizing efficiency. This comprehensive and scalable system showcases improvements in cost effectiveness, time efficiency of an average of 6,5 seconds and overall data protection compared to traditional approaches used in healthcare data security.", "Published in": [{"name": "IEEE Access", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6287639"}], "Authors": [{"name": "Rihab Benaich", "from": "National School of Applied Sciences, Laboratory of Engineering Sciences, Ibn Tofail University, Kenitra, Morocco"}, {"name": "Saida El Mendili", "from": "National School of Applied Sciences, Laboratory of Engineering Sciences, Ibn Tofail University, Kenitra, Morocco"}, {"name": "Youssef Gahi", "from": "National School of Applied Sciences, Laboratory of Engineering Sciences, Ibn Tofail University, Kenitra, Morocco"}], "IEEE keywords": ["Medical services", "Security", "Blockchains", "Electronic medical records", "Cloud computing", "Data security", "Privacy", "Decentralized applications"], "Author Keywords": []}