{"Title": "Secure Smart Home Data by Using Blockchain Technology with Hash Algorithm", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/CSNT60213.2024.10545898", "Date of Publication": "06-07 April 2024", "abstract": "The project “Secure Smart Home Data by Using Blockchain Technology with Hash Algorithm” focuses on incorporating two timeless technological concepts that is, blockchain and secure hash algorithms. Smart home is a concept that is been trending these days with IoT devices taking control of the houses making people's lives much easier. But the data collected from them is not stored properly. With the traditional methodology where the data is stored on a centralized cloud network, it is prone to cyberattacks, single point of failure and also involves tampering. Because of this, the sensitive data of the users are compromised from time to time. This arises mainly due to the centralized network system of the cloud and to tackle that, we approached a decentralized network system which Blockchain. It enables us to store data across the world that too in a decentralized format resulting in a more secure and safe environment for those sensitive data. This is our proposed solution as well. To secure the smart home data with blockchain technology and to further enhance reliability, our proposed approach incorporates a modified version of SHA-512. In summary, our focus is on securing Smart Home IoT data in the cloud by integrating blockchain technology, advanced encryption methods, and robust hash algorithms like SHA-512 to ensure the utmost protection and authorized access for large-scale datasets from diverse Smart Home sources.", "Published in": [{"name": "2024 IEEE 13th International Conference on Communication Systems and Network Technologies (CSNT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10545643/proceeding"}], "Authors": [{"name": "Lukesh S", "from": "Department of Networking and Communications, School of Computing, Chennai, India"}, {"name": "Jagadesh J", "from": "Department of Networking and Communications, School of Computing, Chennai, India"}, {"name": "Pandimurugan V", "from": "Department of Networking and Communications, School of Computing, Chennai, India"}], "IEEE keywords": ["Technological innovation", "Smart homes", "Nanoscale devices", "Blockchains", "Software reliability", "Internet of Things", "Security"], "Author Keywords": ["Blockchain", "SHA256", "MD5", "Smart Home IOT Device", "Simulation", "Authentication"]}