{"Title": "Blockchain-Based Traffic Accident Handling Protocol Without Third-Party for VANETs", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/JIOT.2024.3414453", "Date of Publication": "14 June 2024", "abstract": "In Vehicular Ad-hoc Networks (VANETs), existing traffic accident handling schemes are adoptable only in the scenario with Roadside Unit (RSU) deployment, and the generation of accident reports relies on RSUs and witness vehicles. Without the confirmation from involved vehicles in the accident, it will probably cause disputes afterward, and RSU captured attacks may also affect authentication of vehicles and correctness of accident reports. To address the above issues, we propose a Vehicle to Vehicle (V2V) and Vehicle to RSU (V2R) authentication and traffic accident handling protocol, in which accident vehicles are sufficient to generate accident reports, thereby enhancing autonomy of the vehicular communication system and reducing reliance on external infrastructure. Furthermore, for ensuring integrity and traceability of accident reports, we utilize blockchain to keep registration information and jointly signed reports, which realizes efficient and secure mutual authentications in V2V and V2R protocols. Finally, for preserving privacy of vehicles, we integrate Elliptic Curve Cryptosystem (ECC) and symmetric encryption to design a dynamic pseudo-identity strategy, which still allows the registration center to track malicious vehicles. The formal security proof and comparative analysis validate that our protocol preserves higher security and lower overhead by comparison with related schemes.", "Published in": [{"name": "IEEE Internet of Things Journal", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907"}], "Authors": [{"name": "Qi Xie", "from": "Key Laboratory of Cryptography of Zhejiang Province, Hangzhou Normal University, Hangzhou, China"}, {"name": "Zixuan Ding", "from": "Key Laboratory of Cryptography of Zhejiang Province, Hangzhou Normal University, Hangzhou, China"}, {"name": "Qinyun Xie", "from": null}, {"name": "Xiao Tan", "from": "Key Laboratory of Cryptography of Zhejiang Province, Hangzhou Normal University, Hangzhou, China"}, {"name": "Debiao He", "from": "School of Cyber Science and Engineering, Wuhan University, Wuhan, China"}, {"name": "Wen Tang", "from": "Key Laboratory of Cryptography of Zhejiang Province, Hangzhou Normal University, Hangzhou, China"}], "IEEE keywords": ["Accidents", "Protocols", "Authentication", "Blockchains", "Security", "Vehicular ad hoc networks", "Privacy"], "Author Keywords": []}