{"Title": "Towards a Blockchain Generative AI Driven Education: An Exploratory Study", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IRASET60544.2024.10548898", "Date of Publication": "16-17 May 2024", "abstract": "Recently, Blockchain and Generative Artificial Intelligence (GAI) have become a popular subject for research in multiple disciplines. The educational sector has faced significant upheaval as it grapples with the fundamental pillars of knowledge acquisition, effective teaching, and meaningful learning experiences. The need for efficient educational systems that leverage trust and transparency as well as adaptation and personalization are needed more than anytime. The purpose of this paper is to provide an exploratory analysis examining the potential of GAI and Blockchain technology in addressing prevalent challenges within the field of education. First, we offer an overview of the literature related to the application of blockchain architectures and GAI models in educational contexts. Then, we provide a discussion on the potential synergies between these two transformative technologies, with the aim of enhancing the resilience and reliability of educational systems.", "Published in": [{"name": "2024 4th International Conference on Innovative Research in Applied Science, Engineering and Technology (IRASET)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548014/proceeding"}], "Authors": [{"name": "Ouassima Markouh", "from": "Data Sciences and Emerging Systems Laboratory USMBA Fez, Artificial Intelligence, Morocco"}, {"name": "Amina Adadi", "from": "Moulay Ismail University, Meknes, Morocco"}, {"name": "Mohammed Berrada", "from": "Data Sciences and Emerging Systems Laboratory USMBA Fez, Artificial Intelligence, Morocco"}], "IEEE keywords": ["Human computer interaction", "Electronic learning", "Generative AI", "Knowledge acquisition", "Education", "Blockchains", "Reliability"], "Author Keywords": ["Blockchain", "Generative AI", "Artificial Intelligence", "Education", "e-Learning"]}