{"Title": "Adaptive Migration Method for Virtual Network Functionality in Cloud and Blockchain Based Integrated Environment for Handling Socio-Economic Systems", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/TCE.2024.3411410", "Date of Publication": "13 June 2024", "abstract": "As Blockchain and Cloud computing are becoming more prevalent, the ability to adapt and maintain stability in virtual networks becomes increasingly important for socio-economic systems. The dynamic nature of VNF (virtual network functionality), which can be moved, replicated, or deleted based on network demands, requires efficient and effective algorithms for VNF adaptation and smoother functionality of socio-economic systems. Based on this, the study proposes the Migration Cost and Network Energy Consumption (MJOVME) algorithm for virtual network function adaptation based on bandwidth and other required resources, and proves its effectiveness. The experimental results reveal that the weighting factor value lies between 0.12 and 0.22 whereas the network energy loss shows diminishing trend under different bandwidths, while the migration cost loss is exhibiting an upward trend. The integration of VNF with Cloud and Blockchain environments leads to enhanced security, data integrity, scalability, and decentralized distributed management for socio-economic systems. As the number of SFC (service function chain) requests increases, the network energy loss of the MJOVME algorithm lies within 200 1200 migration cost as compared with the algorithm considered for comparative study which is approximately 0.2W104W higher than MJOVME. The MJOVME algorithm has attained an average resource utilization rate of 69.50% and a memory resource utilization rate of 66.78% which is commendable in integrated environment. The standard deviation of computing resources is 12.41% and the standard deviation of memory resources is 15.08%, lower than the comparative method. The proposed MJOVME algorithm has high effectiveness in adaptive migration of virtual network functions in integrated environment of Cloud and Blockchain and is of great significance for VNF migration when actual resource requirements are altered.", "Published in": [{"name": "IEEE Transactions on Consumer Electronics", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=30"}], "Authors": [{"name": "Weihan Li", "from": "Haidian District, Beijing, China"}, {"name": "Jianwei Guo", "from": "School of Traffic and Transportation, Beijing Jiaotong University, Beijing, China"}], "IEEE keywords": ["Cloud computing", "Resource management", "Blockchains", "Costs", "Bandwidth", "Security", "Heuristic algorithms"], "Author Keywords": []}