{"Title": "Research on Transparency and Optimization of Aviation Materials Supply Chain based on Blockchain", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/CSNT60213.2024.10546211", "Date of Publication": "06-07 April 2024", "abstract": "This research delves into the transformative impact of blockchain technology on the aviation material supply chain, with a focus on enhancing transparency and optimization. Using AC Airlines as a case study, the paper illustrates the substantial benefits derived from the implementation of blockchain in supply chain management. The results indicate a noteworthy 33% reduction in procurement cycle time, showcasing the efficiency gains achieved through blockchain. Additionally, there is a remarkable 40% decrease in average inventory costs, underscoring the financial advantages associated with blockchain adoption. The study emphasizes the significant improvement in transparency throughout the supply chain, a critical factor in the aviation industry. Blockchain technology not only streamlines processes but also enhances visibility, contributing to better decision-making and risk management. The findings further reveal a 66% increase in emergency material response efficiency, demonstrating the pivotal role of blockchain in facilitating quick and effective responses to unforeseen events. A key highlight of this research is the substantial 75% cut in annual supply chain incident costs, signifying the resilience and risk mitigation capabilities offered by blockchain. The paper argues for blockchain's potential to strengthen overall supply chain resilience, positioning it as a strategic tool for gaining a competitive advantage in the aviation sector.", "Published in": [{"name": "2024 IEEE 13th International Conference on Communication Systems and Network Technologies (CSNT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10545643/proceeding"}], "Authors": [{"name": "Chunpeng Zhang", "from": "China Aviation Supplies Co., Ltd., Beijing, China"}], "IEEE keywords": ["Procurement", "Training", "Costs", "Supply chains", "Blockchains", "Time factors", "Sustainable development"], "Author Keywords": ["Blockchain", "Aviation Material", "Supply Chain", "Transparency"]}