{"Title": "An Integrated Federated Machine Learning and Blockchain Framework with Optimal Miner Selection for Reliable DDOS Attack Detection", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ACCESS.2024.3413076", "Date of Publication": "12 June 2024", "abstract": "Blockchain networks serve as a transparent and secure ledger storage solution, yet they remain vulnerable to attacks. There must be some mechanism to protect the blockchain network from attacks. Among various attacks, the Distributed Denial of Service (DDoS) attack is considered severe, which is challenging to detect accurately and reliably. Machine learning techniques are used to detect the attack, which requires exploring all global attack data in a single system, which is difficult in practice. This article proposes a distributed machine learning mechanism called Federated Machine Learning for detecting the presence of DDoS attacks. But in federated machine learning the model itself can be poisoned by the malicious collaborating node which is another problem that this article solves by storing the model in blockchain and by introducing a new reputation-based miner selection procedure. The proposed framework integrates the federation of machine learning within the blockchain network framework for detecting DDoS attacks. Under the integrated framework, miners are used to train the blocks and they also participate in the machine learning training. A dynamic reputation-based miner selection mechanism that can balance exploration and exploitation is proposed for optimal miner selection, which can ensure the high accuracy of the machine learning model and improve the security of blockchain from attacks like DDoS attacks and 51% attacks. The proposed framework is tested with Random Forest, Multilayer Perceptron, and Logistic Regression machine learning algorithms. The proposed mechanism achieved maximum accuracy of 99.1% using random forest model which is superior to the existing mechanism of detection of DDoS attacks.", "Published in": [{"name": "IEEE Access", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6287639"}], "Authors": [{"name": "D. Saveetha", "from": "Department of Networking and Communications, SRM Institute of Science and Technology, Kattankulathur, Tamil Nadu, India"}, {"name": "G. Maragatham", "from": "Department of Computational Intelligence, SRM Institute of Science and Technology, Kattankulathur, Tamil Nadu, India"}, {"name": "Vijayakumar Ponnusamy", "from": "Department of Electronics and Communication Engineering, SRM Institute of Science and Technology, Kattankulathur, Tamil Nadu, India"}, {"name": "Nemanja Zdravković", "from": "Faculty of Information Technology, Metropolitan University, Serbia"}], "IEEE keywords": ["Blockchains", "Denial-of-service attack", "Machine learning", "Computer crime", "Training", "Federated learning", "Data models", "Random forests", "Accuracy", "Secure storage", "Reliability", "Multilayer perceptrons"], "Author Keywords": []}