{"Title": "Blockchain and Machine Learning for Predictive Policing and Crime Pattern Analysis", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/CSNT60213.2024.10546126", "Date of Publication": "06-07 April 2024", "abstract": "Crime pattern analysis and other forms of predictive policing are becoming indispensable tools for today's police forces. Hybrid Blockchain-Machine Learning Predictive Policing (HBL-PP) is a new method introduced by this study that aims to transform the sector by bringing together the best features of blockchain technology and machine learning algorithms. SecureCrimeChain guarantees the safe handling of crime-related data, while Convolutional Neural Networks (CNNs) and Recurrent Neural Networks (RNNs) are used for advanced crime pattern analysis in HBL-PP. When compared to conventional approaches, HBL-PP performs much better in experimental evaluations. SecureCrimeChain guarantees the best degree of accuracy, precision, recall, and F1 score, outperforming other techniques. DeepCrimeNet has comparable performance and comes in a close second. FairPredict Pro, although fairness-aware, maintains a balance between equity and prediction accuracy.", "Published in": [{"name": "2024 IEEE 13th International Conference on Communication Systems and Network Technologies (CSNT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10545643/proceeding"}], "Authors": [{"name": "Shashi Prakash Dwivedi", "from": "Lloyd Institute of Engineering & Technology, Greater Noida, Uttar Pradesh"}, {"name": "Modi Himabindu", "from": "Institute of Aeronautical Engineering, Dundigal, Hyderabad"}, {"name": "V Revathi", "from": "Department of Applied Sciences, New Horizon College of Engineering, Bangalore"}, {"name": "Manish Gupta", "from": "Lovely Professional University, Phagwara"}, {"name": "Neeraj Patel", "from": "Department of Computer Science & Engineering, IES Insititute of Technology and Management, IES University, Bhopal, M. P., India"}, {"name": "Muntather Almusawi", "from": "The Islamic university, Najaf, Iraq"}], "IEEE keywords": ["Recurrent neural networks", "Law enforcement", "Transforms", "Blockchains", "Planning", "Pattern analysis", "Protection"], "Author Keywords": ["Blockchain", "Convolutional Neural Networks", "Crime Pattern Analysis", "Data Security", "Privacy Preservation", "Recurrent Neural Networks", "Secure Evidence Management", "Spatiotemporal Patterns"]}