{"Title": "Decision Tree-Assisted Intelligent Framework for Food Quality Analysis", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/JIOT.2024.3413181", "Date of Publication": "12 June 2024", "abstract": "Internet of Things (IoT) technology has revolutionized the industrial sector. This research paper focuses on the development of Food Industry 4.0, which was made possible by advancements in Edge-cloud computing and IoT technologies. The study presents an IoT-based smart framework that uses the Bayesian Belief Network (BBN) on the Edge-Cloud platform to analyze data in the food industry. The acquired data is assessed to estimate the Probability of Food Quality (PFQ) and evaluate food outlets using the Food Quality Analysis Measure (FQAM). Additionally, a Bi-level decision-tree modeling is presented to assess food quality. Food-oriented data security is ensured using blockchain. The proposed model is tested on a complex dataset containing data about four restaurants with about 43,520 individual instances. Simulations show effective results of Temporal Delay (94.41s), Decision-making Efficacy (99.64%), Classification Efficiency (Precision (96.67%), Specificity (96.97%), and Sensitivity (97.55%)), Stability (74.25%), and Reliability (93.70%).", "Published in": [{"name": "IEEE Internet of Things Journal", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907"}], "Authors": [{"name": "Shtwai Alsubai", "from": "College of Computer Engineering and Sciences, Prince Sattam bin Abdulaziz University, Saudi Arabia"}, {"name": "Abdullah Alqahtani", "from": "College of Computer Engineering and Sciences, Prince Sattam bin Abdulaziz University, Saudi Arabia"}, {"name": "Abed Alanazi", "from": "Department of Computer Science, College of Computer Engineering and Sciences, Prince Sattam bin Abdulaziz University, Alkharj, Saudi Arabia"}, {"name": "Munish Bhatia", "from": "Department of Computer Applications, National Institute of Technology Kurukshetra, India"}], "IEEE keywords": ["Internet of Things", "Digital twins", "Wireless sensor networks", "Decision trees", "Wireless communication", "Temperature measurement", "Sensor phenomena and characterization"], "Author Keywords": []}