{"Title": "Research on the Construction of Digital Transformation Capability Maturity Index System for Logistics Enterprises", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICMSS61211.2024.00013", "Date of Publication": "12-14 January 2024", "abstract": "Currently, the rapid development of artificial intelligence, blockchain, cloud computing, big data and other “ABCD” technology has brought new momentum and new value to logistics enterprises. This paper aims to construct a digital transformation capability maturity index system for logistics enterprises, to indicate the direction of digital transformation for logistics enterprises and to promote their digital transformation process. First, the hierarchical structure of the indicator system is established: 48 indicators in total. Among them, there are 4 primary indicators, namely, digital strategic planning and organizational management capacity, infrastructure construction, business process and management digitization and digital performance, 12 secondary indicators and 32 tertiary indicators. Analytical Hierarchy Process (AHP) is applied to determine the weights of the indicators. Finally, through indicator weights analysis, relevant strategies for logistics enterprises to enhance digital transformation capability maturity are proposed, such as intelligent logistics planning algorithms should be used to improve the coordination of enterprise logistics planning, digital benefits-oriented implementation of digital transformation, top management should strongly support enterprise digital transformation, and digital security technology to strengthen the security and management and maintenance, and so on.", "Published in": [{"name": "2024 8th International Conference on Management Engineering, Software Engineering and Service Sciences (ICMSS)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550190/proceeding"}], "Authors": [{"name": "Fenfang Ye", "from": "School of management, Guangdong University of Science and Technology, Dongguan, China"}, {"name": "Jing Zhao", "from": "School of management, Guangdong University of Science and Technology, Dongguan, China"}, {"name": "Zhiqiao Zhang", "from": "School of management, Guangdong University of Science and Technology, Dongguan, China"}], "IEEE keywords": ["Cloud computing", "Digital transformation", "Analytic hierarchy process", "Strategic planning", "Maintenance", "Indexes", "Security"], "Author Keywords": ["digital transformation", "index system", "AHP"]}