{"Title": "File Sharing Based on Trust Networks and Public Key Certificates", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/Inforino60363.2024.10551947", "Date of Publication": "16-19 April 2024", "abstract": "The shortcomings of existing software tools for file sharing are noted. To eliminate the shortcomings, a project of a client-server application based on building a network of trust using public key certificates of its participants has been developed. The project uses symmetric and asymmetric cryptography algorithms, methods for building trust networks and using public key certificates to ensure the authenticity, confidentiality and integrity of data. The server part and the client mobile application have been implemented, allowing users to exchange files with each other within one specific file storage. When developing the application, technology was used to facilitate its portability to other operating platforms. The client application is built and tested on devices running the Android operating system. The developed application has the functionality necessary for file hosting and ensures the authenticity, integrity and confidentiality of the transferred files. This allows it to be used both by groups of private users and in corporate information systems. The results of the work can be used in conducting classes in the disciplines “Data Protection” and “Programming Technology”, as well as in the organization of the educational process.", "Published in": [{"name": "2024 7th International Conference on Information Technologies in Engineering Education (Inforino)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10551880/proceeding"}], "Authors": [{"name": "P. B. Khorev", "from": "Dept. of Applied Mathematics and Artificial Intelligence, National Research University “MPEI”, Moscow, Russia"}, {"name": "D. A. Losev", "from": "Dept. of Applied Mathematics and Artificial Intelligence, National Research University “MPEI”, Moscow, Russia"}], "IEEE keywords": ["Operating systems", "Standards organizations", "Public key", "Authentication", "Passwords", "Peer-to-peer computing", "Servers"], "Author Keywords": ["client-server application", "public key certificates", "network of trust", "secure files sharing"]}