{"Title": "Cryptoeconomic User Behavior in the Acute Stages of Geopolitical Conflict", "Pages": "1 - 14", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/TCSS.2024.3404590", "Date of Publication": "13 June 2024", "abstract": "Geopolitical conflicts significantly impact financial networks and systems, e.g., Russia and Ukraine. Cryptoeconomic blockchains such as Bitcoin and Ethereum were introduced as substitutes for traditional financial systems and might behave differently under significant stress. The Russia–Ukraine conflict allowed us to analyze the impact of such complex geopolitical conflicts on the user behaviors of cryptoeconomic blockchains. This article investigates the early stage of such geopolitical conflict using time-varying graphs. We collected and analyzed all the transactions for Bitcoin and Ethereum that took place 2 weeks before and after the conflict started, i.e., we focused on what can be defined as the acute impact of such an event. Our results suggest that the early stage of such geopolitical conflicts may significantly affect cryptoeconomic blockchains’ user behaviors. For instance, we detected that some users behaved more cautiously during the preconflict phase and resumed normalcy during the postconflict phase but exhibited a shift in their behavior. This article analyzes the relationship between the early stages of geopolitical conflicts and cryptoeconomic systems.", "Published in": [{"name": "IEEE Transactions on Computational Social Systems", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6570650"}], "Authors": [{"name": "Jorão Gomes", "from": "Institute for Digital Ecosystems, Department of Information Systems and Operations Management, Vienna University of Economics and Business, Vienna, Austria"}, {"name": "Heder Bernardino", "from": "Department of Computer Science, Federal University of Juiz de Fora (UFJF), Juiz de Fora, Brazil"}, {"name": "Alex Borges Vieira", "from": "Department of Computer Science, Federal University of Juiz de Fora (UFJF), Juiz de Fora, Brazil"}, {"name": "Verena Dorner", "from": "Institute for Digital Ecosystems, Department of Information Systems and Operations Management, Vienna University of Economics and Business, Vienna, Austria"}, {"name": "Davor Svetinovic", "from": "Center for Secure Cyber-Physical Systems, Department of Computer Science, Khalifa University, Abu Dhabi, UAE"}], "IEEE keywords": ["Blockchains", "Bitcoin", "Complex networks", "Diseases", "Analytical models", "Computer science", "Computational modeling"], "Author Keywords": []}