{"Title": "Artificial Intelligence–Blockchain‐Enabled–Internet of Things‐Based Cloud Applications for Next‐Generation Society", "Pages": "65 - 82", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "Wiley Data and Cybersecurity", "DOI": "10.1002/9781394213948.ch4", "Date of Publication": null, "abstract": "Summary\nArtificial intelligence (AI), blockchain technology, and Internet of Things (IoT) are three of the most rapidly evolving technologies in the current era. The integration of these technologies can provide significant benefits to cloud‐based environments by enhancing security, privacy, and data management. This paper proposes an architecture that combines AI, blockchain, and IoT in a cloud‐based environment. The proposed architecture provides a secure and reliable platform for data exchange and analysis, enabling the development of smart applications that can improve the efficiency, productivity, and quality of life. The architecture's core components are the IoT sensors, AI algorithms, and blockchain technology, which ensure data security and privacy, immutability, and transparency. The proposed architecture can be used in various applications, such as healthcare, logistics, and smart cities. In summary, this chapter provides an overview of the benefits and challenges associated with the integration of AI, blockchain, and IoT and proposes a novel architecture that can leverage these technologies to improve cloud‐based environments’ efficiency and security. This research work will discuss about futuristic technology and their role in respective fields in detail.", "Published in": [], "Authors": [{"name": "V. Hemamalini", "from": "Department of Networking and Communications, School of Computing, SRM Institute of Science and Technology, Chennai, India"}, {"name": "Anand Kumar Mishra", "from": "Computer Science and Engineering, NIIT University, Neemrana, Rajasthan, India"}, {"name": "Amit Kumar Tyagi", "from": "Department of Fashion Technology, National Institute of Fashion Technology, New Delhi, Delhi, India"}, {"name": "Vijayalakshmi Kakulapati", "from": "Sreenidhi Institute of Science and Technology, Hyderabad, Telangana, India"}], "IEEE keywords": ["Internet of Things", "Artificial intelligence", "Blockchains", "Cloud computing", "Next generation networking", "Medical services", "Computer architecture"], "Author Keywords": []}