{"Title": "Blockchain-based Group Key Management Scheme for IoT with Anonymity of Group Members", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/TIFS.2024.3414663", "Date of Publication": "14 June 2024", "abstract": "Group communications play a crucial role in enhancing the quality of service (QoS) of Internet of Things (IoT) networks, enabling efficient information dissemination while minimizing resource utilization. However, ensuring information security and privacy in IoT group communications necessitates the implementation of an efficient and lightweight key management scheme due to the limited capabilities of most IoT devices. This paper presents a novel key management protocol for group communications that employs distributed Blockchain technology in IoT networks. The proposed scheme considers nodes belonging to multiple groups. By utilizing an asymmetric key shared among group members, secure communication is established between outsiders and group members while preserving anonymity inside the group. A distinguishing feature of the protocol is its combination of group member anonymity and automatic key revocation facilitated by a Smart Contract. Furthermore, simulation results demonstrate the efficiency of the proposed scheme, consuming less than 300 mJ of energy and taking less than 7 seconds to establish a group key among 1000 nodes, outperforming several existing approaches in the literature in terms of computation and communication costs.", "Published in": [{"name": "IEEE Transactions on Information Forensics and Security", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=10206"}], "Authors": [{"name": "Julio C. Pérez-García", "from": "Laboratoire Informatique d’Avignon (LIA), Avignon University, Avignon, France"}, {"name": "An Braeken", "from": "Department of Engineering Technology (INDI), Vrije Universiteit Brussel, Brussels, Belgium"}, {"name": "Abderrahim Benslimane", "from": "Laboratoire Informatique d’Avignon (LIA), Avignon University, Avignon, France"}], "IEEE keywords": ["Blockchains", "Security", "Internet of Things", "Privacy", "Smart contracts", "Elliptic curve cryptography", "Authentication"], "Author Keywords": []}