{"Title": "Protecting Patient Privacy and Data Integrity With DAG Technology for IoMT and EHR: A Systematic Review", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IRASET60544.2024.10549660", "Date of Publication": "16-17 May 2024", "abstract": "This paper presents a systematic study of Distributed Acyclic Graph (DAG) and Blockchain technologies, which are two growing technologies that can be implemented with IoMT (Internet of Medical Things) and EHRs (Electronic Health Records) to ensure security, privacy, scalability, and data availability of patient's data related to their treatment process and diagnoses. This goal is achieved by using, the PRISMA (Preferred Reporting Items for Systematic Reviews and MetaAnalyses) model and papers published in journals indexed in scientific databases, namely Scopus and Web of Science. The results of analyze and discussion are presented and a novel architecture based on IoMT-EHR and DAG technologies (Tangle) is proposed. This last one is designed to significantly accelerate operations, ensure robust security and enhance scalability for its users.", "Published in": [{"name": "2024 4th International Conference on Innovative Research in Applied Science, Engineering and Technology (IRASET)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548014/proceeding"}], "Authors": [{"name": "Dior Masrane Reoukadji", "from": "Advanced Systems Engineering Laboratory, National School Of Applied Sciences, Ibn Tofail University, Kenitra, Morocco"}, {"name": "Patrick Loola Bokonda", "from": "LISTD Laboratory, SSDT Team, Ecole Nationale Superieure des Mines, Rabat, Morocco"}, {"name": "Abdessalam Ait Madi", "from": "Advanced Systems Engineering Laboratory, National School Of Applied Sciences, Ibn Tofail University, Kenitra, Morocco"}, {"name": "Imam Alihamidi", "from": "Advanced Systems Engineering Laboratory, National School Of Applied Sciences, Ibn Tofail University, Kenitra, Morocco"}], "IEEE keywords": ["Surveys", "Data privacy", "Systematics", "Reviews", "Scalability", "Data security", "Internet of Medical Things"], "Author Keywords": ["IoMT", "EHR", "Cybersecurity", "Cyberattack", "Distributed Ledger Technology (DLT)", "Distributed Acyclic Graph (DAG)", "Blockchain", "Internet of Things Application (IOTA)", "NonFungible Token"]}