{"Title": "A Blockchain-Reinforced Federated Intrusion Detection Architecture for IIoT", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/JIOT.2024.3406602", "Date of Publication": "12 June 2024", "abstract": "Federated Learning (FL) in Industrial IoT (IIoT) facilitates collaborative model training across distributed edge devices, ensuring data privacy and localized insights without centralized data aggregation. However, the networked parameter sharing mechanism in FL renders it vulnerable to exploitation by Man-in-the-Middle (MITM) attackers, potentially disrupting the model training process. To mitigate this threat, this paper presents a novel blockchain-reinforced federated learning architecture aimed at enabling cooperative intrusion detection. Initially, federated learning is leveraged to aggregate all learned information from edge servers, thereby disseminating extracted attack characteristics to all participants through gradient sharing. Subsequently, a blockchain-based parameter verification scheme is introduced to safeguard against tampered local parameters affecting the global model. Clients record model parameters in smart contracts deployed on a private chain, and parameter servers verify parameter confidentiality before aggregation, ensuring only valid parameters are considered. Finally, extensive experiments are conducted using an edge IIoT cybersecurity dataset comprising 61 features spanning 10 protocol layers and five attacks targeting IIoT connectivity protocols. Simulation results demonstrate that the proposed scheme significantly enhances intrusion detection accuracy, achieving a threefold improvement when two-thirds of federated nodes are subjected to MITM attacks.", "Published in": [{"name": "IEEE Internet of Things Journal", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907"}], "Authors": [{"name": "Dingde Jiang", "from": "University of Electronic Science and Technology of China, Chengdu, China"}, {"name": "Zhihao Wang", "from": "University of Electronic Science and Technology of China, Chengdu, China"}, {"name": "Ye Wang", "from": "School of Computer and Artificial Intelligence, Zhengzhou University, Zhengzhou, China"}, {"name": "Lizhuang Tan", "from": "Ministry of Education, Shandong Computer Science Center (National Supercomputer Center in Jinan), Key Laboratory of Computing Power Network and Information Security, Qilu University of Technology (Shandong Academy of Sciences), Jinan, China"}, {"name": "Jian Wang", "from": "College of Science, China University of Petroleum (East China), Qingdao, China"}, {"name": "Peiying Zhang", "from": "College of Computer Science and Technology, Qingdao Institute of Software, China University of Petroleum (East China), Qingdao, China"}], "IEEE keywords": ["Industrial Internet of Things", "Federated learning", "Blockchains", "Training", "Servers", "Security", "Data privacy"], "Author Keywords": []}