{"Title": "Reputation-Based Stable Blockchain Sharding Scheme for Smart Cities With IoT Consumer Electronics: A Deep Reinforcement Learning Approach", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/TCE.2024.3412957", "Date of Publication": "11 June 2024", "abstract": "Recently, the concept of smart cities has provided new insights for efficient utilization of urban resources, while posing significant security challenges in the Internet of Things (IoT) consumer electronics. Sharding technology is a representative approach to solving the scalability problems of blockchain systems used in security-enabled smart cities. However, considering high scalability requirements from the IoT consumer electronics, this strategy may lead to higher security risks for a single shard, and the worst-performing shard will become the performance bottleneck with the increase of the number of shards. To address it, we propose a reputation-based stable blockchain sharding scheme. After analyzing the faulty nodes and malicious behaviors in blockchain system, the reputation-based stability evaluation criteria is accordingly established. Then, a stable sharding strategy that can be dynamically adjusted according to the current state of blockchain system, is realized to replace the original random sharding strategy. Specifically, to handle the dynamic and large-scale characteristics of IoT consumer electronics in smart cities, the deep reinforcement learning (DRL) method is incorporated into training the sharding strategy and optimizing the system performance. The simulation results show that our scheme can effectively improve antirisk capability of the sharded blockchain system, achieving a high transaction throughput performance.", "Published in": [{"name": "IEEE Transactions on Consumer Electronics", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=30"}], "Authors": [{"name": "Yaozong Li", "from": "School of Computer and Communication Engineering, University of Science and Technology Beijing, Beijing, China"}, {"name": "Xiong Luo", "from": "School of Computer and Communication Engineering, University of Science and Technology Beijing, Beijing, China"}, {"name": "Wenbing Zhao", "from": "Department of Electrical Engineering and Computer Science, Cleveland State University, Cleveland, OH, USA"}, {"name": "Honghao Gao", "from": "School of Computer Engineering and Science, Shanghai University, Shanghai, China"}], "IEEE keywords": ["Blockchains", "Sharding", "Smart cities", "Security", "Consumer electronics", "Peer-to-peer computing", "Throughput"], "Author Keywords": []}