{"Title": "Ethnos: An Ethereum-based Online Social Networking System with Two-Factor Authentication and Trust Score", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/InCACCT61598.2024.10551197", "Date of Publication": "02-03 May 2024", "abstract": "As social media grows to entangle and remould the lives of people, so grows the concern over data privacy, censorship, server outages, and control over personal information by proprietary bodies due to their centralized design. The rise of blockchain has encouraged researchers to consider the decentralization framework for developing online social networks to resolve the challenges mentioned above. In a decentralized ecosystem, no one entity has absolute access to data and the power to enforce arbitrary decisions. The benefits of this include ownership over personal data, censorship resistance, data security, and improved control over user-generated content. In this paper, we propose the design of Ethnos, a social networking application built to harness the powers of blockchain and distributed storage technology to heighten the security and reliability of users as well as their data. In that context, suitable smart contracts have been fabricated. This paper also prospects integration of two-factor user authentication and trust score checks with Ethnos to corroborate the trustworthiness of both user and data. In addition, Ethnos incorporates a remuneration system to compensate users for their contribution to and engagement with the platform.", "Published in": [{"name": "2024 2nd International Conference on Advancement in Computation & Computer Technologies (InCACCT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550186/proceeding"}], "Authors": [{"name": "Suranjan Saha", "from": "Computer Science and Engineering, Techno International New Town, Kolkata, India"}, {"name": "Sayak Karar", "from": "Computer Science and Engineering, Techno International New Town, Kolkata, India"}, {"name": "Raja Karmakar", "from": "Computer Science and Engineering (IoT & CS), Heritage Institute of Technology, Kolkata, India"}], "IEEE keywords": ["Resistance", "Social networking (online)", "User-generated content", "Smart contracts", "Authentication", "Reliability engineering", "Censorship"], "Author Keywords": ["Blockchain", "Ethereum", "social networking", "two-factor authentication", "trust score"]}