{"Title": "PrettySmart: Detecting Permission Re-Delegation Vulnerability for Token Behaviors in Smart Contracts", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1145/3597503.3639140", "Date of Publication": "14-20 April 2024", "abstract": "As an essential component in Ethereum and other blockchains, token assets have been interacted with by diverse smart contracts. Effective permission policies of smart contracts must prevent token assets from being manipulated by unauthorized adversaries. Recent efforts have studied the accessibility of privileged functions or state variables to unauthorized users. However, little attention is paid to how publicly accessible functions of smart contracts can be manipulated by adversaries to steal users' digital assets. This attack is mainly caused by the permission re-delegation (PRD) vulnerability. In this work, we propose PRETTYSMART, a bytecode-level Permission re-delegation vulnerability detector for Smart contracts. Our study begins with an empirical study on 0.43 million open- source smart contracts, revealing that five types of widely-used permission constraints dominate 98% of the studied contracts. Accordingly, we propose a mechanism to infer these permission constraints, as well as an algorithm to identify constraints that can be bypassed by unauthorized adversaries. Based on the identification of permission constraints, we propose to detect whether adversaries could manipulate the privileged token management functionalities of smart contracts. The experimental results on real-world datasets demonstrate the effectiveness of the proposed Prettysmart, which achieves the highest precision score and detects 118 new PRD vulnerabilities.", "Published in": [{"name": "2024 IEEE/ACM 46th International Conference on Software Engineering (ICSE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548016/proceeding"}], "Authors": [{"name": "Zhijie Zhong", "from": "Sun Yat-sen University, Zhuhai, China"}, {"name": "Zibin Zheng", "from": "Sun Yat-sen University, Zhuhai, China"}, {"name": "Hong-Ning Dai", "from": "Hong Kong Baptist University, Hong Kong, China"}, {"name": "Qing Xue", "from": "Sun Yat-sen University, Guangzhou, China"}, {"name": "Junjia Chen", "from": "Sun Yat-sen University, Guangzhou, China"}, {"name": "Yuhong Nan", "from": "Sun Yat-sen University, Zhuhai, China"}], "IEEE keywords": ["Smart contracts", "Detectors", "Blockchains", "Software engineering"], "Author Keywords": ["Smart Contract", "Permission Control", "Vulnerability Detection"]}