{"Title": "Blockchain Based Three Tier Architecture for Land Registration System", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/InCACCT61598.2024.10551079", "Date of Publication": "02-03 May 2024", "abstract": "Land registration is one of the most complex processes in India, which includes a lot of bureaucratic steps and consumes a good chunk of resources, both financial and time. Due to this complex process and waiting time, the public tends to go through middlemen and third-party agents, which sometimes leads to fraud. This paper provides a detailed review and limitations of the current land registry system, both paper-oriented and centralized online system, as well as a review of current research on blockchain-based land registry processes. To make the land registry system more secure and faster than the available solutions, this proposes a modified solution that will mitigate the limitations of the related work by using a three-tier structure, including a government body responsible for taking permission and overlooking the entire transaction, a buyer or seller, and further banks responsible for overlooking payment transactions. The three parties approve the transaction, and then the transaction details are added to the Ethereum blockchain network. The solution also solves the transaction size issue by storing the meta data on the main chain and non-transactional data on the IPFS network, which will significantly reduce the load on the network.", "Published in": [{"name": "2024 2nd International Conference on Advancement in Computation & Computer Technologies (InCACCT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550186/proceeding"}], "Authors": [{"name": "Angad Singh", "from": "Computer Science and Engineering, Sharda University, Noida, India"}, {"name": "Swayam Govil", "from": "Computer Science and Engineering, Sharda University, Noida, India"}, {"name": "Sonali Kumari Singh", "from": "Computer Science and Engineering, Sharda University, Noida, India"}, {"name": "Murari Kumar Singh", "from": "Computer Science and Engineering, Sharda University, Noida, India"}], "IEEE keywords": ["Reviews", "Government", "Computer architecture", "Metadata", "Blockchains", "Fraud", "Delays"], "Author Keywords": ["Blockchain", "Decentralized", "IPFS", "Land Registry", "Transaction", "Consensus"]}