{"Title": "cryptoRAN: A Review on Cryptojacking and Ransomware Attacks W.R.T. Banking Industry - Threats, Challenges, & Problems", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/InCACCT61598.2024.10550970", "Date of Publication": "02-03 May 2024", "abstract": "In the banking industry, ransomware is a wellknown threat, but since the beginning of 2022, cryptojacking, an emerging threat is posing a considerable challenge to the banking industry. Ransomware has variants, and the attackers keep changing the nature of these variants. This review paper studies the complex background of these two threats and scrutinizes the actual challenges, and problems that the banking industry and financial institutions face. These threats, though distinct in nature, share commonalities, such as financial motivations and sophisticated techniques. We focus on examining the newly emerged variants of ransomware while we provide a comprehensive idea of cryptojacking and its nature. This paper involves a detailed breakdown of the specific threats posed by cryptojacking and ransomware. It explores the techniques cybercriminals use, the variabilities they look for, and the potential consequences for financial institutions and their customers. This paper also finds out how cybercriminals change their techniques following the security upgrades, and why financial firms including banks need to be proactive about cyber threats. Additionally, this paper reviews the background study of some existing papers, finds the research gaps that need to be addressed, and provides suggestions including a conclusion and future scope on those disputes. Lastly, we introduce a Digital Forensics and Incident Response (DFIR) approach for up-to-date cyber threat hunting processes for minimizing both cryptojacking and ransomware attacks in the banking industry.", "Published in": [{"name": "2024 2nd International Conference on Advancement in Computation & Computer Technologies (InCACCT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550186/proceeding"}], "Authors": [{"name": "Naresh Kshetri", "from": "CyROC, School of Business & Technology, Emporia State University, Emporia, Kansas, USA"}, {"name": "Mir Mehedi Rahman", "from": "CyROC, School of Business & Technology, Emporia State University, Emporia, Kansas, USA"}, {"name": "Sayed Abu Sayeed", "from": "CyROC, School of Business & Technology, Emporia State University, Emporia, Kansas, USA"}, {"name": "Irin Sultana", "from": "CyROC, School of Business & Technology, Emporia State University, Emporia, Kansas, USA"}], "IEEE keywords": ["Industries", "Reviews", "Electric breakdown", "Digital forensics", "Banking", "Ransomware", "Security"], "Author Keywords": ["Banking industry", "cryptojacking", "crypto mining", "cyber threat hunting", "digital forensics and incident response approach", "ransomware"]}