{"Title": "Securing IoT Data: FDUP-RDIC -A Fully Decentralized Approach for Privacy-Preserving and Efficient Data Integrity", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/JIOT.2024.3412224", "Date of Publication": "11 June 2024", "abstract": "By the limitations of storage capacity and computing power, IoT devices may prefer to outsource their valuable and sensitive data to cloud storage providers (CSPs) for further analysis, so it is critical to design protocols that can verify the integrity of these data remotely, while preserving the privacy of their owners. This paper proposes a novel remote data integrity checking method for IoT, namely FDUP-RDIC, which achieves fully decentralized, efficient, and unconditionally privacy-preserving checking simultaneously, that is, the proof-checking is performed efficiently on the blockchain by the smart contracts integrated with native C/C++ codes, while the blockchain or any other entity cannot learn any information about the data content, even they have unbounded computing power. Furthermore, it is optimized for low-power IoT devices by greatly reducing the exponentiations of generating homomorphic verifiable tags to be nearly independent of the block size of the outsourced data. To defend against untrusted IoT and CSP, we present strict proofs and analyses in the aspect of correctness, soundness, and unconditionally privacy-preserving. The evaluation of theoretical performance and the prototype system deployed on a blockchain platform indicate that FDUP-RDIC is suitable for real-world IoT applications.", "Published in": [{"name": "IEEE Internet of Things Journal", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907"}], "Authors": [{"name": "Su Peng", "from": "School of Cyberspace Security (School of Cryptology), Hainan University, Haikou, China"}, {"name": "Neeraj Kumar", "from": "Department of Computer Science and Engineering, Thapar Institute of Engineering and Technology, Patiala, India"}, {"name": "Saeed Hamood Alsamhi", "from": "Insight Centre for Data Analytics, University of Galway, Galway, Ireland"}, {"name": "Qiang He", "from": "School of Medicine and Biological Information Engineering, Northeastern University, Shenyang, China"}, {"name": "Liang Zhao", "from": "School of Computer Science, Shenyang Aerospace University, Shenyang, China"}], "IEEE keywords": ["Internet of Things", "Blockchains", "Cloud computing", "Performance evaluation", "Security", "Data integrity", "Computer architecture"], "Author Keywords": []}