{"Title": "Deep Learning Based QoE-Driven Packet Scheduling and Multipath Routing Using Fractional Coati Optimization", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICDCECE60827.2024.10548281", "Date of Publication": "26-27 April 2024", "abstract": "Nowadays, multipath routing is performed in the Internet of Things (IoT) to provide reliable data transmission under different traffic conditions. In this research, multipath routing in IoT is performed by Fractional Coati Optimization Algorithm (FCOA). Here, the Quality of Experience (QoE)-driven data delivery is performed by considering IoT users and applications initially. The Transmission Control Protocol/Internet Protocol (TCP/IP) networks are considered to promote the QoE of IoT users and for prioritizing applications. The data from various IoT applications is transmitted in the form of packets and Deep Long Short-Term Memory (DLSTM) is used to perform QoE-driven packet scheduling from the packets. The multipath routing is effectuated by the FCOA by considering fitness parameters, namely energy and delay. Furthermore, the multipath routing performance of FCOA is validated by comparing the performance with existing methods. Here, the FCOA attained superior performance with residual energy and delay of 0.433J, and 0.744mS.", "Published in": [{"name": "2024 Third International Conference on Distributed Computing and Electrical Circuits and Electronics (ICDCECE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548017/proceeding"}], "Authors": [{"name": "Priya Kumari", "from": "Department of Electronics and Communication, Babu Banarasi Das University, Lucknow, Uttar Pradesh"}, {"name": "Nitin Jain", "from": "Department of Electronics and Communication, Babu Banarasi Das University, Lucknow, Uttar Pradesh"}], "IEEE keywords": ["Scheduling algorithms", "Scalability", "Heuristic algorithms", "TCPIP", "Routing", "Routing protocols", "Delays"], "Author Keywords": ["fractional coati optimization algorithm", "deep long short-term memory", "fractional calculus", "coati optimization algorithm", "quality of experience"]}