{"Title": "DeMedia: Decentralization of Social Media", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/CSNT60213.2024.10545716", "Date of Publication": "06-07 April 2024", "abstract": "Social media networks have become an essential part of the modern world, with billions of people using them as an integral part of their daily lives. Despite their popularity, these networks are centralized, allowing the companies that own them to monitor and track their users' activities. This has given rise to serious concerns regarding the privacy and security of user data, which are often sold to third parties for profit. Given the massive value of user data in today's and tomorrow's world, many people are concerned about this issue. While decentralized, community-driven applications have emerged as a potential solution to this problem, none have yet been able to compete with centralized social network platforms. Due to those facts, this research aimed to propose a decentralized social network architecture that would incorporate the basic functionalities of a social media platform while ensuring the privacy and security of users' data, which would be stored locally on their devices. A thorough study of the existing centralized and decentralized social media platforms was conducted to identify the path for this research. The proposed protocol offers a decentralized and secure social media platform architecture that provides true ownership of user data along with decentralized data integrity and caching.", "Published in": [{"name": "2024 IEEE 13th International Conference on Communication Systems and Network Technologies (CSNT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10545643/proceeding"}], "Authors": [{"name": "B.S.S. Perera", "from": "Department of Information Technology, Sri Lanka Institute of Information Technology, Malabe, Sri Lanka"}, {"name": "G.G.S. Dhananjani", "from": "Department of Information Technology, Sri Lanka Institute of Information Technology, Malabe, Sri Lanka"}, {"name": "A.M.C.A. Bandara", "from": "Department of Information Technology, Sri Lanka Institute of Information Technology, Malabe, Sri Lanka"}, {"name": "A.W.Y.I.K. Abeykoon", "from": "Department of Information Technology, Sri Lanka Institute of Information Technology, Malabe, Sri Lanka"}, {"name": "Kavinga Yapa Abeywardena", "from": "Department of Computer Systems Engineering, Sri Lanka Institute of Information Technology, Malabe, Sri Lanka"}], "IEEE keywords": ["Data privacy", "Privacy", "Protocols", "Social networking (online)", "Data integrity", "Memory", "Companies"], "Author Keywords": ["Social media", "Peer-to-peer networking", "Data integrity", "Data caching", "Decentralization", "Privacy", "Security", "Data ownership", "Distributed networks"]}