{"Title": "Enhancing Robotic Automation In Industries Using Industrial Informatics", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/CSNT60213.2024.10546155", "Date of Publication": "06-07 April 2024", "abstract": "This research investigates the field of industrial informatics to suggest a novel method, EnhancedRoboAI, with the potential to radically alter the way robotic automation is used in manufacturing. Insights into the expanding need for improved automation capabilities in today's industrial environment are provided in the introduction, with the limits of traditional approaches and the promise of industrial informatics for resolving these issues being highlighted. EnhancedRoboAI is compared to six well-established conventional approaches (AutoIndustro, IndustriaNet, AutomateWorks, RoboTechPro, IndustriAutoPro, and AutoSolutionsInc.) in this study. Factors such as precision, velocity, the capacity to deal with complicated data, flexibility, learning speed, and resource use are used to assess performance. EnhancedRoboAI demonstrated higher performance across all parameters in the exhaustive assessment process, yielding convincing findings. For instance, EnhancedRoboAI improved accuracy by 13%, speed by 16%, and resource use by 7% when compared to AutoIndustro. By outperforming IndustriaNet by 15%, EnhancedRoboAI demonstrates its flexibility as a solution for the dynamic demands of today's manufacturing environments. Based on the findings of this research, a new age of industrial automation has begun, with the implementation of EnhancedRoboAI promising to take efficiency, responsiveness, and productivity to new heights.", "Published in": [{"name": "2024 IEEE 13th International Conference on Communication Systems and Network Technologies (CSNT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10545643/proceeding"}], "Authors": [{"name": "Sudhanshu Pathak", "from": "Department of Mechanical Engineering, IES Insititute of Technology and Management, IES University, Bhopal, M.P., India"}, {"name": "N M Deepika", "from": "Institute of Aeronautical Engineering, Dundigal, Hyderabad"}, {"name": "B Rajalakshmi", "from": "Department of Computer Science, New Horizon College of Engineering, Bangalore"}, {"name": "Ginni Nijhawan", "from": "Lovely Professional University, Phagwara"}, {"name": "Muntather Almusawi", "from": "The Islamic university, Najaf, Iraq"}, {"name": "Dinesh Kumar Yadav", "from": "Lloyd Institute of Engineering & Technology, Greater Noida, Uttar Pradesh"}], "IEEE keywords": ["Industries", "Productivity", "Technological innovation", "Automation", "Service robots", "Scalability", "Propulsion"], "Author Keywords": ["Automation", "Blockchain", "Computational", "Data Privacy", "EnhancedRoboAI", "Industrial Informatics", "Innovation", "Robotics", "Scalability", "Technology"]}