{"Title": "PS3: Precise Patch Presence Test Based on Semantic Symbolic Signature", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1145/3597503.3639134", "Date of Publication": "14-20 April 2024", "abstract": "During software development, vulnerabilities have posed a significant threat to users. Patches are the most effective way to combat vulnerabilities. In a large-scale software system, testing the presence of a security patch in every affected binary is crucial to ensure system security. Identifying whether a binary has been patched for a known vulnerability is challenging, as there may only be small differences between patched and vulnerable versions. Existing approaches mainly focus on detecting patches that are compiled in the same compiler options. However, it is common for developers to compile programs with very different compiler options in different situations, which causes inaccuracy for existing methods. In this paper, we propose a new approach named\nP\nS\n3\n, referring to precise patch presence test based on semantic-level symbolic signature.\nP\nS\n3\nexploits symbolic emulation to extract signatures that are stable under different compiler options. Then\nP\nS\n3\ncan precisely test the presence of the patch by comparing the signatures between the reference and the target at semantic level. To evaluate the effectiveness of our approach, we constructed a dataset consisting of 3,631 (CVE, binary) pairs of 62 recent CVEs in four C/C++ projects. The experimental results show that\nP\nS\n3\nachieves scores of 0.82, 0.97, and 0.89 in terms of precision, recall, and F1 score, respectively.\nP\nS\n3\noutperforms the state-of-the-art baselines by improving 33% in terms of F1 score and remains stable in different compiler options.", "Published in": [{"name": "2024 IEEE/ACM 46th International Conference on Software Engineering (ICSE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548016/proceeding"}], "Authors": [{"name": "Qi Zhan", "from": "The State Key Laboratory of Blockchain and Data Security, Zhejiang University, Hangzhou, China"}, {"name": "Xing Hu", "from": "The State Key Laboratory of Blockchain and Data Security, Zhejiang University, Hangzhou, China"}, {"name": "Zhiyang Li", "from": "Zhejiang University, Hangzhou, China"}, {"name": "Xin Xia", "from": "Software Engineering Application Technology Lab, Huawei, China"}, {"name": "David Lo", "from": "Singapore Management University, Singapore"}, {"name": "Shanping Li", "from": "The State Key Laboratory of Blockchain and Data Security, Zhejiang University, Hangzhou, China"}], "IEEE keywords": ["Program processors", "Semantics", "Emulation", "Software systems", "Security", "Testing", "Software engineering"], "Author Keywords": ["Patch presence test", "Binary analysis", "Software security"]}