{"Title": "When Contracts Meets Crypto: Exploring Developers' Struggles with Ethereum Cryptographic APIs", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1145/3597503.3639131", "Date of Publication": "14-20 April 2024", "abstract": "To empower smart contracts with the promising capabilities of cryptography, Ethereum officially introduced a set of cryptographic APIs that facilitate basic cryptographic operations within smart contracts, such as elliptic curve operations. However, since developers are not necessarily cryptography experts, requiring them to directly interact with these basic APIs has caused real-world security issues and potential usability challenges. To guide future research and solutions to these challenges, we conduct the first empirical study on Ethereum cryptographic practices. Through the analysis of 91,484,856 Ethereum transactions, 500 crypto-related contracts, and 483 StackExchange posts, we provide the first in-depth look at cryptographic tasks developers need to accomplish and identify five categories of obstacles they encounter. Furthermore, we conduct an online survey with 78 smart contract practitioners to explore their perspectives on these obstacles and elicit the underlying reasons. We find that more than half of practitioners face more challenges in cryptographic tasks compared to general business logic in smart contracts. Their feedback highlights the gap between low-level cryptographic APIs and high-level tasks they need to accomplish, emphasizing the need for improved cryptographic APIs, task-based templates, and effective assistance tools. Based on these findings, we provide practical implications for further improvements and outline future research directions.", "Published in": [{"name": "2024 IEEE/ACM 46th International Conference on Software Engineering (ICSE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548016/proceeding"}], "Authors": [{"name": "Jiashuo Zhang", "from": "School of Computer Science, Peking University, Beijing, China"}, {"name": "Jiachi Chen", "from": "Sun Yat-sen University, Zhuhai, China"}, {"name": "Zhiyuan Wan", "from": "Zhejiang University, Hangzhou, China"}, {"name": "Ting Chen", "from": "University of Electronic Science and Technology of China, Chengdu, China"}, {"name": "Jianbo Gao", "from": "School of Computer Science, Peking University, Beijing, China"}, {"name": "Zhong Chen", "from": "School of Computer Science, Peking University, Beijing, China"}], "IEEE keywords": ["Surveys", "Elliptic curves", "Smart contracts", "Cryptography", "Logic", "Task analysis", "Usability"], "Author Keywords": ["Ethereum", "Smart Contracts", "Empirical Study", "Cryptography", "API Usability"]}