{"Title": "Healthcare Supply Chain Security with ZeroKnowledge Proof Authentication in Blockchain for Personalized Healthcare Monitoring", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICDCECE60827.2024.10549637", "Date of Publication": "26-27 April 2024", "abstract": "The current healthcare ecosystem often faces challenges such as data breaches, unauthorized access, data silos, and difficulties in tracking and verifying medical device supply chains. These issues pose a threat to patient confidentiality, trust in healthcare data, and the efficiency of healthcare operations. To address these challenges, a proposed model introduces a unique approach to bolstering the security and efficiency of Internet of Things (IoT) devices in healthcare through the use of advanced cryptographic techniques. Specifically, the model utilizes a heavy computation algorithm known as Elliptic Curve Cryptography (ECC) for packet verification in IoT devices. In addition to ECC, the model incorporates Zero Knowledge Proof (ZKP) for verification, providing a lighter alternative to ECC. ZKP works by signing the input messages and subsequently verifying the data, offering a robust security measure. The implementation strategy involves simulating IoT sensors, each equipped with ECC and Zero Knowledge proof capabilities for enhanced security.", "Published in": [{"name": "2024 Third International Conference on Distributed Computing and Electrical Circuits and Electronics (ICDCECE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548017/proceeding"}], "Authors": [{"name": "Yuva Krishna Aluri", "from": "Computer Science and Engineering, PVP Siddhartha Institute of Technology, Vijayawada, India"}, {"name": "Sravani Katlagunta", "from": "Computer Science and Engineering, PVP Siddhartha Institute of Technology, Vijayawada, India"}, {"name": "Thanusri Musunuru", "from": "Computer Science and Engineering, PVP Siddhartha Institute of Technology, Vijayawada, India"}, {"name": "Anusha Mylarapu", "from": "Computer Science and Engineering, PVP Siddhartha Institute of Technology, Vijayawada, India"}, {"name": "Kiran Venkat Satya Sai Raj Kuruba", "from": "Computer Science and Engineering, PVP Siddhartha Institute of Technology, Vijayawada, India"}, {"name": "Esther Jyothi V", "from": "Computer Science and Engineering, PVP Siddhartha Institute of Technology, Vijayawada, India"}], "IEEE keywords": ["Technological innovation", "Computational modeling", "Scalability", "Supply chains", "Smart contracts", "Medical services", "Elliptic curve cryptography"], "Author Keywords": ["Blockchain", "Internet of Things", "Zero Knowledge Proof", "Elliptic Curve Cryptography", "Smart Contract"]}