{"Title": "Unified Feature Engineering for Detection of Malicious Entities in Blockchain Networks", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/TIFS.2024.3412421", "Date of Publication": "11 June 2024", "abstract": "Blockchain technology has been integrated into a wide range of applications in various sectors, such as finance, supply chain, health, and governance. However, the participation of a few actors with malicious intentions challenges law enforcement authorities, regulators and other users. These challenges revolve around dealing with an array of illegal activities such as asset trades in dark markets, receiving payments for cyber-attacks, and facilitating money laundering. Developing an efficient mechanism to identify malicious actors in blockchain networks is a pressing need to build confidence among the stakeholders and ensure regulatory adherence. The raw data of blockchain transactions do not readily reveal the dynamic behavioural changes and their interconnection between transactions and accounts. These behavioural patterns can be useful for identifying malicious actors. Machine Learning (ML)-based models for early warning and/or detection are considered one of the potential approaches. In ML, feature engineering plays a crucial role in enhancing the predictive performance of a model. This study proposes different categories of features and unified feature extraction approaches for raw Bitcoin and Ethereum transaction data and their interconnection information. As far as we are aware, there has been no study that considered a feature engineering approach for identifying malicious activities. The significance of the engineered features was validated against eight classifiers, including Random Forest (RF), XG-boost (XG), Silas, and neural network-based classifiers. The results showed that these features contribute to higher classification accuracy and higher Area Under the Receiver Operating Characteristic Curve (AUC) value for both Bitcoin and Ethereum transactions. This work also analysed the influence of engineered features in classification using the eXplainable Artificial Intelligence (XAI) technique SHapley Additive exPlanations (SHAP) values. The feature impo...", "Published in": [{"name": "IEEE Transactions on Information Forensics and Security", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=10206"}], "Authors": [{"name": "Jeyakumar Samantha Tharani", "from": "Griffith University, Australia"}, {"name": "Zhé Hóu", "from": "Griffith University, Australia"}, {"name": "Eugene Yugarajah Andrew Charles", "from": "University of Jaffna, Sri Lanka"}, {"name": "Punit Rathore", "from": "Indian Institute of Science, India"}, {"name": "Marimuthu Palaniswami", "from": "University of Melbourne, Australia"}, {"name": "Vallipuram Muthukkumarasamy", "from": "Griffith University, Australia"}], "IEEE keywords": ["Feature extraction", "Bitcoin", "Blockchains", "Ransomware", "Task analysis", "Vectors", "Radio frequency"], "Author Keywords": []}