{"Title": "Construction of Virtual Shared Space and Design of Safety Monitoring System in the Context of Metaverse", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICDCECE60827.2024.10549583", "Date of Publication": "26-27 April 2024", "abstract": "How to ensure the construction and safety monitoring of virtual shared space? The purpose of this research is to explore the method of constructing a virtual shared space in the context of the meta-universe and design a corresponding safety monitoring system. In the research, this article adopts comprehensive analysis and empirical research methods to analyze the existing virtual shared space construction methods and technologies, including virtual reality, augmented reality and mixed reality. By analyzing the concept and characteristics of the meta-universe, the importance and challenges of virtual shared space are revealed. At the same time, in-depth research is carried out on the construction and security monitoring of virtual shared spaces, and theories in the fields of information security, data privacy protection, and virtual reality technology are combined in the research methods. The research results show that the response time of this system is the longest 0.6s and the shortest 0.1s, which is of great significance for the development of the meta-universe and the construction of virtual shared space.", "Published in": [{"name": "2024 Third International Conference on Distributed Computing and Electrical Circuits and Electronics (ICDCECE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548017/proceeding"}], "Authors": [{"name": "Shaozheng Wang", "from": "Office of Academic Affairs, Wuhan Business University, Wuhan, Hubei, China"}], "IEEE keywords": ["Privacy", "Metaverse", "Mixed reality", "Aerospace electronics", "Safety", "Blockchains", "Security"], "Author Keywords": ["security monitoring system", "virtual shared space", "metaverse", "blockchain technology"]}