{"Title": "Python- Driven Organ Management System based on DJANGO Environment", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICDCECE60827.2024.10548788", "Date of Publication": "26-27 April 2024", "abstract": "Modern organ donation and transplantation systems have special requirements and challenges in relation to regis-tration, donor-recipient pairing, organ removal, organ delivery, and transplantation. It also present technological, ethical, legal, and clinical constraints. Therefore, to provide a just and effective procedure that improves patient experience and trust, an final result of organ-transplantation & donation system is needed. Numerous Ethereum blockchain-based private solutions are available to facilitate organ donation and transplantation administration; nevertheless, their scalability, accuracy, and authenticity are limited, despite their substantial flexibility. The suggested web platform for managing organ donations, powered by Python, is intended to provide an easy-to-use and safe interface that will expedite and simplify the organ donation procedure. The platform prioritizes user verification and offers unique features for donors, recipients, and administrators. Users can create accounts and manage comprehensive profiles that include personal data, medical histories, and donation preferences. To maximize the likelihood of successful organ transplants, a sophisticated matching system that uses algorithms to match possible donors with recipients based on compatibility parameters including organ type, location, and urgency is essential to its operation. In order to demonstrate the efficacy of the proposed organ donation model, the python driven-model performance parameter are overlaid on the Blockchain-driven performance parameter. Experimental results demonstrate that the proposed model offers better Scalability, Accuracy, Authentication with significant Flexibility. Further, the proposed python-Driven model achieves approximately 8% and 10% improvements in Accuracy and Scalability respectively against the existing model.", "Published in": [{"name": "2024 Third International Conference on Distributed Computing and Electrical Circuits and Electronics (ICDCECE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548017/proceeding"}], "Authors": [{"name": "H. T. Manohara", "from": "Dept. of Electronics and Communication Engg, Nitte Meenakshi Institute of Technology, Bangalore, India"}, {"name": "C.N. Nagabushan", "from": "Dept. of Electronics and Communication Engg, Nitte Meenakshi Institute of Technology, Bangalore, India"}, {"name": "Ananad J Nagri", "from": "Dept. of Electronics and Communication Engg, Nitte Meenakshi Institute of Technology, Bangalore, India"}, {"name": "Rakshith. K. R", "from": "Dept. of Electronics and Communication Engg, Nitte Meenakshi Institute of Technology, Bangalore, India"}], "IEEE keywords": ["Law", "Scalability", "Smart contracts", "Receivers", "Safety", "Recording", "Organ transplantation"], "Author Keywords": ["Organ Donation System", "DJANGO Framework", "Python Based Algorithm", "Fair donor", "Fair receiver"]}