{"Title": "A Two-Factor Authenticated and Secure Credit Card System for E-Platforms", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/InCACCT61598.2024.10551037", "Date of Publication": "02-03 May 2024", "abstract": "The digital world has expanded because of Covid-19. Also, the impact of demonetization on the expansion of digital transactions can vary based on several factors, including the readiness of the digital infrastructure, the level of financial inclusion, and the overall economic landscape of a country. However earlier all users have depended on physical transaction but after covid and other reasons the many users are not interested to do same tasks manually. Instead of that it required to do the transactions in online platforms. For example, e-fund transfers, digital wallets, mobile payments etc. In this regards it can see one thing that network size was increased. As the network expands, the risk of attacks seeking sensitive user information, like login credentials and credit card details, rises. With many users relying on credit cards for online transactions, safeguarding login credentials becomes crucial to prevent unauthorized access during transactions. Based on research gaps it can say that a new and secure credit card storage system will be useful for e-commerce. In most cases, sensitive and classified data or information is presented in unencrypted formats to remote machines resulting in unauthorized access and disclosure. This proposed work has explained with 2-stage mechanism in which one stage at banker side and other at e-commerce side. The first stage performed with tokenization (with XOR operation) and AES cryptosystem. In second stage, providing security by using two factor authentication of generating secret pin along with OTP. After completion of implementation, every credit card holder data has encrypted along with their transaction.", "Published in": [{"name": "2024 2nd International Conference on Advancement in Computation & Computer Technologies (InCACCT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550186/proceeding"}], "Authors": [{"name": "Aravind Karrothu", "from": "Department of IT, GMR Institute of Technology, Rajam, India"}, {"name": "Upadrista Mahesh", "from": "Department of IT, GMR Institute of Technology, Rajam, India"}, {"name": "Pudi Bhanu", "from": "Department of IT, GMR Institute of Technology, Rajam, India"}, {"name": "Telukala Charan Sahu", "from": "Department of IT, GMR Institute of Technology, Rajam, India"}], "IEEE keywords": ["COVID-19", "Online banking", "Databases", "Credit cards", "Tokenization", "Pins", "Encryption"], "Author Keywords": ["Digital Platform", "Online Transaction", "Credit Card", "Tokenization", "AES cryptosystem", "two-factor authentication", "Attacks", "and Security"]}