{"Title": "Cryptocurrency Price Prediction using Machine Learning", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/InCACCT61598.2024.10551043", "Date of Publication": "02-03 May 2024", "abstract": "The preeminent cryptocurrency globally, Bitcoin, facilitates secure online transactions, ensuring financial privacy during swift cash transactions. Recent years have witnessed heightened consumer interest in the Bitcoin ecosystem. The research objective is to scrutinize two prominent approaches for cryptocurrency price forecasting: one leveraging time series methodology using Prophet and the other incorporating sentiment analysis from social media, particularly Twitter. A novel CNN-LSTM layer is proposed for comprehensive evaluation. The algorithms undergo training on real-time financial data streams, and performance is assessed through metrics like accuracy score, Mean Absolute Percentage Error, and R2 Score. Findings reveal that the integration of sentiment analysis with the CNN-LSTM pipeline yields significantly enhanced accuracy of 0.94 on the training data and 0.91 on the testing data in aligning with price trends compared to the Prophet algorithm over Bitcoin closing prices.", "Published in": [{"name": "2024 2nd International Conference on Advancement in Computation & Computer Technologies (InCACCT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550186/proceeding"}], "Authors": [{"name": "Devesh Chandra", "from": "Computer Science and Information Technology, KIET Group of Institutions, Ghaziabad, India"}, {"name": "Pranav Tyagi", "from": "CSIT, KIET Group of Institutions, Ghaziabad, India"}, {"name": "Radhe Shyam Gupta", "from": "KIET Group of Institutions, Ghaziabad, India"}, {"name": "Aayush Mohan Saxena", "from": "CSIT, KIET Group of Institutions, Ghaziabad, India"}, {"name": "Silki Kharaliya", "from": "Computer Science and Information Technology, KIET Group of Institutions, Ghaziabad, India"}], "IEEE keywords": ["Training", "Sentiment analysis", "Social networking (online)", "Pipelines", "Time series analysis", "Blogs", "Training data"], "Author Keywords": ["Bitcoin", "Forecasting", "Sentiments", "VADER", "CNN", "LSTM"]}