{"Title": "Decentralized, Distributed Computing for Internet of Things‐Based Cloud Applications", "Pages": "43 - 64", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "Wiley Data and Cybersecurity", "DOI": "10.1002/9781394213948.ch3", "Date of Publication": null, "abstract": "Summary Information services frequently utilize cloud computing. However, massive Internet of Things (IoT) applications pose fresh difficulties for cloud computing infrastructures. As a solution to this issue, edge computing has been proposed as an alternative to cloud computing. Tens of billions of IoT devices can be supported, and hardware can be improved through voluntary computing, which collects underutilized network resources. This chapter offers a blockchain technology for the use of volunteer edge cloud in light of the shortcomings of conventional volunteer computing, which cannot offer real‐time services, and existing volunteer clouds lack a system to pay for services. Blockchain smart contracts are used to pay for essential business processes and computing services, and container technology provides a shared operating environment. A prototype system built on top of Ethereum and KubeEdge has been introduced and provides an up‐to‐date overview of a voluntary blockchain‐based edge cloud infrastructure. An Internet of Things has been created to manage robot formation in addition to the prototype system. Through a decrease in IoT device complexity, an increase in software development freedom, and an improvement in computing service payment, it serves as an example of the benefits of an optional edge cloud. Large‐scale IoT system management has taken advantage of cloud computing. IoT multi‐cloud servers typically deal with a large volume of queries. The cloud must offer the servers with outstanding flexibility, reliability, affordable cost, and essential functionality because of the fluctuating and intense workload. Traditional clouds, on the other hand, often provide cloud service abstraction of a VM, which scarcely suffices to meet these requirements. As a result of the fluctuating workload, many cloud vendors offer varying performance stability and pricing strategies. The needs of the IoT scenario cannot be adequately satisfied by a single cloud. Cooperation ...", "Published in": [], "Authors": [{"name": "E.M. Roopa Devi", "from": "Department of Information Technology, Kongu Engineering College (Autonomous), Perundurai, Tamil Nadu, India"}, {"name": "R. Shanthakumari", "from": "Department of Information Technology, Kongu Engineering College (Autonomous), Perundurai, Tamil Nadu, India"}, {"name": "R. Rajadevi", "from": "Department of Artifical Intelligence, Kongu Engineering College (Autonomous), Perundurai, Tamil Nadu, India"}, {"name": "D. Kayethri", "from": "Department of Artifical Intelligence, Kongu Engineering College (Autonomous), Perundurai, Tamil Nadu, India"}, {"name": "V. Aparna", "from": "Department of Information Technology, Kongu Engineering College (Autonomous), Perundurai, Tamil Nadu, India"}], "IEEE keywords": ["Cloud computing", "Internet of Things", "Blockchains", "Hardware", "Computer architecture", "Computer applications", "Data centers"], "Author Keywords": []}