{"Title": "Auditable and Verifiable Federated Learning Based on Blockchain-Enabled Decentralization", "Pages": "1 - 14", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/TNNLS.2024.3407670", "Date of Publication": "14 June 2024", "abstract": "Auditability and verifiability are critical elements in establishing trustworthiness in federated learning (FL). These principles promote transparency, accountability, and independent validation of FL processes. Incorporating auditability and verifiability is imperative for building trust and ensuring the robustness of FL methodologies. Typical FL architectures rely on a trustworthy central authority to manage the FL process. However, reliance on a central authority could become a single point of failure, making it an attractive target for cyber-attacks and insider frauds. Moreover, the central entity lacks auditability and verifiability, which undermines the privacy and security that FL aims to ensure. This article proposes an auditable and verifiable decentralized FL (DFL) framework. We first develop a smart-contract-based monitoring system for DFL participants. This monitoring system is then deployed to each DFL participant and executed when the local model training is initiated. The monitoring system records necessary information during the local training process for auditing purposes. Afterward, each DFL participant sends the local model and monitoring system to the respective blockchain node. The blockchain nodes representing each DFL participant exchange the local models and use the monitoring system to validate each local model. To ensure an auditable and verifiable decentralized aggregation procedure, we record the aggregation steps taken by each blockchain node in the aggregation contract. Following the aggregation phase, each blockchain node applies a multisignature scheme to the aggregated model, producing a globally verifiable model. Based on the signed global model and the aggregation contract, each blockchain node implements a consensus protocol to store the validated global model in tamper-proof storage. To evaluate the performance of our proposed model, we conducted a series of experiments with different machine learning architectures and datasets, ...", "Published in": [{"name": "IEEE Transactions on Neural Networks and Learning Systems", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5962385"}], "Authors": [{"name": "Aditya Pribadi Kalapaaking", "from": "School of Computing Technologies, RMIT University, Melbourne, VIC, Australia"}, {"name": "Ibrahim Khalil", "from": "School of Computing Technologies, RMIT University, Melbourne, VIC, Australia"}, {"name": "Xun Yi", "from": "School of Computing Technologies, RMIT University, Melbourne, VIC, Australia"}, {"name": "Kwok-Yan Lam", "from": "College of Computing and Data Science, Singapore, Singapore"}, {"name": "Guang-Bin Huang", "from": "School of Automation, Southeast University, Nanjing, China"}, {"name": "Ning Wang", "from": "Chongqing College of Mobile Communication, Chongqing, China"}], "IEEE keywords": ["Auditable decentralized federated learning (DFL)", "blockchain", "DFL", "multisignature", "smart contract", "verifiable DFL"], "Author Keywords": []}