{"Title": "Replacing the Traditional Music Black Box:A Blockchain Based Approach For Securing Music Sharing Systems", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IC3IoT60841.2024.10550291", "Date of Publication": "17-18 April 2024", "abstract": "From the prehistoric to the modern eras, music has been an important part of our culture and civilization. The digital era has expanded to include music as well. The musician gave their all to get listeners to love the music. However, the current music industry demotivates artists in a number of ways, including copyright violations while sharing, being softcopied, and internet uploads. Artists who make people happy experience a great collapse as a result. In this paper, we'll talk about how blockchain technology can be applied to music platforms to make them more safe and transparent than the current system. We offer an alternative online database system that manages copyright between individuals and has the quality of being tamper-proof. This system leverages the Ethereum blockchain network to store data. Using smart contracts, we offer quick and efficient payments in ethereum using available accounts in the digial wallet and block explorer to follow information that is kept in the network. The paper's design and implementation are demonstrated in detail. The files that are softcopied from the system and files that are uploaded illegally will be removed by this system.", "Published in": [{"name": "2024 International Conference on Communication, Computing and Internet of Things (IC3IoT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550185/proceeding"}], "Authors": [{"name": "B Kamala", "from": "Department of Information Technology, Sri Sairam Engineering College, Chennai, Tamil Nadu, India"}, {"name": "R RamKumar", "from": "Department of Information Technology, Sri Sairam Engineering College, Chennai, Tamil Nadu, India"}, {"name": "R Siddharthan", "from": "Department of Information Technology, Sri Sairam Engineering College, Chennai, Tamil Nadu, India"}], "IEEE keywords": ["Industries", "Electronic equipment", "Flight recording", "Smart contracts", "Music", "Database systems", "Telecommunication computing"], "Author Keywords": ["Ethereum", "Digital wallet", "Smart contract", "Copyright", "File sharing", "Block explorer", "Blockchain Network"]}