{"Title": "Sustainability in the Era of Industry 4.0 and Circular Economy: Thoretical Background and Bibliometric Analysis", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IRASET60544.2024.10549392", "Date of Publication": "16-17 May 2024", "abstract": "The emergence of the sustainable development has encouraged manufacturers and scientific researchers to adopt new economic models such as the “circular economy”. This new strategy targets the efficient and sustainable management of resources as well as the reduction and elimination of waste. Researches on circularity in business models has recently increased but few researchers have studied the link between sustainability and circular economy in the context of Industry 4.0. To fill this gap, this paper conducts a bibliometric analysis to identify and discuss the existing literature. This review, based on the Scopus database, identified a literature survey of 77 documents published from 2017 to 2023. The paper begins by defining the different concepts related to our studies. Thereafter, it highlights our research methodology steps, followed by descriptive analysis. The findings indicate that there is a clear orientation of sustainability to improve manufacturing system and supply chain management throughout the product life cycle. Also, the industry 4.0 technologies are necessary to implement the circular economy strategies. Thus, organizations will be able to build a cleaner-intelligent processes.", "Published in": [{"name": "2024 4th International Conference on Innovative Research in Applied Science, Engineering and Technology (IRASET)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548014/proceeding"}], "Authors": [{"name": "Abdelmounaime Dachry", "from": "Laboratory of Electrical and Industrial Engineering, Information Processing and Logistics FSAC, Hassan 2 University, Casablanca, Morocco"}, {"name": "Nouhaila El Assad", "from": "Laboratory of Electrical and Industrial Engineering, Information Processing and Logistics FSAC, Hassan 2 University, Casablanca, Morocco"}, {"name": "Hicham Fouraiji", "from": "Laboratory of Electrical and Industrial Engineering, Information Processing and Logistics FSAC, Hassan 2 University, Casablanca, Morocco"}, {"name": "Hassan Gziri", "from": "Laboratory of Engineering, Industrial Management and Innovation, Science and Technology faculty, Hassan 1 University, Settat, Morocco"}, {"name": "Wafaa Dachry", "from": "Laboratoty of EIMI, FST, Hassan 1 University, Settat, Morocco"}, {"name": "Najat Messaoudi", "from": "Laboratory of Electrical and Industrial Engineering, Information Processing and Logistics FSAC, Hassan 2 University, Casablanca, Morocco"}], "IEEE keywords": ["Surveys", "Supply chain management", "Databases", "Reviews", "Biological system modeling", "Bibliometrics", "Supply chains"], "Author Keywords": ["sustainability", "sustainable development", "circular economy", "industry 4.0", "digital technologies", "bibliometric analysis"]}