{"Title": "Autonomous Floating Debris Collection System for Water Surface Cleaning", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IC3IoT60841.2024.10550252", "Date of Publication": "17-18 April 2024", "abstract": "This paper presents the design and implementation of an autonomous waste collection robot aimed at efficiently lifting and disposing of debris from water surfaces. The robot utilizes a conveyor system, driven by a servo motor, to collect various waste materials, including water debris, garbage, and plastics. A water wheel, powered by a BLDC motor, enables the robot’s movement on water, enhancing its cleaning capabilities. The system incorporates an accurate computer vision system, leveraging an improved YOLOv5s algorithm. The proposed solution employs a set of sensors, including GPS, Compass, and a camera, for precise navigation and waste identification. The paper outlines the hardware components, including Raspberry Pi, Flight Controller, LiPo Batteries, Transceivers, and modules, used in the system. Experimental results demonstrate the effectiveness of the robot in autonomously cleaning water surfaces and safely collecting waste debris. This project represents a significant step toward the development of a robotic platform for environmental conservation and river pollution management.", "Published in": [{"name": "2024 International Conference on Communication, Computing and Internet of Things (IC3IoT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550185/proceeding"}], "Authors": [{"name": "K Subhashini", "from": "Department of Electronics and Communication Engineering, Sri Sai Ram Engineering College, Chennai, India"}, {"name": "K Shreya Shree", "from": "Department of Electronics and Communication Engineering, Sri Sai Ram Engineering College, Chennai, India"}, {"name": "A Abirami", "from": "Department of Electronics and Communication Engineering, Sri Sai Ram Engineering College, Chennai, India"}, {"name": "R D Kalaimathy", "from": "Department of Electronics and Communication Engineering, Sri Sai Ram Engineering College, Chennai, India"}, {"name": "R Deepika", "from": "Department of Electronics and Communication Engineering, Sri Sai Ram Engineering College, Chennai, India"}, {"name": "J Thamil Selvi", "from": "Department of Electronics and Communication Engineering, Sri Sai Ram Engineering College, Chennai, India"}], "IEEE keywords": ["Surface cleaning", "YOLO", "Waste materials", "Surface contamination", "Wheels", "Water conservation", "Water pollution"], "Author Keywords": ["Autonomous Waste Collection", "Computer Vision", "Sensors", "Arduino"]}