{"Title": "Optimization Analysis of Blockchain Fragmentation by the Revenue Incentive Algorithm for Edge Computing", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICDCECE60827.2024.10548196", "Date of Publication": "26-27 April 2024", "abstract": "The optimization analysis of the fragmentation is critical in blockchain fragmentation, however it has an issue with erroneous performance positioning. The typical Decision tree algorithm is unable to address the phase limit issue in blockchain fragmentation, and the result is insufficient. As a result, a The gain incentive algorithm for edge calculation-based optimization analysis of blockchain sharding is provided, and the optimization analysis of blockchain sharding is assessed. To begin, the evolution strategy theory is used to discover the influencing elements, and the indicators are split based on the optimization analysis of the fragmentation's needs to decrease interference factors in the optimization analysis of the fragmentation. The evolution strategy theory is then used to create a The gain incentive algorithm for edge calculation optimization analysis of the fragmentation scheme, and the outcomes of the optimization analysis of the fragmentation are thoroughly examined. The MATLAB simulation results reveal that, under particular evaluation conditions, the gain incentive algorithm for edge calculation outperforms the standard Decision tree algorithm in terms of optimization analysis of the fragmentation accuracy and time of influencing variables.", "Published in": [{"name": "2024 Third International Conference on Distributed Computing and Electrical Circuits and Electronics (ICDCECE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548017/proceeding"}], "Authors": [{"name": "Jing Yin", "from": "College of Artificial Intelligence, Wuhan Technology and Business University, Wuhan, China"}], "IEEE keywords": ["Sharding", "Simulation", "Interference", "Blockchains", "Internet", "Decision trees", "Reliability"], "Author Keywords": ["evolution strategy theory", "blockchain fragmentation", "Edge calculation", "Income incentive"]}