{"Title": "Exploiting Library Vulnerability via Migration Based Automating Test Generation", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1145/3597503.3639583", "Date of Publication": "14-20 April 2024", "abstract": "In software development, developers extensively utilize third-party libraries to avoid implementing existing functionalities. When a new third-party library vulnerability is disclosed, project maintainers need to determine whether their projects are affected by the vulnerability, which requires developers to invest substantial effort in assessment. However, existing tools face a series of issues: static analysis tools produce false alarms, dynamic analysis tools require existing tests and test generation tools have low success rates when facing complex vulnerabilities. Vulnerability exploits, as code snippets provided for reproducing vulnerabilities after disclosure, contain a wealth of vulnerability-related information. This study proposes a new method based on vulnerability exploits, called Vesta (Vulnerability Exploit-based Software Testing Auto-Generator), which provides vulnerability exploit tests as the basis for developers to decide whether to update dependencies. Vesta extends the search-based test generation methods by adding a migration step, ensuring the similarity between the generated test and the vulnerability exploit, which increases the likelihood of detecting potential library vulnerabilities in a project. We perform experiments on 30 vulnerabilities disclosed in the past five years, involving 60 vulnerability-project pairs, and compare the experimental results with the baseline method, Transfer. The success rate of Vesta is 71.7% which is a 53.4% improvement over Transfer in the effectiveness of verifying exploitable vulnerabilities.", "Published in": [{"name": "2024 IEEE/ACM 46th International Conference on Software Engineering (ICSE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548016/proceeding"}], "Authors": [{"name": "Zirui Chen", "from": "The State Key Laboratory of Blockchain and Data Security, Zhejiang University, Hangzhou, China"}, {"name": "Xing Hu", "from": "The State Key Laboratory of Blockchain and Data Security, Zhejiang University, Hangzhou, China"}, {"name": "Xin Xia", "from": "Huawei, China"}, {"name": "Yi Gao", "from": "The State Key Laboratory of Blockchain and Data Security, Zhejiang University, Hangzhou, China"}, {"name": "Tongtong Xu", "from": "Huawei, China"}, {"name": "David Lo", "from": "Singapore Management University, Singapore"}, {"name": "Xiaohu Yang", "from": "The State Key Laboratory of Blockchain and Data Security, Zhejiang University, Hangzhou, China"}], "IEEE keywords": ["Software testing", "Codes", "Static analysis", "Libraries", "Test pattern generators", "Faces", "Software engineering"], "Author Keywords": ["Library Vulnerabilities", "Search-based Test Generation"]}