{"Title": "Survey on Reinforcement Learning Techniques for Enhancing Security and Efficiency in Zero Trust Networks", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICASI60819.2024.10547956", "Date of Publication": "17-21 April 2024", "abstract": "In the dynamic field of cybersecurity, Zero Trust networks (ZTNs) have been established as essential for protecting digital assets, with their adoption accelerating across various industries. However, the challenge of optimizing these networks for security and efficiency has spotlighted the need for innovative solutions, with Reinforcement Learning (RL) techniques showing untapped potential. While RL's application in other domains is well-documented, its integration into ZTNs for enhanced security and efficiency remains underexplored. Our study investigates the application of RL in ZTNs, identifying models that significantly improve network adaptability and performance against cyber threats. Through a detailed review and classification of RL strategies, we found specific models that enhance ZTN security and efficiency. Our analysis provides insights into the operation mechanisms and impacts of these models, offering a comparative analysis of their effectiveness. This exploration underscores RL's potential in fortifying ZTNs, suggesting a paradigm shift in cybersecurity optimization and setting the stage for further research on the integration of AI and machine learning in enhancing network resilience.", "Published in": [{"name": "2024 10th International Conference on Applied System Innovation (ICASI)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10547719/proceeding"}], "Authors": [{"name": "Candra Ahmadi", "from": "National Taiwan University of Science and Technology (NTUST), Taipei, Taiwan (R.O.C.)"}, {"name": "Jiann-Liang Chen", "from": "National Taiwan University of Science and Technology (NTUST), Taipei, Taiwan (R.O.C.)"}], "IEEE keywords": ["Surveys", "Adaptation models", "Technological innovation", "Reviews", "Reinforcement learning", "Learning (artificial intelligence)", "Zero Trust"], "Author Keywords": ["Artificial Intelligence", "Network Security", "Reinforcement Learning", "Zero Trust Networks"]}