{"Title": "Computational Intelligence in Business Management: Strategies for Innovation and Optimization", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/HORA61326.2024.10550514", "Date of Publication": "23-25 May 2024", "abstract": "In today's competitive corporate landscape, the successful integration of computational intelligence approaches provides a key edge for decision-making processes. Despite developments, there is a gap in understanding the subtle application of such methodologies in corporate management, particularly within retail environments. To address this gap, our study combines decision trees and artificial neural networks to evaluate retail transaction data, concentrating on customer behavior and purchase trends. Leveraging a comprehensive dataset spanning client demographics, transaction details, and product information, our study provides substantial insights. Results suggest an 87% accuracy rate reached by artificial neural networks in forecasting client preferences. This study contributes to bridging the research gap by giving actionable insights into the practical application of computational intelligence in boosting company strategies and decision-making processes within the retail industry.", "Published in": [{"name": "2024 International Congress on Human-Computer Interaction, Optimization and Robotic Applications (HORA)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550192/proceeding"}], "Authors": [{"name": "Saadaldeen Rashid Ahmed", "from": "Computer Science Department, Bayan University, Erbil, Kurdistan, Iraq"}, {"name": "Ali Jabbar Hussein", "from": "Al Hikma University College, Baghdad, Iraq"}, {"name": "Lubna Qassim ALhashmi", "from": "Department of Information and Knowledge Technologies, College of Arts, Basrah University, Basrah, Iraq"}, {"name": "Bourair Al-Attar", "from": "College of Medicin, University of Al-Ameed, Karbala, Iraq"}, {"name": "Shaymaa Dheeb", "from": "Department of Cyber Security and Cloud Computing, Al-Ma’moon University College, Baghdad, Iraq"}, {"name": "Duaa A. Majeed", "from": "Aeronautical Engineering Department, Baghdad University, Baghdad, Iraq"}, {"name": "Abadal-Salam T. Hussain", "from": "Department of Medical Instrumentation Techniques Engineering, Technical Engineering College, Al-Kitab University, Kirkuk, Iraq"}, {"name": "Jamal Fadhil Tawfeq", "from": "Department of Medical Instrumentation Technical Engineering, Medical Technical College, Al-Farahidi University, Baghdad, Iraq"}], "IEEE keywords": ["Ethics", "Decision making", "Companies", "Artificial neural networks", "Market research", "Turning", "Internet of Things"], "Author Keywords": ["Computational Intelligence", "Business Management", "Decision Trees", "Retail Transactions", "Business"]}