{"Title": "Exploring the Nexus Between Digital Transformation and Sustainability", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/SusTech60925.2024.10553624", "Date of Publication": "14-17 April 2024", "abstract": "Digitalization and sustainability stand out among the most critical mega-trends of the 21st century. The intersection of these two forces offers exciting opportunities to tackle global challenges, foster the creation of an equitable and ecologically sound society, and establish the foundation for realizing the Sustainable Development Goals (SDGs). Although they hold strategic importance, digital and sustainable transformations are frequently approached independently. This separation is due, in part, to the intricate and multifaceted nature of the relationship between digitalization and sustainability. An in-depth examination of various research outcomes highlights four primary areas in which sustainability and digitalization converge: Energy, Governance, Systems, and Innovation. The Governance domain is further elaborated in the context of planning and policy-making themes. Energy considerations encompass emissions, consumption, and production. Innovation is closely linked with business strategies, values, and environmental concerns. Lastly, systems are intricately connected with networks, Industry 4.0, and supply chain dynamics. These findings aim to provide insights and inspire further research and discussions on the potential interplay between sustainability and digitalization.", "Published in": [{"name": "2024 IEEE Conference on Technologies for Sustainability (SusTech)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10553376/proceeding"}], "Authors": [{"name": "O. Apata", "from": "Trilateral Research Chair in Transformative Innovation, 4IR, and Sustainable Development, University of Johannesburg, Johannesburg, South Africa"}], "IEEE keywords": ["Technological innovation", "Ethics", "Supply chains", "Green products", "Production", "Market research", "Planning"], "Author Keywords": ["digitalization", "digital revolution", "energy", "governance", "policies", "SDGs", "sustainability"]}