{"Title": "Real-Time Embedded Monitoring Technologies in Modern Healthcare Systems: A Survey", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ISORC61049.2024.10551333", "Date of Publication": "22-25 May 2024", "abstract": "This literature survey provides an overview on the current state of the practice for real-time embedded healthcare monitoring systems. These technologies enable healthcare systems to keep a constant eye on patients, collecting vital health data. They can send alerts and insights to healthcare providers, allowing for faster and better care. Our survey includes an investigation on the rising use of artificial intelligence and deep learning along with the use of intelligent sensors for capturing and analyzing data in real-time health monitoring systems. We also examine the current state of connected embedded health monitoring systems via, e.g. the Internet of Things (IoT). Wireless sensor networks and Tele-Health technologies are also addressed as they are instrumental in enhancing the precision, accessibility, and real-time nature of health data, ensuring that both patients and providers are always connected. Our survey discusses the applications and advantages associated with these technologies, providing valuable insights into their role in enhancing patient care, decision support, and tracking. Additionally, we navigate through the challenges, seeking pathways to mitigate them, and ensuring that the technology is inclusive, secure, and efficient. By examining the latest research and innovations, this survey aims to illuminate the current state of real-time healthcare monitoring and guide future advancements in this critical field.", "Published in": [{"name": "2024 IEEE 27th International Symposium on Real-Time Distributed Computing (ISORC)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10551300/proceeding"}], "Authors": [{"name": "Sree Charitha Meka", "from": "Computer Science Department, George Mason University, Fairfax, VA, USA"}, {"name": "Sanjana Achan", "from": "Computer Science Department, George Mason University, Fairfax, VA, USA"}, {"name": "Robert G. Pettit", "from": "Computer Science Department, George Mason University, Fairfax, VA, USA"}], "IEEE keywords": ["Surveys", "Wireless sensor networks", "Technological innovation", "Medical services", "Real-time systems", "Internet of Things", "Sparks"], "Author Keywords": ["Embedded Systems", "Healthcare Technology", "the Internet of Things", "Wireless Sensor Networks", "Wearable Devices", "Smart Health Monitoring", "Real-Time Applications"]}