{"Title": "Optimizing the Transaction Latency in the Blockchain-Integrated Energy-trading Platform in the Standalone Renewable Distributed Generation Arena", "Pages": "1 - 1", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ACCESS.2024.3414966", "Date of Publication": "14 June 2024", "abstract": "Renewable distributed generations are associated with generation intermittency. Exacerbated by the consumption and demand uncertainty and their resulting mismatch, its energy trading suffers similar uncertainty. The situation is severe in the standalone distributed generations (SDG) for lacking transaction access to the utility grid. This paper proposes the energy transaction time determination and minimization algorithm for consumers in the SDG arena. First, blockchain technology is adopted for transaction enhancement and transaction data acquisition. The acquired blockchain data includes the hourly nodes (number of blockchain members), transaction sizes, and corresponding transaction durations. Next, the blockchain-recorded transaction data are fitted using the linear regression (LR) algorithm to obtain their fitting formula. The fitting formula was subsequently optimized in hourly intervals to obtain the optimal transaction time (energy delivery time) using particle swarm optimization (PSO). Finally, the optimal results are presented in a decision tree (DT) to energy consumers in the blockchain platform. Consequently, their transaction decision-making is guided by the result against the inherent transaction time uncertainty. Consumers can thus correctly adjust their transaction habits to suitably adapt to the transaction duration fluctuations in the energy trading arena. Energy transaction delays and transaction costs are consequently minimized leading to greater penetration of renewables and bridging the generation and consumption gap.", "Published in": [{"name": "IEEE Access", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6287639"}], "Authors": [{"name": "Martin Onyeka Okoye", "from": "School of Electrical Engineering, Pontificia Universidad Católica de Valparaíso, Avenida Brasil, Chile"}, {"name": "Junyou Yang", "from": "School of Electrical Engineering, Shenyang University of Technology, Shenyang, China"}, {"name": "Jia Cui", "from": "School of Electrical Engineering, Shenyang University of Technology, Shenyang, China"}, {"name": "Akhtar Hussain", "from": "Department of Electrical and Computer Engineering, University of Alberta, Edmonton, AB, Canada"}, {"name": "Van-Hai Bui", "from": "Department of Electrical and Computer Engineering, University of Michigan-Dearborn, MI, USA"}, {"name": "Danny Espin-Sarzosa", "from": "School of Electrical Engineering, Pontificia Universidad Católica de Valparaíso, Avenida Brasil, Chile"}], "IEEE keywords": ["Blockchains", "Peer-to-peer computing", "Distributed power generation", "Delays", "Renewable energy sources", "Costs", "Uncertainty"], "Author Keywords": []}