{"Title": "Test Case Optimization Technique for Web Applications", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICDCECE60827.2024.10548325", "Date of Publication": "26-27 April 2024", "abstract": "Software testing is indeed an important part of the application development. In order to identify the bugs, present in the developed source code, software testing techniques are applied. The testing method considers various test cases provided to meet the software outcome on demand. The emerging growth of artificial intelligence (AI) technology and machine learning (ML) techniques reduces the complexity in test case running sequences, as the AI algorithms reduces the frequently repeated test cases, accelerating the processing depth by understanding the pattern of test logs etc. The comprehensive study is proposed on optimization of test case execution on development of web applications is given. The challenges in existing implementations such as latency, duplicate test cases, redundant test cases are considered. The proposed model is developed with a novel architecture using a case study on machine learning model named Regressive vector analysis (RV A). Since the optimization process increase the quality of the test sequence, the quantitative outcome of the test model is improved. The system achieved with accuracy of 92 % and Mathew's correlation constant (MCC) is 98%.", "Published in": [{"name": "2024 Third International Conference on Distributed Computing and Electrical Circuits and Electronics (ICDCECE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548017/proceeding"}], "Authors": [{"name": "V Manojkumar", "from": "Department of Computer Applications, Vels Institute of Science Technology and Advanced Studies (VISTAS), Chennai, India"}, {"name": "R. Mahalakshmi", "from": "Department of Computer Applications, Vels Institute of Science Technology and Advanced Studies (VISTAS), Chennai, India"}], "IEEE keywords": ["Software testing", "Analytical models", "Machine learning algorithms", "Correlation", "Source coding", "Software algorithms", "Machine learning"], "Author Keywords": ["Test case optimization", "Data analytics", "Artificial Intelligence", "Neural network", "Machine learning"]}