{"Title": "Embedded C Based Smart Voting System With Biometric", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IC3IoT60841.2024.10550244", "Date of Publication": "17-18 April 2024", "abstract": "India is a democratic nation where elections are heavily influenced by the voting method. The foundation of any social equality is the legitimacy of citizens’ selection of their own representatives. This implementation of electronic voting technology, which includes biometric authentication in restricted hardware environments. The design efficiently tackles resource scarcity associated with embedded systems while guarding robustly against meddling and unauthorized access. It elaborates on the structure, integrating biometric sensors, secure communication practices, and agreement mechanisms with block chain frameworks. Moreover, it discusses the application of voter authentication, the voting interface, and auditing processes to check election results. This proposed system propels forward the development of secure electronic voting systems and proves to be a hopeful prospect for democratic processes in this rapidly digitalizing world.", "Published in": [{"name": "2024 International Conference on Communication, Computing and Internet of Things (IC3IoT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550185/proceeding"}], "Authors": [{"name": "K. Sumathi", "from": "ECE Sri Sairam Engineering College, Chennai, India"}, {"name": "V Srivathsan", "from": "ECE Sri Sairam Engineering College, Chennai, India"}, {"name": "M Karthick Raj", "from": "ECE Sri Sairam Engineering College, Chennai, India"}, {"name": "S Hasan Sultan", "from": "ECE Sri Sairam Engineering College, Chennai, India"}], "IEEE keywords": ["Privacy", "Embedded systems", "Electronic voting systems", "Biometrics (access control)", "Databases", "Authentication", "Propulsion"], "Author Keywords": ["Biometric Authentication", "Communication practices", "Electronic Voting", "Embedded Systems", "Hardware Environments"]}