{"Title": "Designing Resilient Industrial Communication Systems against Cyber Threats", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/CSNT60213.2024.10546089", "Date of Publication": "06-07 April 2024", "abstract": "Today, cyber assaults are common, therefore industrial communication systems need strong protection. This study presents a comprehensive method to improve cyberattack resilience. It has three main algorithms. These algorithms identify hazards before they happen, react quickly, and provide adaptive system security. Due to their mathematical roots, these algorithms can make exact conclusions now. Potential Hazard Identification and Classification The first technique extracts features from raw data and organises them into feature vectors. Assigning an anomaly score to every data point allows instantaneous hazard detection. This tool uses anomaly detection to find unusual computer system and network activity. Emergency Response and The second algorithm calculates incident response time based on risk. It gives rapid, efficient replies based on severity, reducing hazards as they emerge. To assure safety in changing surroundings The third algorithm updates the system's security settings to reflect threat environment changes. It assesses danger and modifies security measures accordingly. The proposed strategy outperforms established methods in several performance evaluation criteria. It improves accuracy and precision while maintaining recall rates equal to competitors, making it a dependable and durable solution for protecting industrial communication systems from changing cyber threats.", "Published in": [{"name": "2024 IEEE 13th International Conference on Communication Systems and Network Technologies (CSNT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10545643/proceeding"}], "Authors": [{"name": "Muthukumar B", "from": "Department of Animation and Virtual Reality, Jain (Deemed to be University), Bangalore, India"}, {"name": "Karishma Desai", "from": "Department of uGDX, ATLAS SkillTech University, Mumbai, Maharashtra, India"}, {"name": "Ravindra Kumar", "from": "Department of Mathematics, Vivekananda Global University, Jaipur, India"}], "IEEE keywords": ["Adaptive systems", "Industrial communication", "Feature extraction", "Hazards", "Vectors", "Classification algorithms", "Security"], "Author Keywords": ["Industrial", "Machine Learning", "Mathematical Equations", "Performance Evaluation", "Precision", "Proactive", "Protection", "Resilience", "Response Time", "Security Policy", "Specificity", "Threat Detection"]}