{"Title": "Data Provenance P-Chain in Blockchain with Enhanced Security by Combining Cloud Environment", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IC3IoT60841.2024.10550282", "Date of Publication": "17-18 April 2024", "abstract": "Data management is growing in large scale applications with more complexity, and these data has to be stored in a database where now cloud provides a suitable data access from anywhere in on-demand process, with some benefits. The main challenging drawback of this cloud storage is Data Provenance. Data provenance or data lineage is a collection of data which provides the detail information about the data origin. In this paper we look for the present cloud provenance and their security modulations which work with the blockchain network. The main work of this paper is how provenance is categorized, what is the need, why it is needed, how it is described, and way to publicize it. This paper also analyzes the challenges facing provenance anthology and a variety of models used to overcome them. The ideal outcome of the paper is tamper-proof records can be obtained using the provenance concept merged with blockchain technology. Cloud storage is used to collect different form of provenance records. A DPAEBS-Chain (Data Provenance- Attribute enabled blockchain service) chain is designed and which will validate the records available in cloud and embeds into blockchain storage of transactions enhances the reliability with low overhead, user privacy and tamper-proof provenance with high security measures.", "Published in": [{"name": "2024 International Conference on Communication, Computing and Internet of Things (IC3IoT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550185/proceeding"}], "Authors": [{"name": "P S Apirajitha", "from": "Department of Computing Technologies, SRM Institute of Science & Technology, Kattankulathur, Chennai, India"}, {"name": "Godfrey Winster Sathianesan", "from": "Department of Computing Technologies, SRM Institute of Science & Technology, Kattankulathur, Chennai, India"}], "IEEE keywords": ["Cloud computing", "Data privacy", "Databases", "Modulation", "Reliability engineering", "Blockchains", "Telecommunication computing"], "Author Keywords": ["Data Provenance", "Data Lineage", "Security", "Blockchain", "p-chain"]}