{"Title": "Algorithms for Selecting Shared Logistics Delivery Nodes in E-commerce Based on Blockchain Technology", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICDCECE60827.2024.10548893", "Date of Publication": "26-27 April 2024", "abstract": "The concept of sharing economy has been widely recognized, but the immaturity of sharing platforms, the insecurity of data, and the opacity of information have led to many problems in the process of shared logistics. Shared logistics is based on the concept of platform resource integration and service sharing, with services provided by third parties. Users can integrate and share goods, funds, information and other resources through online platforms according to their needs. In this mode, the logistics distribution center undertakes functions such as goods distribution and information collection. Therefore, this article focused on the problem of selecting logistics distribution nodes under the shared logistics model. A multi-objective optimization model was designed, with different weight values set for each parameter in each objective function. A logistics distribution node location algorithm based on blockchain technology was explored using blockchain technology. Finally, the effectiveness of the algorithm in solving the model was verified through experiments. The experimental study found that the algorithm based on blockchain technology had a high number of Pareto frontier solutions within the selected range, up to 27, which was 12 times higher than traditional site selection.", "Published in": [{"name": "2024 Third International Conference on Distributed Computing and Electrical Circuits and Electronics (ICDCECE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10548017/proceeding"}], "Authors": [{"name": "Xiaojiao Zeng", "from": "School of Economics and Management, Hubei Three Gorges Polytechnic, YiChang, HuBei, China"}], "IEEE keywords": ["Costs", "Information security", "Sharing economy", "Linear programming", "Blockchains", "Consensus protocol", "Electronic commerce"], "Author Keywords": ["blockchain technology", "e-commerce shared logistics", "distribution node location selection algorithm", "physical distribution management"]}