{"Title": "Futuristic Technologies for Smart Manufacturing", "Pages": "415 - 441", "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "Wiley Data and Cybersecurity", "DOI": "10.1002/9781394213948.ch21", "Date of Publication": null, "abstract": "Summary\nIndustry 5.0 is an era of Internet of Things, artificial intelligence, and digital twin technology for smart manufacturing. The integration of futuristic technologies in smart manufacturing presents endless opportunities for manufacturers to increase efficiency, reduce costs, and improve product quality. However, to fully realize the benefits of these technologies, manufacturers must embrace automation, data, collaboration, training, and flexibility. The successful implementation of futuristic technologies in smart manufacturing requires a culture of innovation and continuous improvement as well as a willingness to take risks and try new approaches. By using data to make data‐driven decisions, manufacturers can improve product quality and reduce waste, creating a positive impact on the environment. Smart manufacturing also creates new job opportunities in programming, data analysis, and robotics. Ultimately, the integration of futuristic technologies in smart manufacturing is essential for the continued growth and success of the manufacturing industry.", "Published in": [], "Authors": [{"name": "Amit Kumar Tyagi", "from": "School of Computer Science and Engineering, Vellore Institute of Technology, Chennai, Tamil Nadu, India"}, {"name": "Anand Kumar Mishra", "from": "Computer Science and Engineering, NIIT University, Neemrana, Rajasthan, India"}, {"name": "Nalla Vedavathi", "from": "Department of Fashion Technology, National Institute of Fashion Technology, New Delhi, Delhi, India"}, {"name": "Vijayalakshmi Kakulapati", "from": "Sreenidhi Institute of Science and Technology, Hyderabad, Telangana, India"}, {"name": "S. A. Sajidha", "from": "Department of Fashion Technology, National Institute of Fashion Technology, New Delhi, Delhi, India"}], "IEEE keywords": ["Artificial intelligence", "Smart manufacturing", "Internet of Things", "Blockchains", "Task analysis", "Digital twins", "Robots"], "Author Keywords": []}