{"Title": "MorteSense DIY Home Security", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/SusTech60925.2024.10553480", "Date of Publication": "14-17 April 2024", "abstract": "In recent years, DIY security system technologies have become more accessible for the general public. This coincided with the emergence of brands like Ring, Blink, Wyze, SimpliSafe, and Vivint, which specialized in smart home security. These brands offer a range of products, including front-door cameras, infrared motion sensors/ detectors, and in-home cameras providing various views of the house. One notable drawback of these product ecosystems is their reliance on a proprietary mobile application and a smartphone capable of running it. If the application ceased to receive support or the company went out of business, the associated hardware might no longer function as intended, resulting in unnecessary e-waste and unsustainable security practices. The proposed system design addressed the dependency on proprietary software by utilizing flexible software design within a modular motion detection security system. The proposed design entails an ecosystem that could be customized to meet specific user requirements and specifications. It was designed with sustainability in mind, capable of being thoroughly customized to different tools and services.", "Published in": [{"name": "2024 IEEE Conference on Technologies for Sustainability (SusTech)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10553376/proceeding"}], "Authors": [{"name": "Shohin Abdulkhamidov", "from": "Dept. of Computer Science, San Jose State University, San Jose, United States"}, {"name": "Diego Cruz", "from": "Dept. of Computer Science, San Jose State University, San Jose, United States"}, {"name": "Diego Garcia-Carrasco", "from": "Dept. of Computer Science, San Jose State University, San Jose, United States"}, {"name": "Spartak Gevorgyan", "from": "Dept. of Computer Science, San Jose State University, San Jose, United States"}, {"name": "Faramarz Mortezaie", "from": "Dept. of Engineering, San Jose State University, San Jose, United States"}], "IEEE keywords": ["Software design", "Ecosystems", "Smart homes", "Cameras", "Software", "Motion detection", "Mobile applications"], "Author Keywords": ["DIY", "Home Security", "Microcontroller", "Open-Source", "LaTeX"]}