{"Title": "Overview on Credit Card Authentication System", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/IC3IoT60841.2024.10550241", "Date of Publication": "17-18 April 2024", "abstract": "Integration of biometric authentication, dynamic CVV, and Machine Learning Model Having the capacity to enhance the security of financial transaction systems. The recommended method is to employ biometric identifying techniques, such fingerprint scanning, for user authentication. Before transmitting the transaction data via JSON to a backend API, the recommended method encrypts it. To find any possible suspicious activity, it is advised to evaluate transaction data using a machine learning model that is part of the backend API. It is advised to steer clear of any transaction that the machine learning algorithm flags as fraudulent. In the event that the machine learning model finds no evidence of fraudulent activity, processing the transaction is the advised course of action. Installing a dynamic CVV system is one technique to potentially increase security. By creating a new CVV for each transaction completed using this approach, fraudsters would find it far more difficult to reuse stolen card data. One proposed fix for the system is blockchain technology, which would provide a safe and transparent ledger to store records of every transaction. By strengthening transaction record security, the recommended fix would make it more difficult for fraudsters to modify or alter them.", "Published in": [{"name": "2024 International Conference on Communication, Computing and Internet of Things (IC3IoT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550185/proceeding"}], "Authors": [{"name": "G Adiline Macriga", "from": "Department of Information Technology, Sri Sairam Engineering College, Chennai"}, {"name": "V. Uma Sankari", "from": "Department of Information Technology, Sri Sairam Engineering College, Chennai"}, {"name": "M A Kishore", "from": "Department of Information Technology, Sri Sairam Engineering College, Chennai"}, {"name": "D Roshin", "from": "Department of Information Technology, Sri Sairam Engineering College, Chennai"}], "IEEE keywords": ["Training", "Machine learning algorithms", "Biological system modeling", "Authentication", "Credit cards", "Telecommunication computing", "Internet of Things"], "Author Keywords": ["Random Forest", "RFID", "Optimised Light Gradient", "Feature Selection", "Authentication", "Address Verification System"]}