{"Title": "Shaping the Future of Mobile Edge Computing with Innovative Architectures and Designs for Web3.0 over 5G/6G Networks", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/CSNT60213.2024.10545956", "Date of Publication": "06-07 April 2024", "abstract": "Web3.0 apps, with their emphasis on decentralization, real-time processing, and low latency, hold the key to MEC's bright future. This calls for an all-encompassing, future-oriented strategy in MEC architecture and design. The suggested technique is a multi-stage strategy for molding the future of MEC via cutting-edge architectures and designs for Web3.0 over 5G/6G networks. In the first stage, you'll examine the needs and goals of Web3.0 in detail. Real-time, lowlatency interactions are essential, as is familiarity with the dynamics of distributed apps and blockchain technology. In the second stage, we examine the current MEC setup, from edge server dispersion to data center density to network topology. The technique takes use of the low latency, high throughput, and huge device connection offered by 5G and impending 6G networks to guarantee preparedness for the future. The suggested technique is based on novel building layouts as its foundation. Latency, throughput, resource usage, scalability, and security compliance are only few of the metrics that may be evaluated to guarantee that the design is effective. The difficulties of actual deployment are also discussed; they include issues like where to put edge servers and how to scale resources according to demand. To ensure that the process remains in step with developing technologies and user preferences, it is recommended that improvements be made in a series of iterations.", "Published in": [{"name": "2024 IEEE 13th International Conference on Communication Systems and Network Technologies (CSNT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10545643/proceeding"}], "Authors": [{"name": "Ashwini Malviya", "from": "Department of uGDX, ATLAS SkillTech University, Mumbai, Maharashtra, India"}, {"name": "Chandra Prakash Lora", "from": "Department of Chemistry, Vivekananda Global University, Jaipur, India"}, {"name": "A Kannagi", "from": "Department of Computer Science and Information Technology, Jain (Deemed to be University), Bangalore, India"}], "IEEE keywords": ["Heuristic algorithms", "Computer architecture", "Throughput", "Real-time systems", "User experience", "Blockchains", "Servers"], "Author Keywords": ["5G", "6G", "Adaptive", "Blockchain", "Caching", "Edge Computing", "Innovative Architectures", "Latency", "Mobile Edge Computing", "Performance Evaluation", "Resource Allocation", "Scalability", "Security", "Web3.0", "Resource Utilization"]}