{"Title": "Information-based Infrastructure in Support of Autonomous UAV Reconnaissance Missions", "Pages": null, "Cites in Papers": 0, "Cites in Patents": 0, "Full Text Views": 0, "Publisher": "IEEE", "DOI": "10.1109/ICNS60906.2024.10550489", "Date of Publication": "23-25 April 2024", "abstract": "In this paper, we investigate mechanisms to provide information-based support for successful surveillance and recon-naissance missions, especially in the context of a coalition of autonomous organizations deploying UAVs. Our goal is to identify and address technical challenges in providing such informational support. To this end, as an illustration, we provide a description of a rescue and search mission scenario involving a swarm of UAVs and identify the challenges in carrying out such a coordinated mission. We then formalize five key challenges and propose solutions for the same. An infrastructure, including blockchains, smart contracts, satellite communication, and ground controllers, is proposed. The relevance of keeping track of any rogue UAVs is emphasized and a possible reputation system applicable to either individual UAVs or the coalition members is identified. To improve scalability and enhance fault tolerance, four types of configurations of the UAVs in a swarm are discussed. Finally, the use of machine learning tools to enhance mission success in a swarm environment is also discussed.", "Published in": [{"name": "2024 Integrated Communications, Navigation and Surveillance Conference (ICNS)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10550189/proceeding"}], "Authors": [{"name": "Meshari Aljohani", "from": "Department of Computer Science, Old Dominion University"}, {"name": "Ravi Mukkamala", "from": "Department of Computer Science, Old Dominion University"}, {"name": "Stephan Olariu", "from": "Department of Computer Science, Old Dominion University"}], "IEEE keywords": ["Fault tolerance", "Base stations", "Surveillance", "Scalability", "Smart contracts", "Fault tolerant systems", "Organizations"], "Author Keywords": ["Autonomous", "Blockchain", "Fault-tolerance", "Infrastructure", "Reconnaissance", "Scalability", "Smart contract", "UAV swarm"]}