{"Title": "Demo Paper: Anonymous Authentication on Trust in Blockchain-Based Mobile Crowdsourcing System", "Pages": null, "Cites in Papers": 73, "Cites in Patents": 0, "Full Text Views": 73, "Publisher": "IEEE", "DOI": "10.1109/Blockchain60715.2023.00032", "Date of Publication": "17-21 December 2023", "abstract": "This paper presents a demonstration of anonymous authentication on trust within a blockchain-based Mobile Crowdsourcing System (MCS). MCS has gained substantial attention from both academic and industrial sectors as an effective method for data collection. Nevertheless, traditional MCS heavily relies on third parties to maintain system operations, which may lead to single-point failures and incur serious privacy concerns. The introduction of blockchain technology offers the potential to get rid of the third-party intermediaries. However, the inherent decentralized and transparent nature of blockchain also brings in new challenges related to privacy and trust. A critical challenge in the context of blockchain-based MCS is achieving anonymous authentication on trust. Despite the typical conflict between trust evaluation and anonymity, ensuring anonymity is a crucial privacy prerequisite for MCS, while trust plays a pivotal role in various MCS activities such as task selection and truth determination. In this paper, we present a demonstration of a novel blockchain-based MCS that provides a secure and efficient crowdsourcing platform for fair and effective allocation of tasks. Notably, we leverage Intel Software Guard Extensions (SGX) to achieve anonymous authentication within a decentralized environment. Through the implementation of a decentralized trust evaluation approach, our system enables accurate trust assessment.", "Published in": [{"name": "2023 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10411431/proceeding"}], "Authors": [{"name": "Guocang Liu", "from": "School of Cyber Engineering, Xidian University, Xi’an, China"}, {"name": "Haoxiang Han", "from": "School of Cyber Engineering, Xidian University, Xi’an, China"}, {"name": "Wenxiu Ding", "from": "School of Cyber Engineering, Xidian University, Xi’an, China"}, {"name": "Shufan Fei", "from": "School of Cyber Engineering, Xidian University, Xi’an, China"}, {"name": "Zheng Yan", "from": "School of Cyber Engineering, Xidian University, Xi’an, China"}], "IEEE keywords": ["Crowdsourcing", "Privacy", "Authentication", "Blockchains", "Peer-to-peer computing", "Resource management", "Task analysis"], "Author Keywords": ["blockchain", "anonymous authentication", "Intel SGX", "trust evaluation"]}