{"Title": "Design and Application of Product Traceability Blockchain-based Platform", "Pages": null, "Cites in Papers": 2, "Cites in Patents": 0, "Full Text Views": 554, "Publisher": "IEEE", "DOI": "10.1109/SmartBlock52591.2020.00030", "Date of Publication": "23-25 October 2020", "abstract": "Product traceability is an effective technical solution to control and address product quality and safety issues, enabling consumers to fully know the full range of aspects of product flow. At present, the mainstream product traceability platform has the risk of system centralization, data being maliciously altered or destroyed. Blockchain can be effectively used in the supply chains to solve the above problems. The platform suitable for traceability system application based on Hyperledger Fabric was selected, designed a product traceability technical solution and a product traceability system solution prototype. The program content includes product traceability business requirements, architecture of traceability system, blockchain data storage scheme, transaction method and consensus mechanism, inquiry of traceability result etc. The platform of the product traceability blockchain based system in experimental environment is built and the query and verification process of the traceability on the blockchain traceability system is realized and tested, which proves the feasibility of the system.", "Published in": [{"name": "2020 3rd International Conference on Smart BlockChain (SmartBlock)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9415621/proceeding"}], "Authors": [{"name": "Yu Zhang", "from": "Faculty of Information Technology, Beijing University of Technology, Beijing, China"}, {"name": "Menglu Jin", "from": "College of Information Science and Technology, Zhengzhou Normal University, Zhengzhou, China"}, {"name": "Guiping Zheng", "from": "Faculty of Information Technology, Beijing University of Technology, Beijing, China"}, {"name": "Hu Li", "from": "College of Information Science and Technology, Zhengzhou Normal University, Zhengzhou, China"}], "IEEE keywords": ["Supply chain management", "Distributed ledger", "Supply chains", "Smart contracts", "Blockchain", "Product design", "Fabrics"], "Author Keywords": ["Product traceability", "Blockchain", "Decentralized systems", "Blockchain network", "Hyperledger Fabric", "System architecture"]}