{"Title": "Application of data storage management system in blockchain-based technology", "Pages": null, "Cites in Papers": 2, "Cites in Patents": 0, "Full Text Views": 695, "Publisher": "IEEE", "DOI": "10.1109/EEBDA56825.2023.10090564", "Date of Publication": "24-26 February 2023", "abstract": "The currently researched trusted data storage encryption methods for metering assets store too little data and have long encryption time delays. In order to solve the above problems, the trusted data storage encryption method for metering assets based on blockchain technology is proposed. blockchain technology can carry out the underlying network data support for the trusted data storage encryption of metering assets, and its data validation technology can be used for metering asset data block processing, and the data analysis is used to achieve storage encryption by comparing and validating the asset measurement results in the Ethernet virtual contract through each node within the blockchain node zone. This paper mainly applies blockchain technology in data storage management system, briefly analyzes the underlying logic of blockchain technology and its application in data storage management system, the core of the system is the storage of information and data, with features such as \"unforgeable\", \"traceable\", \"open and transparent\" and \"collective maintenance\". The core of the system is the storage of information and data, with features such as \"unforgeable\", \"traceable\", \"open and transparent\", \"collective maintenance\", etc. Finally, we show the application results of the technology in the system.", "Published in": [{"name": "2023 IEEE 2nd International Conference on Electrical Engineering, Big Data and Algorithms (EEBDA)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10090478/proceeding"}], "Authors": [{"name": "Xinyan Wang", "from": "State Grid Henan Information & Telecommunication Company (Data Center), Zhengzhou, China"}, {"name": "Jingli Jia", "from": "State Grid Henan Information & Telecommunication Company (Data Center), Zhengzhou, China"}, {"name": "Yuke Cao", "from": "Macau University of Science and Technology, Macau, China"}, {"name": "Jiacheng Du", "from": "State Grid Henan Information & Telecommunication Company (Data Center), Zhengzhou, China"}, {"name": "An Hu", "from": "State Grid Henan Information & Telecommunication Company (Data Center), Zhengzhou, China"}, {"name": "Yong Liu", "from": "State Grid Henan Information & Telecommunication Company (Data Center), Zhengzhou, China"}, {"name": "Zhiyong Wang", "from": "State Grid Blockchain Technology (Beijing) Co., Ltd., Beijing, China"}], "IEEE keywords": ["Electrical engineering", "Delay effects", "Memory", "Information sharing", "Ethernet", "Maintenance engineering", "Blockchains"], "Author Keywords": ["Blockchain technology", "data", "storage", "management"]}