{"Title": "Performance Analysis of a Hyperledger Iroha Blockchain Framework Used in the UK Livestock Industry", "Pages": null, "Cites in Papers": 3, "Cites in Patents": 0, "Full Text Views": 389, "Publisher": "IEEE", "DOI": "10.1109/Blockchain53845.2021.00070", "Date of Publication": "06-08 December 2021", "abstract": "This investigation focuses on the performance analysis of one of the most nascent Blockchain frameworks, Hyperledger Iroha. This paper evaluates the performance of the Hyperledger Iroha framework based on three parameters: (a) total requests per seconds (RPS) over time; (b) response times in milliseconds over time; and (c) number of users in the network over time. The results indicate that the integration of Hyperledger Iroha with a major livestock management and trading platform in the UK, can support at least 200 participants with no errors in the network. Additionally, the total requests per second can reach as high as 40.6, and the response times are in the order of a fraction of a second. This research and its results can assist scholars and practitioners regarding selection of an ideal Blockchain framework for their problem setting.", "Published in": [{"name": "2021 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9680465/proceeding"}], "Authors": [{"name": "Konstantinos Ntolkeras", "from": "Blockchain Department, Breedr Ltd, London, UK"}, {"name": "Hossein Sharif", "from": "Newcastle Business School Northumbria University, Newcastle upon Tyne, UK"}, {"name": "Soroush Dehghan Salmasi", "from": "Newcastle Business School Northumbria University, Newcastle upon Tyne, UK"}, {"name": "William Knottenbelt", "from": "Department of Computing, Imperial College London, London, UK"}], "IEEE keywords": ["Distributed ledger", "Conferences", "Agriculture", "Blockchains", "Performance analysis", "Time factors"], "Author Keywords": ["Blockchain", "Supply Chain Management", "Livestock Industry", "Hyperledger Iroha", "Response Time", "Scalability"]}