{"Title": "Testbed Design and Performance Analysis for Multilayer Blockchains", "Pages": null, "Cites in Papers": 450, "Cites in Patents": 0, "Full Text Views": 450, "Publisher": "IEEE", "DOI": "10.1109/ICBC51069.2021.9461103", "Date of Publication": "03-06 May 2021", "abstract": "Both the number of blockchains and the discovered number of applications of blockchain are ever-increasing. Understanding how different blockchains compare in performance has become more important than ever, yet each blockchian paper uses its own inconsistent standards for performance analysis. There are few mechanisms that may allow for consistent performance analysis among multiple blockchains. This paper details the implementation of the first-ever multi-layer blockchain parameter tuning system: Parameter Space Exploration. Our system is primarily targeted at the performance issue but also takes into consideration power consumption. Multi-layer blockchains use a permissioned blockchain to solve performance deficits. We find that the side chain is the determining factor for the performance of a multi-layer system; our side chain is chosen among a set of Byzantine Fault Tolerance (BFT) and Crash Fault Tolerance (CFT) based consensus algorithms as they are more energy-efficient and have higher performance than their Proof of Work (PoW) counterparts. Our proposed Parameter Space Exploration has two elements: (1) The concept of a parameter space; (2) A side-by-side benchmarking system for balanced comparison among different multi-layer blockchains and consensus algorithms.", "Published in": [{"name": "2021 IEEE International Conference on Blockchain and Cryptocurrency (ICBC)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9460986/proceeding"}], "Authors": [{"name": "De-Yi Tsai", "from": "Department of Computer Science & Information Engineering, National Taiwan University, Taiwan"}, {"name": "Seth Austin Harding", "from": "Department of Computer Science & Information Engineering, National Taiwan University, Taiwan"}, {"name": "Ming-Fong Sie", "from": "Department of Computer Science & Information Engineering, National Taiwan University, Taiwan"}, {"name": "Shih-wei Liao", "from": "Department of Computer Science & Information Engineering, National Taiwan University, Taiwan"}], "IEEE keywords": ["Fault tolerance", "Fault tolerant systems", "Blockchain", "Consensus algorithm", "Benchmark testing", "Nonhomogeneous media", "Energy efficiency"], "Author Keywords": ["Multi-layer Blockchain", "Parameter tuning", "Permissioned blockchain", "Byzantine Fault Tolerance (BFT)"]}