{"Title": "Blockchain based Secure and Effective Authentication Mechanism for 5G Networks", "Pages": null, "Cites in Papers": 347, "Cites in Patents": 0, "Full Text Views": 347, "Publisher": "IEEE", "DOI": "10.1109/ICBDS53701.2022.9936018", "Date of Publication": "16-18 September 2022", "abstract": "5G technology's rapid development revolutionized the field of cellular networks by providing higher data rate up to 10 Gbit/s using millimetre waves. Though 5G network can carry huge data with a higher speed than 4G, it can cover only a shorter province, around 1000 feet which is not even 2% of 4G's coverage. Numerous 5G cell towers and antennas are required to ensure reliable 5G signal and connectivity. This resulted in frequent and increased authentication when User Equipment (UE) moves between cells. Therefore, there is a critical need for a fast and frequent authentication mechanism. Though existing 4G authentication protocols can be adopted for 5G, they can only satisfy the basic requirements on the security front but cannot handle frequent authentications effectively. Blockchain technology with the features such as security, anonymity, immutability and transparency has been considered a promising technology to evade redundant authentications. Therefore, an effective and secure authentication scheme by completely utilizing features of Blockchain technology has been proposed in this paper. The proposed methodology works in two steps, the first by the introduction of a novel optimized authentication specific consensus algorithm for improving the Authentication Rate. Second, the reduction of the authentication by utilizing the authentication results stored in UE-AP Blockchain aiming to handle the redundant authentications.", "Published in": [{"name": "2022 IEEE International Conference on Blockchain and Distributed Systems Security (ICBDS)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9935826/proceeding"}], "Authors": [{"name": "R Bala", "from": "Dept. of Computer Science and Engineering, Puducherry Technological University, Puducherry"}, {"name": "R Manoharan", "from": "Dept. of Computer Science and Engineering, Puducherry Technological University, Puducherry"}], "IEEE keywords": ["Protocols", "5G mobile communication", "Poles and towers", "Authentication", "Consensus algorithm", "Throughput", "Blockchains"], "Author Keywords": ["Authentication", "Blockchain", "Consensus", "Hyperledger", "Anonymity", "Immutability", "Transparency"]}