{"Title": "A Survey on Safety Regulation Technology of Blockchain Application and Blockchain Ecology", "Pages": null, "Cites in Papers": 13, "Cites in Patents": 0, "Full Text Views": 1855, "Publisher": "IEEE", "DOI": "10.1109/Blockchain55522.2022.00076", "Date of Publication": "22-25 August 2022", "abstract": "Blockchain's technological characteristics, such as decentralization, robustness, and anti-modification, represent a significant challenge to the regulation of existing networks and data security. Effective regulation of blockchain applications is one of the keys to maintain the healthy and sustainable development of the blockchain ecology. We analyze the merits and demerits of the existing technologies in the research directions of tracking and visualization of blockchain nodes, consortium blockchain penetration regulation technology, public chain active discovery and exploration disposition techniques, and chain governance. In the end, we present the future research directions in respect of blockchain traceability and compliance regulation.", "Published in": [{"name": "2022 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9881788/proceeding"}], "Authors": [{"name": "Pengxu Shen", "from": "School of Cyberspace Security, Hainan University, Haikou, China"}, {"name": "Suozai Li", "from": "China Electronics Corporation, Hainan Joint Innovation Research Institute Co. Ltd, Chengmai, China"}, {"name": "Ming Huang", "from": "China Electronics Corporation, Hainan Joint Innovation Research Institute Co. Ltd, Chengmai, China"}, {"name": "Haoyu Gao", "from": "College of Data Science and Application, Inner Mongolia University of Technology, Hohhot, China"}, {"name": "Leixiao Li", "from": "College of Data Science and Application, Inner Mongolia University of Technology, Hohhot, China"}, {"name": "Jun Li", "from": "School of Cyberspace Security, Hainan University, Oxford-Hainan Blockchain Research Institute, Chengmai, China"}, {"name": "Hong Lei", "from": "School of Cyberspace Security, Hainan University, SSC Holding Company Ltd, Chengmai, China"}], "IEEE keywords": ["Analytical models", "Codes", "Statistical analysis", "Biological system modeling", "Regulation", "Ecology", "Data models"], "Author Keywords": ["blockchain ecology", "regulatory technology", "blockchain traceability", "compliance regulation"]}