{"Title": "An Efficient Double-Layer Blockchain Method for Vaccine Production Supervision", "Pages": null, "Cites in Papers": 37, "Cites in Patents": 0, "Full Text Views": 1214, "Publisher": "IEEE", "DOI": "10.1109/TNB.2020.2999637", "Date of Publication": "03 June 2020", "abstract": "A vaccine is a biological product which is an important means for human beings to protect themselves. Most of its users are young children with weak immunity. Once a vaccine has a problem, it will pose a serious threat to the lives of many people. At present, the supervision of vaccine production is very simple. The vaccine production record is completely controlled by the enterprises. Enterprises only submit production records to the supervisory agency for review when the vaccine needs to be sold. Production records are easily forged and modified. In order to solve the shortcomings of traditional centralized management. We propose a supervision method for vaccine production based on double-level blockchain. At first, we have designed a double-level blockchain structure. The first level is private data of vaccine prduction enterprise, including production records and corresponding hash. The next level is public data, including production records hash and vaccine information. In this way, we make vaccine enterprise to submit production records in a timely manner without fear of privacy leaks. We avoid enterprise tampering or falsification of production records through the non-tampering features and time stamps of the blockchain. To improve the time efficiency, we propose a consensus mechanism for multi-node cooperate. The primary supervisory node provides sorting services and verifies the correctness of the blockchain replica. The ordinary supervisory node can replace the primary supervisory node when necessary, and help the primary supervisory node recovers data in case of information loss. The review node is responsible for providing complete and correct blockchain copies for other nodes. So we can avoids the problem of waste of time resources in the traditional blockchain system. In addition, in order to avoid the waste of space caused by the redundancy of the blockchain, we propose a vaccine data cutting mechanism. We use the timestamp of the blockchain and the v...", "Published in": [{"name": "IEEE Transactions on NanoBioscience", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7728"}], "Authors": [{"name": "Shaoliang Peng", "from": "College of Computer Science and Electronic Engineering, Hunan University, Changsha, China"}, {"name": "Xing Hu", "from": "College of Computer Science and Electronic Engineering, Hunan University, Changsha, China"}, {"name": "Jinglin Zhang", "from": "Key Laboratory of Meteorological Disaster, Ministry of Education, Nanjing University of Information Science and Technology, Nanjing, China"}, {"name": "Xiaolan Xie", "from": "College of Information Science and Engineering, Guilin University of Technology, Guilin, China"}, {"name": "Chengnian Long", "from": "Department of Automation, Shanghai Jiao Tong University, Shanghai, China"}, {"name": "Zhihui Tian", "from": "Smart City Research Institute, Zhengzhou University, Zhengzhou, China"}, {"name": "Hongbo Jiang", "from": "College of Computer Science and Electronic Engineering, Hunan University, Changsha, China"}], "IEEE keywords": ["Vaccines", "Blockchain", "Production", "Safety", "Drugs", "Peer-to-peer computing", "Bitcoin"], "Author Keywords": ["Vaccine", "production", "supervision", "blockchain"]}