{"Title": "Blockchain-Based Charging Coordination Mechanism for Smart Grid Energy Storage Units", "Pages": null, "Cites in Papers": 55, "Cites in Patents": 0, "Full Text Views": 1658, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00076", "Date of Publication": "14-17 July 2019", "abstract": "Energy storage units (ESUs) enable several attractive features of modern smart grids such as enhanced grid resilience, effective demand response, and reduced bills. However, uncoordinated charging of ESUs stresses the power system and can lead to a blackout. In this paper, we leverage the blockchain and smart contracts to build a decentralized charging coordination mechanism without the need for a centralized charging coordinator. First ESUs should use tokens for anonymously authenticate themselves to the blockchain. Then each ESU sends a charging request that contains its State-of-Charge (SoC), Time-to-complete-charge (TCC) and amount of required charging to the smart contract address on the blockchain. The smart contract will then run the charging coordination mechanism in a self-executed manner such that ESUs with the highest priorities are charged in the present time slot while charging requests of lower priority ESUs are deferred to future time slots. In this way, each ESU can make sure that charging schedules are computed correctly. Finally, we have implemented the proposed mechanism on the Ethereum test-bed blockchain, and our analysis shows that execution cost can be acceptable in terms of gas consumption while enabling decentralized charging coordination with increased transparency, reliability, and privacy preserving.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Mohamed Baza", "from": "Department of Electrical and Computer Engineering, Tennessee Tech University, Cookeville, TN, USA"}, {"name": "Mahmoud Nabil", "from": "Department of Electrical and Computer Engineering, Tennessee Tech University, Cookeville, TN, USA"}, {"name": "Muhammad Ismail", "from": "Electrical and Computer Engineering, Texas A&M University at Qatar, Doha, Qatar"}, {"name": "Mohamed Mahmoud", "from": "Department of Electrical and Computer Engineering, Tennessee Tech University, Cookeville, TN, USA"}, {"name": "Erchin Serpedin", "from": "Electrical and Computer Engineering, Texas A&M University at Qatar, Doha, Qatar"}, {"name": "Mohammad Ashiqur Rahman", "from": "Department of Electrical and Computer Engineering, Florida International University, Miami, FL, USA"}], "IEEE keywords": ["Blockchain", "Smart contracts", "Schedules", "Batteries", "Load modeling", "Privacy"], "Author Keywords": ["Blockchain", "charging", "Smart grid", "Decentralized system", "Privacy-preservation", "Energy storage units"]}