{"Title": "Multi-Level Distributed Caching on the Blockchain for Storage Optimisation", "Pages": null, "Cites in Papers": 6, "Cites in Patents": 0, "Full Text Views": 581, "Publisher": "IEEE", "DOI": "10.1109/ICBC54727.2022.9805518", "Date of Publication": "02-05 May 2022", "abstract": "Blockchain has attracted considerable attention as a solution to the challenges of privacy, security and decentralisation for many applications. However, these characteristics of the blockchain result in ever growing ledger size, which is one of the major barriers to blockchain adoption in large-scale networks such as the Internet of Things (IoT). In this paper, we propose Multi-Level Distributed Caching (MLDC) for blockchain storage optimisation which reduces data replication based on data access pattern. MLDC divides nodes into storage classes (SCs) by their node availability, and assigns each SC a different Access Frequency (AF) to remove data from the local storage. Over time, each node only stores frequently accessed data, so MLDC can reduce the total storage cost by 83% compared to conventional blockchain systems, while maintaining blockchain consistency and data availability with a slight increase in network overhead and data query delay.", "Published in": [{"name": "2022 IEEE International Conference on Blockchain and Cryptocurrency (ICBC)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9805458/proceeding"}], "Authors": [{"name": "Jun Wook Heo", "from": "School of Computer Science Queensland University of Technology, Brisbane, Australia"}, {"name": "Ali Dorri", "from": "School of Computer Science Queensland University of Technology, Brisbane, Australia"}, {"name": "Raja Jurdak", "from": "School of Computer Science Queensland University of Technology, Brisbane, Australia"}], "IEEE keywords": ["Privacy", "Costs", "Conferences", "Frequency conversion", "Blockchains", "Delays", "Cryptocurrency"], "Author Keywords": ["Blockchain", "Internet of Things (IoT)", "Storage optimisation", "Distributed caching"]}