{"Title": "Performance Analysis of a Hyperledger Fabric Blockchain Framework: Throughput, Latency and Scalability", "Pages": null, "Cites in Papers": 128, "Cites in Patents": 0, "Full Text Views": 6419, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00003", "Date of Publication": "14-17 July 2019", "abstract": "Focusing on one of the most popular open source blockchain frameworks-Hyperledger Fabric, this paper evaluates the impact of network workload on performance of a blockchain platform. In particular, the performance of the Hyperledger Fabric platform is evaluated in terms of: (a) throughput, i.e., successful transactions per second; (b) latency, i.e., response time per transaction in seconds; and (c) scalability, i.e., number of participants serviceable by the platform. The results indicate that the instance of Hyperledger Fabric platform being implemented can support up to 100,000 participants on the selected AWS EC2 instance. As long as the transaction rate is maintained within 200 transactions per seconds, the network latency is in the order of fraction of a second.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Murat Kuzlu", "from": "Electrical Engineering Technology, Old Dominion University, Norfolk, VA, USA"}, {"name": "Manisa Pipattanasomporn", "from": "Bradley Department of Electrical and Computer Engineering, Virginia Tech – Advanced Research Institute, Arlington, VA, USA"}, {"name": "Levent Gurses", "from": "Movel, Inc., Sterling, VA"}, {"name": "Saifur Rahman", "from": "Bradley Department of Electrical and Computer Engineering, Virginia Tech – Advanced Research Institute, Arlington, VA, USA"}], "IEEE keywords": ["Blockchain", "Distributed ledger", "Fabrics", "Throughput", "Scalability", "Benchmark testing", "Peer-to-peer computing"], "Author Keywords": ["Blockchain", "Hyperledger fabric", "throughput", "latency"]}