{"Title": "A Reputation Management Framework for Knowledge-Based and Probabilistic Blockchains", "Pages": null, "Cites in Papers": 19, "Cites in Patents": 0, "Full Text Views": 2616, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00078", "Date of Publication": "14-17 July 2019", "abstract": "Recently, leading research communities have been investigating the use of blockchains for Artificial Intelligence (AI) applications, where multiple participants, or agents, collaborate to make consensus decisions. To achieve this, the data in the blockchain storage have to be transformed into blockchain knowledge. We refer to these types of blockchains as knowledge-based blockchains. Knowledge-based blockchains are potentially useful in building efficient risk assessment applications. An earlier work introduced probabilistic blockchain which facilitates knowledge-based blockchains. This paper proposes an extension for the probabilistic blockchain concept. The design of a reputation management framework, suitable for such blockchains, is proposed. The framework has been developed to suit the requirements of a wide range of applications. In particular, we apply it to the detection of malicious nodes and reduce their effect on the probabilistic blockchains' consensus process. We evaluate the framework by comparing it to a baseline using several adversarial strategies. Further, we analyze the collaborative decisions with and without the malicious node detection. Both results show a sustainable performance, where the proposed work outperforms others and achieves excellent results.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Tara Salman", "from": "Dept. of Computer Science & Engineering, Washington University in St. Louis, St. Louis, USA"}, {"name": "Raj Jain", "from": "Dept. of Computer Science & Engineering, Washington University in St. Louis, St. Louis, USA"}, {"name": "Lav Gupta", "from": "Dept. of Math and Computer Science, University of Missouri, St. Louis, USA"}], "IEEE keywords": ["Blockchain", "Conferences"], "Author Keywords": ["blockchains, knowledge-based blockchains, probabilistic blockchains, reputation management framework, Rated Proportional Multi-Configurable Exponential Weighted Average, RPMC-EWA, malicious node detection"]}