{"Title": "Blockchain Implementation for Analysis of Carbon Footprint across Food Supply Chain", "Pages": null, "Cites in Papers": 29, "Cites in Patents": 0, "Full Text Views": 2496, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00079", "Date of Publication": "14-17 July 2019", "abstract": "The growing global population and the consequential increasing food demand have had a great impact on the environment and thus on the climate. Efforts are being made to reduce carbon footprint to mitigate such effects. Calculating the carbon footprint of food products is complex and requires the cooperation of all the stakeholders of the food supply chain. A record keeping system for tracking carbon footprint while preserving privacy for the related parties is needed. This paper presents a new implementation of blockchain for tracking of carbon footprint on food production and transportation stages. We designed a system that tracks the carbon footprint of food processing facilities and transportation parties using cluster-based record keeping while preserving their privacy. We implemented the proposed carbon footprint chain and evaluated its throughput and latency under different scenarios. We show that our blockchain implementation is capable of operating with a larger number of nodes without any scalability issues.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Denisolt Shakhbulatov", "from": "Department of Computer Science, New York Institute of Technology, New York, NY"}, {"name": "Arshit Arora", "from": "Department of Computer Science, New York Institute of Technology, New York, NY"}, {"name": "Ziqian Dong", "from": "Department of Electrical and Computer Engineering"}, {"name": "Roberto Rojas-Cessa", "from": "Department of Electrical and Computer Engineering, New Jersey Institute of Technology, Newark, NJ"}], "IEEE keywords": ["Blockchain", "Carbon footprint", "Transportation", "Peer-to-peer computing", "Consensus algorithm", "Supply chains", "Food products"], "Author Keywords": ["Food production, Carbon footprint, Life Cycle Assessment, Supply chain, Freight movement, Blockchain, RAFT, Consensus Algorithm"]}