{"Title": "Hybrid Blockchain Design for Privacy Preserving Crowdsourcing Platform", "Pages": null, "Cites in Papers": 22, "Cites in Patents": 0, "Full Text Views": 1775, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00013", "Date of Publication": "14-17 July 2019", "abstract": "Blockchain has been treated as one of the most promising technologies to promote crowdsourcing by providing new nice features, such as decentralization and accountability. Unfortunately, some inherent limitations of blockchain have been rarely addressed by the most existing works when applying blockchain into crowdsourcing, which becomes the performance bottleneck of crowdsourcing systems. In this paper, we propose a novel hybrid blockchain crowdsourcing platform to achieve decentralization and privacy preservation. Our platform integrates with a hybrid blockchain structure, dual-ledgers, and dual consensus algorithms to ensure secure communication between the requesters and the workers. Moreover, the smart contract and zero-knowledge proof are employed to ensure automatic operation of the tasks and the protection users' privacy, respectively. Finally, we conduct experiments to confirm the efficiency of the adopted consensus algorithm on our platform by comparing it with the state-of-the-art.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Saide Zhu", "from": "Department of Computer Science, Georgia State University, Atlanta, GA, USA"}, {"name": "Huafu Hu", "from": "Department of Computer Science, Georgia State University, Atlanta, GA, USA"}, {"name": "Yingshu Li", "from": "Department of Computer Science, Georgia State University, Atlanta, GA, USA"}, {"name": "Wei Li", "from": "Department of Computer Science, Georgia State University, Atlanta, GA, USA"}], "IEEE keywords": ["Blockchain", "Crowdsourcing", "Peer-to-peer computing", "Smart contracts", "Privacy", "Task analysis", "Energy consumption"], "Author Keywords": ["hybrid blockchain", "crowdsourcing", "smart contract", "privacy preservation"]}