{"Title": "Fair Work Distribution on Permissioned Blockchains: a Mobile Window Based Approach", "Pages": null, "Cites in Papers": 2, "Cites in Patents": 0, "Full Text Views": 177, "Publisher": "IEEE", "DOI": "10.1109/Blockchain50366.2020.00063", "Date of Publication": "02-06 November 2020", "abstract": "In permissioned blockchains, a set of identifiable miners are in charge of consolidating the new blocks. The agreement protocol is usually based on a consensus mechanism inspired by a voting Byzantine Fault Tolerance (BFT) mechanism rather than the well-known proof-of-work (PoW). However, PoW provides some benefits with respect to BFT, i.e., it allows the final user to quantify the effort required to change a consolidated transaction without the need of trusting the consortium of miners. In this paper, we address some of the problems that arise from the application of PoW in permissioned blockchains. In fact, in standard PoW, it may be easy for one miner to temporary reach 50% of the total hash power and since mining rewards are usually not expected, the problem of balancing the efforts of the miner becomes crucial. We propose a simple solution based on a sliding window algorithm to address these problems and analyse its effectiveness in terms of security. Additionally, we propose a quantitative model whose solution allows us to assess its capacity of balancing the hash power provided by heterogeneous miners.", "Published in": [{"name": "2020 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9284404/proceeding"}], "Authors": [{"name": "Ivan Malakhov", "from": "Università Ca’ Foscari Venezia, DAIS, Venice, Italy"}, {"name": "Andrea Marin", "from": "Università Ca’ Foscari Venezia, DAIS, Venice, Italy"}, {"name": "Sabina Rossi", "from": "Università Ca’ Foscari Venezia, DAIS, Venice, Italy"}, {"name": "Daria Smuseva", "from": "Università Ca’ Foscari Venezia, DAIS, Venice, Italy"}], "IEEE keywords": ["Protocols", "Statistical analysis", "Fault tolerant systems", "Process control", "Blockchain", "Security", "Standards"], "Author Keywords": ["permissioned blockchain", "fairness", "Markov models"]}