{"Title": "Research and Implementation on the Operation and Transaction System Based on Blockchain Technology for Virtual Power Plant", "Pages": null, "Cites in Papers": 7, "Cites in Patents": 0, "Full Text Views": 1630, "Publisher": "IEEE", "DOI": "10.1109/ICBCTIS55569.2022.00046", "Date of Publication": "15-17 July 2022", "abstract": "Virtual power plants are among the promising ways that variable generation and flexible demand may be optimally balanced in the future. The virtual power plant is an important branch of the energy internet, and it plays an important role in the aggregation of distributed power generation resources and the establishment of virtual power resource transactions. However, in the existing virtual power plant model, the following problems are becoming increasingly prominent, such as safeguard, credit rating system, privacy protection, benefit distribution. Firstly, the operation and transaction mechanism of the virtual power plant was introduced. Then, the blockchain technology is introduced into the virtual power plant transaction to make it more conducive to the information transparent, stable dispatch system, data security, and storage security. Finally, the operation and transaction system based on blockchain technology for the virtual power plant was design.", "Published in": [{"name": "2022 International Conference on Blockchain Technology and Information Security (ICBCTIS)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9844748/proceeding"}], "Authors": [{"name": "Da Li", "from": "State Grid E-Commerce Co., Ltd., Beijing, China"}, {"name": "Qinglei Guo", "from": "State Grid E-Commerce Co., Ltd., Beijing, China"}, {"name": "Desheng Bai", "from": "State Grid E-Commerce Co., Ltd., Beijing, China"}, {"name": "Wei Zhang", "from": "Changzhou Power Supply Company, State Grid Jiangsu Electric Power Co., Ltd., Changzhou, China"}], "IEEE keywords": ["Data privacy", "Data security", "Smart contracts", "Virtual power plants", "Data collection", "Blockchains", "Sensors"], "Author Keywords": ["virtual power plant", "blockchain", "transaction system"]}