{"Title": "Bow-tie structure of the Polkadot transfer network", "Pages": null, "Cites in Papers": 164, "Cites in Patents": 0, "Full Text Views": 164, "Publisher": "IEEE", "DOI": "10.1109/ICBC56567.2023.10174939", "Date of Publication": "01-05 May 2023", "abstract": "While there are many data collection and analysis tools for Ethereum - the largest smart contract blockchain by market capitalization, development of similar tools for other smart contract blockchains is lacking. Reasons for this are non-existent standards, changing specifications d ue t o rapid development, common usage of the off-chain storage, and lack of developers. One of such blockchains is Polkadot - a layer- zero blockchain featuring a single relay chain whose role is to secure smart contract transactions on multiple other parachains. In this paper we describe a data collection pipeline for Polkadot blockchain that we then use to perform an analysis of the bow-tie structure of its transfer network over time, with special emphasis on the role of nominators and validators in this structure. We find evidence that t he Polkadot ecosystem iss lowly maturing from a system dominated by nominators and validators, both of which require some technical skill as well as willingness to bond sufficient amount of funds, into a system increasingly populated by regular users using the financial services of Polkadot.", "Published in": [{"name": "2023 IEEE International Conference on Blockchain and Cryptocurrency (ICBC)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10174862/proceeding"}], "Authors": [{"name": "Matija Piskorec", "from": "Blockchain and Distributed Ledger Technologies Group, University of Zurich, Zurich, Switzerland"}, {"name": "Ben Domenic James Murphy", "from": "University of Zurich, Zurich, Switzerland"}, {"name": "Florian Rüegsegger", "from": "University of Zurich, Zurich, Switzerland"}, {"name": "Sina Rafati Niya", "from": "Blockchain and Distributed Ledger Technologies Group, University of Zurich, Zurich, Switzerland"}, {"name": "Claudio J. Tessone", "from": "Blockchain and Distributed Ledger Technologies Group, University of Zurich, Zurich, Switzerland"}], "IEEE keywords": ["Economics", "Ecosystems", "Smart contracts", "Pipelines", "Network analyzers", "Data collection", "Blockchains"], "Author Keywords": ["Polkadot", "Proof-of-Stake", "blockchain data collection", "transfer network", "bow-tie network structure"]}