{"Title": "A Privacy-Aware PKI System Based on Permissioned Blockchains", "Pages": null, "Cites in Papers": 22, "Cites in Patents": 2, "Full Text Views": 3467, "Publisher": "IEEE", "DOI": "10.1109/ICSESS.2018.8663738", "Date of Publication": "23-25 November 2018", "abstract": "Public key infrastructure (PKI) is the foundation and core of network security construction. Blockchain (BC) has many technical characteristics, such as decentralization, impossibility of being tampered with and forged, which makes it have incomparable advantages in ensuring information credibility, security, traceability and other aspects of traditional technology. In this paper, a method of constructing PKI certificate system based on permissioned BC is proposed. The problems of multi-CA mutual trust, poor certificate configuration efficiency and single point failure in digital certificate system are solved by using the characteristics of BC distribution and non-tampering. At the same time, in order to solve the problem of identity privacy on BC, this paper proposes a privacy-aware PKI system based on permissioned BCs. This system is an anonymous digital certificate publishing scheme., which achieves the separation of user registration and authorization, and has the characteristics of anonymity and conditional traceability, so as to realize to protect user's identity privacy. The system meets the requirements of certificate security and anonymity, reduces the cost of CA construction, operation and maintenance in traditional PKI technology, and improves the efficiency of certificate application and configuration.", "Published in": [{"name": "2018 IEEE 9th International Conference on Software Engineering and Service Science (ICSESS)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8649692/proceeding"}], "Authors": [{"name": "Rong Wang", "from": "Digital Society & Blockchain Laboratory, Beihang University, Beijing, P. R. China"}, {"name": "Juan He", "from": "Digital Society & Blockchain Laboratory, Beihang University, Beijing, P. R. China"}, {"name": "Can Liu", "from": "Digital Society & Blockchain Laboratory, Beihang University, Beijing, P. R. China"}, {"name": "Qi Li", "from": "Digital Society & Blockchain Laboratory, Beihang University, Beijing, P. R. China"}, {"name": "Wei-Tek Tsai", "from": "Digital Society & Blockchain Laboratory, Beihang University, Beijing, P. R. China"}, {"name": "Enyan Deng", "from": "Beijing Tiande Technologies, Beijing, China"}], "IEEE keywords": ["Authentication", "Public key", "Organizations", "Blockchain", "Contracts"], "Author Keywords": ["component", "public-key infrastructure", "permissioned blockchains", "privacy-awareness", "security", "digital certificate"]}