{"Title": "A Voting-Based Blockchain Interoperability Oracle", "Pages": null, "Cites in Papers": 22, "Cites in Patents": 0, "Full Text Views": 1939, "Publisher": "IEEE", "DOI": "10.1109/Blockchain53845.2021.00030", "Date of Publication": "06-08 December 2021", "abstract": "Today's blockchain landscape is severely fragmented as more and more heterogeneous blockchain platforms have been developed in recent years. These blockchain platforms are not able to interact with each other or with the outside world since only little emphasis is placed on the interoperability between them. Already proposed solutions for blockchain interoperability such as naive relay or oracle solutions are usually not broadly applicable since they are either too expensive to operate or very resource-intensive. For that reason, we propose a blockchain interoperability oracle that follows a voting-based approach based on threshold signatures. The oracle nodes generate a distributed private key to execute an off-chain aggregation mechanism to collectively respond to requests. Compared to state-of-the-art relay schemes, our approach does not incur any ongoing costs and since the on-chain component only needs to verify a single signature, we can achieve remarkable cost savings compared to conventional oracle solutions.", "Published in": [{"name": "2021 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9680465/proceeding"}], "Authors": [{"name": "Michael Sober", "from": "Christian Doppler Laboratory for Blockchain Technologies for the Internet of Things"}, {"name": "Giulia Scaffino", "from": "Christian Doppler Laboratory for Blockchain Technologies for the Internet of Things"}, {"name": "Christof Spanring", "from": "Pantos GmbH, Vienna, Austria"}, {"name": "Stefan Schulte", "from": "Christian Doppler Laboratory for Blockchain Technologies for the Internet of Things"}], "IEEE keywords": ["Resistance", "Costs", "Conferences", "Public key", "Blockchains", "Relays", "Interoperability"], "Author Keywords": ["blockchain interoperability", "blockchain oracles", "threshold signature", "smart contracts"]}