{"Title": "A Hybrid Blockchain Architecture for Privacy-Enabled and Accountable Auctions", "Pages": null, "Cites in Papers": 32, "Cites in Patents": 0, "Full Text Views": 2769, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00014", "Date of Publication": "14-17 July 2019", "abstract": "Blockchain has recently emerged as an important tool that can enable critical distributed applications without requiring centralized trust. For example, public blockchains have been used to enable many different cryptocurrencies. Unfortunately, existing public blockchains and smart contracts deployed on them may disclose sensitive information. Although there is some ongoing work that leverage advanced cryptography to address some of these sensitive information leakage issues, they require significant changes to existing and popular blockchains such as Ethereum and are usually computationally expensive. On the other hand, private blockchains have been proposed to allow more efficient and privacy-preserving data sharing among pre-approved group of nodes/participants. Although private blockchains address some of the privacy challenges by allowing sensitive data to be only seen by the select group of participants, they do not allow public accountability of transactions since transactions are approved by known set of users, and cannot be accessed publicly. Given these observations, one natural question that arise is, can we leverage both public and private blockchain infrastructures to enable efficient, privacy enhancing and accountable applications? In this work, we try to address this challenge in the context of digital auctions. Mainly, we propose a novel hybrid blockchain architecture that combines private and public blockchains to allow sensitive bids to be opened on a private blockchain so that only the auctioneer can learn the bids, and no one else. At the same time, we leverage public blockchains to make the auction winner announcement, and payments accountable. Furthermore, using smart contracts deployed on public blockchain, we show how to incentivize truthful behavior among the auction participants. Our extensive empirical results show that this architecture is more efficient in terms of run time and monetary cost compared to pure public blockchain based aucti...", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Harsh Desai", "from": "School of Computer Science, The University of Texas, Dallas"}, {"name": "Murat Kantarcioglu", "from": "School of Computer Science, The University of Texas, Dallas"}, {"name": "Lalana Kagal", "from": "Computer Science and Artificial Intelligence Lab, Massachusetts Institute of Technology"}], "IEEE keywords": ["Blockchain", "Smart contracts", "Cryptography", "Privacy", "Computer architecture", "Data privacy"], "Author Keywords": ["Blockchain", "Auction", "Hybrid", "Privacy", "Security"]}