{"Title": "A Survey on Blockchain Technology: Evolution, Architecture and Security", "Pages": null, "Cites in Papers": 209, "Cites in Patents": 0, "Full Text Views": 24624, "Publisher": "IEEE", "DOI": "10.1109/ACCESS.2021.3072849", "Date of Publication": "13 April 2021", "abstract": "Blockchain is a revolutionary technology that is making a great impact on modern society due to its transparency, decentralization, and security properties. Blockchain gained considerable attention due to its very first application of Cryptocurrencies e.g., Bitcoin. In the near future, Blockchain technology is determined to transform the way we live, interact, and perform businesses. Recently, academics, industrialists, and researchers are aggressively investigating different aspects of Blockchain as an emerging technology. Unlike other Blockchain surveys focusing on either its applications, challenges, characteristics, or security, we present a comprehensive survey of Blockchain technology's evolution, architecture, development frameworks, and security issues. We also present a comparative analysis of frameworks, classification of consensus algorithms, and analysis of security risks & cryptographic primitives that have been used in the Blockchain so far. Finally, this paper elaborates on key future directions, novel use cases and open research challenges, which could be explored by researchers to make further advances in this field.", "Published in": [{"name": "IEEE Access", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6287639"}], "Authors": [{"name": "Muhammad Nasir Mumtaz Bhutta", "from": "Information Systems Department, College of Computer Sciences and Information Technology (CCSIT), King Faisal University, Al-Ahsa, Saudi Arabia"}, {"name": "Amir A. Khwaja", "from": "Information Systems Department, College of Computer Sciences and Information Technology (CCSIT), King Faisal University, Al-Ahsa, Saudi Arabia"}, {"name": "Adnan Nadeem", "from": "Faculty of Computer and Information System, Islamic University of Madinah, Medina, Saudi Arabia"}, {"name": "Hafiz Farooq Ahmad", "from": "Computer Science Department, College of Computer Sciences and Information Technology (CCSIT), King Faisal University, Al-Ahsa, Saudi Arabia"}, {"name": "Muhammad Khurram Khan", "from": "Center of Excellence in Information Assurance, King Saud University, Riyadh, Saudi Arabia"}, {"name": "Moataz A. Hanif", "from": "Security and Optimization for Networked Globe Laboratory (SONG lab), Embry-Riddle Aeronautical University, Prescott, AZ, USA"}, {"name": "Houbing Song", "from": "Security and Optimization for Networked Globe Laboratory (SONG lab), Embry-Riddle Aeronautical University, Prescott, AZ, USA"}, {"name": "Majed Alshamari", "from": "Information Systems Department, College of Computer Sciences and Information Technology (CCSIT), King Faisal University, Al-Ahsa, Saudi Arabia"}, {"name": "Yue Cao", "from": "School of Cyber Science and Engineering, Wuhan University, Wuhan, China"}], "IEEE keywords": ["Blockchain", "Security", "Cryptography", "Smart contracts", "Peer-to-peer computing", "Consensus algorithm", "Computer architecture"], "Author Keywords": ["Evolution of blockchain", "blockchain architecture", "smart contracts", "blockchain applications", "development frameworks", "blockchain security"]}