{"Title": "Research On Electricity Spot Market Trading System Based On Blockchain Technology", "Pages": null, "Cites in Papers": 74, "Cites in Patents": 0, "Full Text Views": 74, "Publisher": "IEEE", "DOI": "10.1109/CCSB60789.2023.10398820", "Date of Publication": "17-19 November 2023", "abstract": "With the construction of the new power system and the promotion of the reform of the power market system, the number of market transaction varieties and participants of all parties has increased sharply, especially the development of the electricity spot market has put forward higher requirements for building a fair, efficient, reliable and safe market transaction environment. In this regard, in view of the problems of weak multi-agent trust, poor autonomy and low synergy efficiency in the electricity spot market, the blockchain is used to build a safe, fair, reliable and efficient electricity spot trading environment. Through smart contract technology, the operation efficiency and rules of the electricity spot market are improved, and the sense of equity, autonomy and efficiency of market participants is enhanced, and the efficient operation of the market and green and low-carbon development are promoted.", "Published in": [{"name": "2023 3rd International Conference on Computer Science and Blockchain (CCSB)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10398737/proceeding"}], "Authors": [{"name": "Junwei Ma", "from": "State Grid Shanxi Electric Power Company Information Communication Branch, Taiyuan, China"}, {"name": "Jian Wu", "from": "State Grid Shanxi Electric Power Company Information Communication Branch, Taiyuan, China"}, {"name": "Weihua He", "from": "State Grid Shanxi Electric Power Company, Taiyuan, China"}, {"name": "Wenna Zhao", "from": "State Grid Shanxi Electric Power Company, Taiyuan, China"}, {"name": "Yitao Han", "from": "Shanxi Electric Power Trading Center Co., Ltd, Taiyuan, China"}, {"name": "Xiukui Pan", "from": "State Grid Blockchain Technology (Beijing) CO.LTD., Beijing, China"}, {"name": "Jingli Feng", "from": "State Grid Blockchain Technology (Beijing) CO.LTD., Beijing, China"}], "IEEE keywords": ["Supply and demand", "Volume measurement", "Smart contracts", "Time measurement", "Power system reliability", "Blockchains", "Reliability"], "Author Keywords": ["Blockchain", "electricity market", "smart contracts"]}