{"Title": "IDNat-Blockchain: A Concept for Indonesia's National Blockchain", "Pages": null, "Cites in Papers": 299, "Cites in Patents": 0, "Full Text Views": 299, "Publisher": "IEEE", "DOI": "10.1109/IC-ICTRuDev50538.2021.9656496", "Date of Publication": "27-28 October 2021", "abstract": "Blockchain gives a compelling way of making government administrations more effective, but standardizing the administration framework, forms and obligation for the application is vital for it to encourage advancement. This article, by giving an investigation of the hone of blockchain in e-government in Indonesia, may serve as an establishment for advance commonsense work and hypothetical investigation in government administrations. The purpose of this article is to propose a concept for the Indonesia's National Blockchain concept which fit to be implemented in Indonesia called IDN at-Blockchain which is derived into three blockchain; (1) IDGov-Blockchain, (2) IDVII-Blockchain, and (3) IDPub-Blockchain. Our research found that blockchain technology can bring the taking after benefits: (1) enhancements within the quality and amount of government administrations, (2) more noteworthy straightforwardness and openness of government data, (3) improvement of information-sharing over distinctive organizations, and (4) help in building a person credit framework in Indonesia. Be that as it may, data security, fetched, and unwavering quality are still major issues in the application. In this way, building up a common application stage of blockchain innovation and creating administration benchmarks are significant for advancing and applying blockchain in e-government.", "Published in": [{"name": "2021 2nd International Conference on ICT for Rural Development (IC-ICTRuDev)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9656491/proceeding"}], "Authors": [{"name": "Dea Saka Kurnia Putra", "from": "Directorate of Industrial Cybersecurity and Crypto, Deputy for Cybersecurity and Crypto of the Economy, National Cyber dan Crypto Agency, Depok City, West Java, Indonesia"}, {"name": "Antonius Alfari", "from": "Undergraduate Program of Cybersecurity Engineering, National Cyber dan Crypto Polytechnic, National Cyber and Crypto Agency Bogor, District, West Java, Indonesia"}], "IEEE keywords": ["Technological innovation", "Data security", "Buildings", "Standards organizations", "Benchmark testing", "Blockchains", "Electronic government"], "Author Keywords": ["IDNat-blockchain", "IDGov-blockchain", "IDVII-blockchain", "IDPub-blockchain", "blockchain technology", "Indonesia national blockchain concept"]}