{"Title": "Delay Analysis of Consensus Communication for Blockchain-Based Applications Using Network Calculus", "Pages": null, "Cites in Papers": 7, "Cites in Patents": 0, "Full Text Views": 1329, "Publisher": "IEEE", "DOI": "10.1109/LWC.2022.3183197", "Date of Publication": "15 June 2022", "abstract": "Blockchain has been witnessed a growing application in mobile communication. The application field ranges from the Internet of Things (IoT), Vehicle to Everything (V2X), Mobile Edge Computing (MEC), etc. The conjunction with blockchain can significantly avoid data tempering and protect user privacy. Although blockchain guarantees the security of mobile communication, the operation cost is increasing. The consensus algorithm of blockchain drives multiple untrust parties to keep data consistency, and it generates a large number of communication overheads. In this letter, we focus on the Byzantine Fault Tolerance (BFT) type of consensus and conduct a performance model. By utilizing the deterministic network calculus method, we analyze the delay bound of the Practical Byzantine Fault Tolerance (PBFT) and HotStuff consensus algorithm. The result of the simulation provides a valuable guideline for delay-sensitive blockchain-based applications.", "Published in": [{"name": "IEEE Wireless Communications Letters", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5962382"}], "Authors": [{"name": "Shengcheng Ma", "from": "School of Computer Science and Engineering, Beihang University, Beijing, China"}, {"name": "Shuai Wang", "from": "School of Computer Science and Engineering, Beihang University, Beijing, China"}, {"name": "Wei-Tek Tsai", "from": "School of Computer Science and Engineering, Digital Society and Blockchain Laboratory, Beihang University, Beijing, China"}], "IEEE keywords": ["Delays", "Blockchains", "Calculus", "Task analysis", "Complexity theory", "Peer-to-peer computing", "Mobile communication"], "Author Keywords": ["Blockchain", "PBFT", "HotStuff", "delay analysis", "network calculus"]}