{"Title": "Blockchain-Enabled Smart Contracts: Architecture, Applications, and Future Trends", "Pages": null, "Cites in Papers": 618, "Cites in Patents": 0, "Full Text Views": 20693, "Publisher": "IEEE", "DOI": "10.1109/TSMC.2019.2895123", "Date of Publication": "15 February 2019", "abstract": "In recent years, the rapid development of cryptocurrencies and their underlying blockchain technology has revived Szabo’s original idea of smart contracts, i.e., computer protocols that are designed to automatically facilitate, verify, and enforce the negotiation and implementation of digital contracts without central authorities. Smart contracts can find a wide spectrum of potential application scenarios in the digital economy and intelligent industries, including financial services, management, healthcare, and Internet of Things, among others, and also have been integrated into the mainstream blockchain-based development platforms, such as Ethereum and Hyperledger. However, smart contracts are still far from mature, and major technical challenges such as security and privacy issues are still awaiting further research efforts. For instance, the most notorious case might be “The DAO Attack” in June 2016, which led to more than $50 million Ether transferred into an adversary’s account. In this paper, we strive to present a systematic and comprehensive overview of blockchain-enabled smart contracts, aiming at stimulating further research toward this emerging research area. We first introduced the operating mechanism and mainstream platforms of blockchain-enabled smart contracts, and proposed a research framework for smart contracts based on a novel six-layer architecture. Second, both the technical and legal challenges, as well as the recent research progresses, are listed. Third, we presented several typical application scenarios. Toward the end, we discussed the future development trends of smart contracts. This paper is aimed at providing helpful guidance and reference for future research efforts.", "Published in": [{"name": "IEEE Transactions on Systems, Man, and Cybernetics: Systems", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221021"}], "Authors": [{"name": "Shuai Wang", "from": "University of Chinese Academy of Sciences, Beijing, China"}, {"name": "Liwei Ouyang", "from": "University of Chinese Academy of Sciences, Beijing, China"}, {"name": "Yong Yuan", "from": "Parallel Blockchain Technology Innovation Center, Qingdao Academy of Intelligent Industries, Qingdao, China"}, {"name": "Xiaochun Ni", "from": "Parallel Blockchain Technology Innovation Center, Qingdao Academy of Intelligent Industries, Qingdao, China"}, {"name": "Xuan Han", "from": "Parallel Blockchain Technology Innovation Center, Qingdao Academy of Intelligent Industries, Qingdao, China"}, {"name": "Fei-Yue Wang", "from": "Parallel Blockchain Technology Innovation Center, Qingdao Academy of Intelligent Industries, Qingdao, China"}], "IEEE keywords": ["Smart contracts", "Blockchain", "Bitcoin", "Market research", "Proposals"], "Author Keywords": ["Blockchain", "parallel blockchain", "six-layer architecture", "smart contracts"]}