{"Title": "ArtChain: Blockchain-Enabled Platform for Art Marketplace", "Pages": null, "Cites in Papers": 40, "Cites in Patents": 1, "Full Text Views": 4217, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00068", "Date of Publication": "14-17 July 2019", "abstract": "Blockchain is an emerging technology that has the potential to revolutionize the global industry and create a trusted relationship in a multi-party business network. There are a number of practical use cases where blockchain has been applied. One specific area is the Art industry, where it is a natural fit in the way that art forensics and transactions are conducted, tracked and recorded. This motivates us to develop the ArtChain platform to assist the Art Industry. In this paper, we present ArtChain, which is an integrated trading system based on blockchain. It includes the front end, the back end, the services, the smart contract, the chain connection and the deployment scripts from the bottom to the top. To the best of our knowledge, this is the first deployed blockchain-enabled art trading platform in Australia. It provides a transparent yet privacy-preserving, and tamper-proof transaction history for registration, provenance, and traceability of art assets. Our objective analysis and evaluation show that the ArtChain platform is applicable and practical. For the interest of other researchers, our system implementation related resources are open-sourced on Github.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Ziyuan Wang", "from": "Blockchain Innovation Centre, Swinburne University of Technology"}, {"name": "Lin Yang", "from": "Blockchain Innovation Centre, Swinburne University of Technology"}, {"name": "Qin Wang", "from": "Blockchain Innovation Centre, Swinburne University of Technology"}, {"name": "Donghai Liu", "from": "Blockchain Innovation Centre, Swinburne University of Technology"}, {"name": "Zhiyu Xu", "from": "Blockchain Innovation Centre, Swinburne University of Technology"}, {"name": "Shigang Liu", "from": "Blockchain Innovation Centre, Swinburne University of Technology"}], "IEEE keywords": ["Art", "Blockchain", "Ecosystems", "Business", "History", "Distributed ledger"], "Author Keywords": ["blockchain", "artwork", "provenance"]}