{"Title": "Blockchain-based Universal Loyalty Platform", "Pages": null, "Cites in Papers": 14, "Cites in Patents": 1, "Full Text Views": 637, "Publisher": "IEEE", "DOI": "10.1109/ICAC347590.2019.9036772", "Date of Publication": "20-21 December 2019", "abstract": "Loyalty Programs are reward programs offered by a company to customers who frequently make purchases. However, there are major issues with traditional loyalty programs like low redemption rates, expiring of points, customer acquisition costs, and the nuisance of keeping track of multiple loyalty programs. Blockchain provides a solution to a number of these issues. This paper explores the issues of the current loyalty programs and how Blockchain technology can be used to tackle the underlying issues of traditional loyalty programs. Finally, we propose our own Blockchain-based universal loyalty platform, which aims at making loyalty programs more beneficial for customers, thereby increasing customer retention rates as well as more convenient for companies to have their own loyalty program. This system aims to integrate individual loyalty programs into a unified platform that will allow transfer and exchange of loyalty points between users and promote co-branding among various companies located worldwide.", "Published in": [{"name": "2019 International Conference on Advances in Computing, Communication and Control (ICAC3)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9018089/proceeding"}], "Authors": [{"name": "Mausam Agrawal", "from": "Department of Information Technology, Dwarkadas J. Sanghvi College of Engineering, Mumbai, Maharashtra"}, {"name": "Divya Amin", "from": "Department of Information Technology, Dwarkadas J. Sanghvi College of Engineering, Mumbai, Maharashtra"}, {"name": "Harshal Dalvi", "from": "Department of Information Technology, Dwarkadas J. Sanghvi College of Engineering, Mumbai, Maharashtra"}, {"name": "Riken Gala", "from": "Department of Information Technology, Dwarkadas J. Sanghvi College of Engineering, Mumbai, Maharashtra"}], "IEEE keywords": ["Blockchain", "Companies", "Distributed ledger", "Fabrics", "Smart contracts", "Peer-to-peer computing"], "Author Keywords": ["Blockchain", "Blockchain Loyalty", "Loyalty Program", "Universal Loyalty Program", "Hyperledger Fabric", "Stellar Blockchain"]}