{"Title": "InterTrust: Towards an Efficient Blockchain Interoperability Architecture with Trusted Services", "Pages": null, "Cites in Papers": 18, "Cites in Patents": 0, "Full Text Views": 1006, "Publisher": "IEEE", "DOI": "10.1109/Blockchain53845.2021.00029", "Date of Publication": "06-08 December 2021", "abstract": "Blockchain as a potentially disruptive technology can advance many different fields, e.g., cryptocurrencies, supply chains, and the industrial Internet of Things. The next-generation blockchain ecosystem is expected to consist of various homogeneous and heterogeneous distributed ledgers. These ledger systems will inevitably require a certain level of proper cooperation of multiple blockchains to enrich advanced functionalities and enhance interoperable capabilities for future applications. The interoperability among blockchains will revolutionize current blockchain design principles, like the emergence of the Internet. However, the development of cross-blockchain applications involves much complexity regarding the variety of underlying cross-blockchain communication. With that regard, we propose an efficient, interoperable blockchain architecture, InterTrust, to support interoperability and trustworthiness among arbitrary blockchain systems (including homogeneous and heterogeneous blockchains). It consists of an atomic cross-chain communication protocol, which can be considered an agnostic protocol to integrate existing blockchain systems smoothly. InterTrust is powered by two innovative techniques: threshold signature scheme and trusted hardware. The threshold signature scheme guarantees consistency and verifiability in the target blockchain systems, and the trusted hardware guarantees trusted services among distinct blockchain systems. Combining these two techniques provides an efficient cross-chain communication protocol to facilitate atomic swaps and interoperable operations between different blockchain systems. Our interoperable architecture is robust to support arbitrary blockchain systems. We also present the security analysis on the scenarios of integrating our protocol into Byzantine fault tolerance based blockchain systems.", "Published in": [{"name": "2021 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9680465/proceeding"}], "Authors": [{"name": "Gang Wang", "from": "Emerson Automation Solutions, Round Rock, USA"}, {"name": "Mark Nixon", "from": "Emerson Automation Solutions, Round Rock, USA"}], "IEEE keywords": ["Protocols", "Supply chains", "Fault tolerant systems", "Throughput", "Hardware", "Blockchains", "Internet"], "Author Keywords": ["Blockchain Interoperability", "Trusted Services", "Cross-chain Communication", "Atomic Swaps"]}