{"Title": "Distributed Application of Blockchain—Taking Cross-Border E-Commerce as an Example", "Pages": null, "Cites in Papers": 183, "Cites in Patents": 0, "Full Text Views": 183, "Publisher": "IEEE", "DOI": "10.1109/CCSB58128.2022.00010", "Date of Publication": "28-30 October 2022", "abstract": "Blockchain is a chained data structure that connects data blocks in chronological order according to the principle of head to tail connection. It is a distributed ledger technology combined with a variety of network technologies. In essence, it is a decentralized database. In short, the database can be regarded as an account book, and everyone can participate in bookkeeping. As a distributed accounting technology, blockchain makes it possible to monitor the logistics transportation process in real time, and it also makes it easier to track down the responsibility in case of goods to goods problems. Since each node of the blockchain has bookkeeping permission, each entity in the goods transportation can also record the logistics information on the blockchain, which not only records the whole process of goods from delivery to receipt in real time, but also realizes the sharing, openness and transparency of logistics information. blockchain technology takes “distributed ledger” as the solution, and its essence is a decentralized data storage technology. In blockchain technology, there is no central node, each node is completely equal, and all nodes jointly maintain the public database through encryption protocol. Blockchain technology applies cryptography technology to decentralized networks.", "Published in": [{"name": "2022 2nd International Conference on Computer Science and Blockchain (CCSB)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10071526/proceeding"}], "Authors": [{"name": "Yifu Liu", "from": "XJTLU of Computer Science and Technology, School of Advanced Tech., Suzhou, Jiangsu, China"}], "IEEE keywords": ["Protocols", "Databases", "Distributed ledger", "Transportation", "Tail", "Real-time systems", "Blockchains"], "Author Keywords": ["Blockchain", "Cryptography technology", "Distributed ledger", "Network technologies"]}