{"Title": "Blockchain Privacy Data Protection Method Based on HEVC Video Steganography", "Pages": null, "Cites in Papers": 2, "Cites in Patents": 0, "Full Text Views": 362, "Publisher": "IEEE", "DOI": "10.1109/SmartBlock52591.2020.00015", "Date of Publication": "23-25 October 2020", "abstract": "Blockchain is a shared digital public ledger that cannot be changed once transactions are recorded and verified. Since most blockchain nodes retain copies of the ledger, the blockchain brings the benefits of decentralization while also bringing privacy leakage issues. With the continuous development of blockchain applications, how to protect the privacy data on the blockchain platform is a very worthwhile research question. This paper first divides each blockchain transaction data into two parts: sensitive data and basic data, and then encrypts and hides the sensitive data into the HEVC video to protect the privacy transaction data of the blockchain. The experimental results show that this HEVC video steganography algorithm can effectively increase the privacy data embedding capacity and get good visual quality.", "Published in": [{"name": "2020 3rd International Conference on Smart BlockChain (SmartBlock)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9415621/proceeding"}], "Authors": [{"name": "Si Liu", "from": "College of Information Science and Technology, Zhengzhou Normal University, Zhengzhou, China"}, {"name": "Yunxia Liu", "from": "College of Information Science and Technology, Zhengzhou Normal University, Zhengzhou, China"}, {"name": "Cong Feng", "from": "College of Information Science and Technology, Zhengzhou Normal University, Zhengzhou, China"}, {"name": "Hongguo Zhao", "from": "College of Information Science and Technology, Zhengzhou Normal University, Zhengzhou, China"}, {"name": "Yu Huang", "from": "National Engineering Research Center for Software Engineering, Peking University, Beijing, China"}], "IEEE keywords": ["Data privacy", "Visualization", "Privacy", "Memory", "Data protection", "Blockchain", "Encoding"], "Author Keywords": ["Blockchain", "HEVC", "Video steganography", "Privacy protection", "Matrix encoding"]}