{"Title": "A Framework for Asynchronous Cross-Blockchain Smart Contract Calls", "Pages": null, "Cites in Papers": 103, "Cites in Patents": 0, "Full Text Views": 103, "Publisher": "IEEE", "DOI": "10.1109/BCCA58897.2023.10338866", "Date of Publication": "24-26 October 2023", "abstract": "Missing interoperability is a prevalent issue in today's blockchain landscape. Due to this lack of interoperability, only smart contracts deployed on the same blockchain can call each other. Smart contract interactions across the boundaries of blockchains would, however, provide an opportunity to create cross-blockchain applications. Hence, an additional mechanism for the execution of cross-blockchain smart contract calls is desirable. Unfortunately, already proposed solutions usually require one or more trusted intermediaries, which eventually leads to a lower degree of decentralization. Therefore, we propose a novel framework to enable smart contract interoperability across different blockchains. The framework enables the execution of asynchronous cross-blockchain smart contract calls. It uses blockchain relays to maintain a high degree of decentralization while placing only minor trust in intermediaries. We provide a prototypical implementation for Ethereum-based blockchains and evaluate it regarding costs and execution time.", "Published in": [{"name": "2023 Fifth International Conference on Blockchain Computing and Applications (BCCA)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10338825/proceeding"}], "Authors": [{"name": "Michael Sober", "from": "Christian Doppler Laboratory for Blockchain Technologies for the Internet of Things"}, {"name": "Giulia Scaffino", "from": "Christian Doppler Laboratory for Blockchain Technologies for the Internet of Things"}, {"name": "Marten Sigwart", "from": "TU Wien, Vienna, Austria"}, {"name": "Philipp Frauenthaler", "from": "TU Wien, Vienna, Austria"}, {"name": "Markus Levonyak", "from": "Pantos GmbH, Vienna, Austria"}, {"name": "Stefan Schulte", "from": "Christian Doppler Laboratory for Blockchain Technologies for the Internet of Things"}], "IEEE keywords": ["Costs", "Smart contracts", "Blockchains", "Relays", "Interoperability"], "Author Keywords": ["blockchain interoperability", "smart contracts", "cross-blockchain communication"]}