{"Title": "Comparative Studies: Blockchain Technology Applications in GDPR - Representing an Applicability Model", "Pages": null, "Cites in Papers": 8, "Cites in Patents": 0, "Full Text Views": 8, "Publisher": "IEEE", "DOI": "10.1109/ICWR61162.2024.10533322", "Date of Publication": "24-25 April 2024", "abstract": "The application of blockchain technology in the context of the General Data Protection Regulation (GDPR) has emerged as a significant and challenging area of research in recent years. Many believe that blockchain capabilities can be leveraged to comply with GDPR principles. This study focuses on the specific capabilities of blockchain technology and addresses the unique data protection challenges in the information age, aiming to identify and represent these relationships through an applicability model. The goal of this research is to present a model for evaluating and selecting blockchain applications that are aligned with GDPR requirements. This model is developed through a meta-synthesis method and qualitative content analysis of 67 articles that concentrate on the potential applications of blockchain in GDPR across various countries. These applications are defined based on an analysis of key blockchain capabilities such as transparency, immutability, and data encryption. Further, this study maps these capabilities to key GDPR requirements such as data minimization and accuracy, analyzing them from both facilitating and inhibiting perspectives. Ultimately, based on qualitative content analysis and an in-depth study of 31 articles selected through the Critical Assessment of Methods of Protein Structure Prediction method (CASP), this research offers a comprehensive model for understanding and leveraging blockchain technology in a manner that complies with GDPR requirements. according to this, the study contributes to the understanding of blockchain technology’s applicability in meeting GDPR requirements, offering insights for policymakers, industry stakeholders, and technology developers on the strategic implementation of blockchain for data protection.", "Published in": [{"name": "2024 10th International Conference on Web Research (ICWR)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10533315/proceeding"}], "Authors": [{"name": "Elham Khazaei", "from": "Faculty of IT Management, University of Tehran, Tehran, Iran"}, {"name": "Abouzar Arabsorkhi", "from": "Department of ICT Security, Iran Telecommunications Research Institute, Tehran, Iran"}], "IEEE keywords": ["Proteins", "Analytical models", "Technological innovation", "Law", "Smart contracts", "Predictive models", "Blockchains"], "Author Keywords": ["Blockchain Applications", "Blockchain Vs. GDPR", "Blockchain Applications in GDPR", "Blockchain Adoption in GDPR", "Blockchain & Data Protection Requirements", "Blockchain & GDPR Compliance"]}