{"Title": "VAULT: A Scalable Blockchain-Based Protocol for Secure Data Access and Collaboration", "Pages": null, "Cites in Papers": 4, "Cites in Patents": 0, "Full Text Views": 613, "Publisher": "IEEE", "DOI": "10.1109/Blockchain53845.2021.00059", "Date of Publication": "06-08 December 2021", "abstract": "Data sharing is as vital as data storage. Existing centralized data sharing and access systems provide less transparency and traceability as the users have to trust a centralized authority and its decision making for the entire system. There is a need for decentralized distributed data storage and access without a central authority. Blockchain provides promising solutions to such needs. However, the existing decentralized blockchain-based solutions are complex and involve financial incentives, which limits their applications. We propose a secure permissioned blockchain-based decentralized system, VAULT, with a novel quorum-based consensus. We store encrypted files using Interplanetary File System (IPFS) and the references to the files in the blockchain. VAULT is designed for applications involving collaboration from multiple permissioned parties, and users can store, access, and share data as well as manage projects through blockchain. Our experimental results show that our quorum selection is fair, and the VAULT protocol is scalable.", "Published in": [{"name": "2021 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9680465/proceeding"}], "Authors": [{"name": "Justin S. Gazsi", "from": "School of Computing and Information Sciences, Florida International University"}, {"name": "Sajia Zafreen", "from": "Department of Computer Science, Boise State University"}, {"name": "Gaby G. Dagher", "from": "Department of Computer Science, Boise State University"}, {"name": "Min Long", "from": "Department of Computer Science, Boise State University"}], "IEEE keywords": ["Protocols", "File systems", "Conferences", "Decision making", "Memory", "Collaboration", "Blockchains"], "Author Keywords": ["Blockchain", "IPFS", "Distributed Storage", "Data Access and Sharing"]}