{"Title": "Research on Deep Forgery Data Identification and Traceability Technology Based on Blockchain", "Pages": null, "Cites in Papers": 3, "Cites in Patents": 0, "Full Text Views": 442, "Publisher": "IEEE", "DOI": "10.1109/ICDSCA56264.2022.9988274", "Date of Publication": "28-30 October 2022", "abstract": "With the acceleration of the digital transformation of the power system, the electronic data in the power production operation has shown an explosive growth. However, the increasing proliferation of deep forgery technology has brought huge hidden dangers to the electronic data management of power grid enterprises, and it is urgent to build a trusted management system for electronic data. This paper proposes a blockchain-based deep forgery data identification and traceability framework. Firstly, a method of trusted identification of electronic data based on blockchain is proposed, which constructs the unique identification of data and embeds it in the electronic data as a digital watermark. Second, introduce blockchain-based electronic data forensic appraisal technology to conduct authenticity and similarity analysis of electronic data. Finally, a deep forgery data traceability mechanism based on digital identification is designed to realize deep forgery data traceability and dissemination supervision. After comparative analysis, the framework is more secure and efficient in deep forgery data supervision, and can provide key support for building a trusted content system in cyberspace.", "Published in": [{"name": "2022 IEEE 2nd International Conference on Data Science and Computer Application (ICDSCA)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9987722/proceeding"}], "Authors": [{"name": "Ke Yang", "from": "State Grid Digital Technology Holding Co., Ltd., State Grid Blockchain Technology (Beijing) Co., Ltd., Beijing, China"}, {"name": "Da Li", "from": "Blockchain Technology Laboratory, State Grid Blockchain Technology (Beijing) Co., Ltd. State Grid Co., Ltd., Beijing, China"}, {"name": "Qinglei Guo", "from": "Blockchain Technology Laboratory, State Grid Blockchain Technology (Beijing) Co., Ltd. State Grid Co., Ltd., Beijing, China"}, {"name": "Hejian Wang", "from": "State Grid Digital Technology Holding Co., Ltd., State Grid Blockchain Technology (Beijing) Co., Ltd., Beijing, China"}, {"name": "Desheng Bai", "from": "Blockchain Technology Laboratory, State Grid Blockchain Technology (Beijing) Co., Ltd. State Grid Co., Ltd., Beijing, China"}, {"name": "Xiukui Pan", "from": "Blockchain Technology Laboratory, State Grid Blockchain Technology (Beijing) Co., Ltd. State Grid Co., Ltd., Beijing, China"}], "IEEE keywords": ["Forensics", "Digital transformation", "Cyberspace", "Watermarking", "Production", "Data science", "Forgery"], "Author Keywords": ["deep forgery", "blockchain", "data identification", "forensic appraisal", "data traceability"]}