{"Title": "A Blockchain handling Data in a Waste Recycling Scenario and Fostering Participation", "Pages": null, "Cites in Papers": 3, "Cites in Patents": 0, "Full Text Views": 266, "Publisher": "IEEE", "DOI": "10.1109/BCCA50787.2020.9274083", "Date of Publication": "02-05 November 2020", "abstract": "When having to improve waste collection and recycling, the citizen involvement is paramount. However, the lack of transparency about everyday activities and progresses towards long term goals could result in a loss of interest for the community and more difficulties in achieving desired results. In our proposed approach, data related to waste collection would be automatically passed from sensors to a blockchain smart contract. Such data include the amount of waste collected for each category from a citizen. By using a blockchain storing data related to collected waste, maximum data integrity and transparency would be ensured. Furthermore, citizens are provided with a smartphone app to read data from the blockchain, register other data concerning their activities, and check their fee balance. The overall solution, by ensuring that each citizen can monitor their progress and the global results achieved by the community, would address and foster participation.", "Published in": [{"name": "2020 Second International Conference on Blockchain Computing and Applications (BCCA)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9274076/proceeding"}], "Authors": [{"name": "Leonardo Pelonero", "from": "Dipartimento di Matematica e Informatica, University of Catania, Italy"}, {"name": "Andrea Fornaia", "from": "Dipartimento di Matematica e Informatica, University of Catania, Italy"}, {"name": "Emiliano Tramontana", "from": "Dipartimento di Matematica e Informatica, University of Catania, Italy"}], "IEEE keywords": ["Blockchain", "Recycling", "Smart contracts", "Security", "Monitoring", "Waste management", "Servers"], "Author Keywords": ["IoT", "Data Transparency", "Privacy", "Security", "Blockchain"]}