{"Title": "Containerchain: A Blockchain System Emulator based on Mininet and Containers", "Pages": null, "Cites in Papers": 2, "Cites in Patents": 0, "Full Text Views": 269, "Publisher": "IEEE", "DOI": "10.1109/Blockchain53845.2021.00074", "Date of Publication": "06-08 December 2021", "abstract": "Blockchain is a popular topic of research in recent years. For worthwhile research into the use Blockchains, they often must be deployed into environments that are as close to real-world scenarios as possible. Real-world networks are large and complex and therefore the Blockchains used to research them should be large and complex. Creating large Blockchains like this may seem out-of-reach for the humble researcher. The tool introduced in this paper - Containerchain - seeks to make it much easier to spin up a large Blockchain system with little-or-no setup. The ultimate goal being to allow researchers to spend more time on actual research, rather than on setting up the network. Containerchain allows the user to deploy a real Blockchain system (not simulated) with several configurable parameters at their disposal. The user can control the number of nodes in the system, the consensus mechanism used and can observe and analyze the network traffic in the Blockchain - which is recorded out-of-the-box.", "Published in": [{"name": "2021 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9680465/proceeding"}], "Authors": [{"name": "Saul Gill", "from": "Software Research Institute Technological University of the Shannon, Midlands Midwest, Athlone, Ireland"}, {"name": "Brian Lee", "from": "Software Research Institute Technological University of the Shannon, Midlands Midwest, Athlone, Ireland"}, {"name": "Yuansong Qiao", "from": "Software Research Institute Technological University of the Shannon, Midlands Midwest, Athlone, Ireland"}], "IEEE keywords": ["Conferences", "Telecommunication traffic", "Containers", "Blockchains"], "Author Keywords": ["Blockchain", "Emulator", "Mininet", "Docker", "Container", "Simulator"]}