{"Title": "Research on blockchain consensus algorithm for large-scale high-concurrency power transactions", "Pages": null, "Cites in Papers": 503, "Cites in Patents": 0, "Full Text Views": 503, "Publisher": "IEEE", "DOI": "10.1109/IFEEA57288.2022.10037907", "Date of Publication": "04-06 November 2022", "abstract": "At present, the application model and business model of the blockchain are still being explored. How to better integrate the blockchain technology into the power transaction business scenario to improve the quality and efficiency needs to be further explored in combination with the specific business development needs. In view of the large scale of market entities and high transaction processing capabilities in the large-scale and high-concurrency power transaction business scenario, this paper studies the parallel processing technology of blockchain transactions, realizes the parallel processing of transactions, and supports the parallel reading and writing capabilities of tens of thousands of entities. Research on the blockchain consensus algorithm suitable for power trading business can shorten the transaction consensus and execution time, and ensure that the consensus mechanism meets the concurrency requirements of business responsiveness and performance requirements.", "Published in": [{"name": "2022 9th International Forum on Electrical Engineering and Automation (IFEEA)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10037755/proceeding"}], "Authors": [{"name": "Xuesen Zhang", "from": "State Grid Digital Technology Holding Co., Ltd, Beijing, China"}, {"name": "Qinglei Guo", "from": "State Grid Digital Technology Holding Co., Ltd, Beijing, China"}, {"name": "Xiaoxiao Ma", "from": "State Grid Digital Technology Holding Co., Ltd, Beijing, China"}, {"name": "Zhe Du", "from": "State Grid Blockchain Technology (Beijing) Co.Ltd, Beijing, China"}, {"name": "Shuang Sun", "from": "State Grid Blockchain Technology (Beijing) Co.Ltd, Beijing, China"}, {"name": "Desheng Bai", "from": "State Grid Blockchain Technology (Beijing) Co.Ltd, Beijing, China"}], "IEEE keywords": ["Sharding", "Scalability", "Consensus algorithm", "Parallel processing", "Writing", "Throughput", "Power markets"], "Author Keywords": ["energy field", "blockchain", "consensus algorithm"]}