{"Title": "Enrichment of Blockchain Transaction Management with Semantic Triples", "Pages": null, "Cites in Papers": 1, "Cites in Patents": 0, "Full Text Views": 222, "Publisher": "IEEE", "DOI": "10.1109/Blockchain50366.2020.00030", "Date of Publication": "02-06 November 2020", "abstract": "Enterprise business transactions have both public and private information; hence blockchain adaptation to an enterprise business application needs current blockchain platforms to support both public and private information. Public blockchains (permissionless) are optimized for transparency; hence the sharing of private and sensitive information is challenging. On the other hand, private blockchains (permissioned) separate information about a transaction by generating a public transaction and a set of private transactions and treat them separately. This separation weakens the cohesiveness of transaction information and develops an extra burden when it is necessary to connect both public and private information which is not duly addressed in the literature. For example, auditing, regulatory activities, certifications, and traceability need both the public and private information about transactions. This paper uses semantic triples and introduces the Triples for Transactions(T4T) model to define blockchain transactions, improve cohesiveness and resolve the extra burden of connecting both private and public transactions. This paper presents a user-driven transaction analysis, transaction modelling using the T4T model, semantic querying, and REST endpoints to enrich transaction management. Sets of semantic triples can define both public and private information about a transaction while preserving cohesiveness of the information. This approach supports point-to-point sharing of sensitive information while preserving implicit relationships between both private and public information. We have implemented an auditing scenario in the proposed approach adopting Hyperledger Fabric and compared for performance with Hyperledger Fabric. The results showed that the proposed approach reduces the number of transaction cycles by 66% compared to Hyperledger Fabric and the performance of information retrieval is in O(N). This result is a significant improvement compared to Hyperledger F...", "Published in": [{"name": "2020 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9284404/proceeding"}], "Authors": [{"name": "Kosala Yapa Bandara", "from": "The Insight Centre for Data Analytics, National University of Ireland Galway, Galway, Ireland"}, {"name": "Subhasis Thakur", "from": "The Insight Centre for Data Analytics, National University of Ireland Galway, Galway, Ireland"}, {"name": "John Breslin", "from": "The Insight Centre for Data Analytics, National University of Ireland Galway, Galway, Ireland"}], "IEEE keywords": ["Analytical models", "Distributed ledger", "Semantics", "Blockchain", "Information retrieval", "Fabrics", "Business"], "Author Keywords": ["Blockchain", "Traceability", "Semantic Triples", "Hyperledger Fabric"]}