{"Title": "A Secure and Flexible Blockchain-Based Offline Payment Protocol", "Pages": null, "Cites in Papers": 1502, "Cites in Patents": 0, "Full Text Views": 1502, "Publisher": "IEEE", "DOI": "10.1109/TC.2023.3331823", "Date of Publication": "13 November 2023", "abstract": "Off-chain transactions seek to address the low on-chain scalability and enable blockchain-based payments over unreliable on-chain networks. The key problem with existing works is that they fail to balance security and flexibility in their designs. These studies would have been more useful if they could provide a sense of security without compromising their flexibility. We hypothesize that two offline parties having loosely synchronized clocks and channels with known bounded latency can conduct off-chain transactions while maintaining a high level of security and flexibility: we introduce a novel blockchain-based offline payment protocol that supports our hypothesis. Our work leverages on-chain smart contracts and offline wallet interactions to build resilience against intermittent on-chain connectivity. Our protocol achieves flexible and trusted computations with the use of platform-agnostic Trusted Execution Environments (TEEs) and open transactions. We empirically evaluate our design over the mainstream Intel Software Guard Extensions (SGX) and compare our protocol with state-of-the-art solutions. We found that our protocol attains high efficiency and exhibits an advanced level of security and flexibility in functionality. We evaluate our construction against several real-world attacks. We prove the security and robustness of our scheme based on a practical universally composable framework with synchronous settings. This work contributes to the existing knowledge of safe and user-friendly offline payment solutions for the blockchain technology.", "Published in": [{"name": "IEEE Transactions on Computers", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=12"}], "Authors": [{"name": "Wanqing Jie", "from": "Institute of Artificial Intelligence, Beijing Advanced Innovation Center for Future Blockchain and Privacy Computing, Beihang University, Beijing, China"}, {"name": "Wangjie Qiu", "from": "Institute of Artificial Intelligence, Beijing Advanced Innovation Center for Future Blockchain and Privacy Computing, Beihang University, Beijing, China"}, {"name": "Arthur Sandor Voundi Koe", "from": "State Key Laboratory of Integrated Service Networks, Xidian University, Xi’an, China"}, {"name": "Jianhong Li", "from": "Institute of Artificial Intelligence and Blockchain, Guangzhou University, Guangdong, China"}, {"name": "Yin Wang", "from": "Institute of Artificial Intelligence and Blockchain, Guangzhou University, Guangdong, China"}, {"name": "Yaqi Wu", "from": "Institute of Artificial Intelligence and Blockchain, Guangzhou University, Guangdong, China"}, {"name": "Jin Li", "from": "Institute of Artificial Intelligence and Blockchain, Guangzhou University, Guangdong, China"}, {"name": "Zhiming Zheng", "from": "Institute of Artificial Intelligence, Beijing Advanced Innovation Center for Future Blockchain and Privacy Computing, Beihang University, Beijing, China"}], "IEEE keywords": ["Security", "Blockchains", "Smart contracts", "Metadata", "Threat modeling", "Scalability", "Forgery"], "Author Keywords": ["Blockchain", "offline payment", "smart contract", "security", "flexible", "protocol"]}