{"Title": "Transparency in Carbon Credit by Automating Data-Management Using Blockchain", "Pages": null, "Cites in Papers": 1, "Cites in Patents": 0, "Full Text Views": 407, "Publisher": "IEEE", "DOI": "10.1109/ICBDS53701.2022.9935979", "Date of Publication": "16-18 September 2022", "abstract": "Climate change has raised an alarm for world to ponder about and if not stopped can cause serious repercussions. A feasible solution to alleviate greenhouse gas emissions is via a mechanism that is laid out in Kyoto protocol in 1997. It was signed by close to 192 nations thus creating a system to monetize carbon emissions with an aim to build an authority over it. There have been efforts to build a system in previous decade too but there have been certain shortcomings. The major challenges which exist are data manipulation, lack of transparency and substantial costs. So we have come up with the idea of Blockchain which will build a carbon credit ecosystem thus guaranteeing us security, transparency, accessibility to the standardized carbon markets. We will also be using sensors to automate the data to out consortium.", "Published in": [{"name": "2022 IEEE International Conference on Blockchain and Distributed Systems Security (ICBDS)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9935826/proceeding"}], "Authors": [{"name": "Shubham Chakraborty", "from": "Dept. of Electronics and Telecommunications Engineering, BMS Institute of Technology and Management, Bangalore, India"}, {"name": "Abhishek Anand", "from": "Dept. of Information Science and Engineering, BMS Institute of Technology and Management, Bangalore, India"}, {"name": "Divya Kalash", "from": "Dept. of Information Science and Engineering, BMS Institute of Technology and Management, Bangalore, India"}, {"name": "Anupam Srivastava", "from": "Dept. of Electronics and Telecommunications Engineering, BMS Institute of Technology and Management, Bangalore, India"}], "IEEE keywords": ["Climate change", "Protocols", "Costs", "Greenhouse effect", "Ecosystems", "Carbon dioxide", "Blockchains"], "Author Keywords": ["Carbon Credit", "Data Management System", "Carbon Removal", "Blockchain", "Sensor", "Transparency", "Ecosystem"]}