{"Title": "CoDAG: An Efficient and Compacted DAG-Based Blockchain Protocol", "Pages": null, "Cites in Papers": 17, "Cites in Patents": 0, "Full Text Views": 3289, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00049", "Date of Publication": "14-17 July 2019", "abstract": "Blockchain is seen as a promising technology to provide reliable and secure services due to its decentralized characteristic. However, because of the limited throughput, current blockchain platforms can not meet the transaction demand in practical use. Though researchers proposed many new solutions, they suffered either decentralization or security issues. In this paper, using Directed Acyclic Graph (DAG) structure, we improve the linear structure of traditional blockchain protocol. In the new structure, blocks are organized in levels and width, which will generate into a compacted DAG structure (CoDAG). To make CoDAG more efficient and secure, we design algorithms and protocols to place the new-generated blocks appropriately. Compared with traditional blockchain protocols, CoDAG improves the security and transaction verification time, and enjoys the consistency and liveness properties of blockchain. Taking adversary parties into consideration, two possible attack strategies are presented in this paper, and we further prove that CoDAG is a secure and robust protocol to resist them. The experimental results show that CoDAG can achieve 394 transactions per second, which is 56 times of Bitcoin's throughput and 26 times of Ethereum's.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Shu Yang", "from": "College of Computer Science and Software Engineering, Shenzhen University, Shenzhen, PR.China"}, {"name": "Ziteng Chen", "from": "College of Computer Science and Software Engineering, Shenzhen University, Shenzhen, PR.China"}, {"name": "Laizhong Cui", "from": "College of Computer Science and Software Engineering, Shenzhen University, Shenzhen, PR.China"}, {"name": "Mingwei Xu", "from": "Department of Computer Science and Technology, Tsinghua University, Beijing, PR.China"}, {"name": "Zhongxing Ming", "from": "Department of Computer Science and Technology, Tsinghua University, Beijing, PR.China"}, {"name": "Ke Xu", "from": "Department of Computer Science and Technology, Tsinghua University, Beijing, PR.China"}], "IEEE keywords": ["Protocols", "Blockchain", "Throughput", "Bitcoin", "Navigation", "Directed acyclic graph"], "Author Keywords": ["blockchain", "compacted directed acyclic graph"]}