{"Title": "BlockIPFS - Blockchain-Enabled Interplanetary File System for Forensic and Trusted Data Traceability", "Pages": null, "Cites in Papers": 86, "Cites in Patents": 0, "Full Text Views": 3031, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00012", "Date of Publication": "14-17 July 2019", "abstract": "The Interplanetary File System (IPFS) is a distributed file system that seeks to decentralize the web and to make it faster and more efficient. It incorporates well-known technologies, including BitTorrent and Git, to create a swarm of computing systems that share information. Since its introduction in 2016, IPFS has seen great improvements and adoption from both individuals and enterprise organizations. Its distributed network allows users to share files and information across the globe. IPFS works well with large files that may consume or require large bandwidth to upload and/or download over the Internet. The rapid adoption of this distributed file system is in part because IPFS is designed to operate on top of different protocols, such as FTP and HTTP. However, there are underpinning concerns relating to security and access control, for example lack of traceability on how the files are accessed. The aim of this paper is to complement IPFS with blockchain technology, by proposing a new approach (BlockIPFS) to create a clear audit trail. BlockIPFS allows us to achieve improved trustworthiness of the data and authorship protection, and provide a clear route to trace back all activities associated with a given file using blockchain as a service.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Emmanuel Nyaletey", "from": "College of Computing and Software Engineering, Kennesaw State University, GA, USA"}, {"name": "Reza M. Parizi", "from": "College of Computing and Software Engineering, Kennesaw State University, GA, USA"}, {"name": "Qi Zhang", "from": "IBM Thomas J. Watson Research, Yorktown Heights, NY, USA"}, {"name": "Kim-Kwang Raymond Choo", "from": "Department of Information Systems and Cyber Security, The University of Texas, San Antonio, TX, USA"}], "IEEE keywords": ["Blockchain", "Peer-to-peer computing", "Fabrics", "Distributed ledger", "File systems", "Metadata", "Security"], "Author Keywords": ["Blockchains, Blockchain as a Service, Smart Contracts, Hyperledger Fabric, IPFS, Distributed File Systems"]}