{"Title": "A Blockchain-based for Trustworthy Tourism Service Level Agreement", "Pages": null, "Cites in Papers": 50, "Cites in Patents": 0, "Full Text Views": 50, "Publisher": "IEEE", "DOI": "10.1109/CCSB60789.2023.10398825", "Date of Publication": "17-19 November 2023", "abstract": "The tourism industry is a new sector that stimulates consumer spending and drives economic growth, with the internet providing effective measures for its rapid development. Traditional online tourism service platforms, managed by a single entity, face trust barriers between different industries, hindering further development in tourism. The open and transparent nature of blockchain can effectively solve trust issues. However, existing solutions lack a study on the business processes of tourism services. The tourism industry still facing challenges such as cumbersome business processes, low coordination efficiency among stakeholders, and difficulties in service execution monitoring. Based on the above issues, this paper proposes a blockchain-based tourism service level agreement execution framework to establish a tourism service level agreement (TSLA) between tourists and service providers to realize the service provider's commitment to tourists. Furthermore, this paper designs a Tourism Service Level Agreement Smart Contract (TSLA-SC) based on oracle technology, stores the service execution process on the blockchain, tracks potential malicious behaviors of service providers, and sets corresponding reward and punishment measures to automate the TSLA execution process. Finally, experiments are conducted to test the cost and time expenses of TSLA-SC, with results indicating that the proposed solution can operate at lower costs, demonstrating good usability in terms of cost overhead.", "Published in": [{"name": "2023 3rd International Conference on Computer Science and Blockchain (CCSB)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10398737/proceeding"}], "Authors": [{"name": "Wanting Tang", "from": "College of Information Science and Engineering, Huaqiao University, Xiamen, China"}, {"name": "Jiayuan Zhang", "from": "College of Information Science and Engineering, Huaqiao University, Xiamen, China"}, {"name": "Rongxin Guo", "from": "College of Engineering, Huaqiao University, Quanzhou, China"}], "IEEE keywords": ["Costs", "Smart contracts", "Tourism industry", "Blockchains", "Usability", "Service level agreements", "Business"], "Author Keywords": ["blockchain", "SLA", "tourism", "smart contract", "oracle"]}