{"Title": "Toward a Decentralized Marketplace for Self-Maintaining Machines", "Pages": null, "Cites in Papers": 7, "Cites in Patents": 0, "Full Text Views": 441, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00066", "Date of Publication": "14-17 July 2019", "abstract": "Industrial procurement processes are inefficient, expensive, and error-prone as they require the agreement of numerous participants, audit-proof documentation, and are characterized by a high number of manual tasks. Blockchain technology has the potential to counter these challenges by combining peer-to-peer networks, cryptography, and consensus algorithms. A blockchain is a decentralized database that stores transactions and data transparently, chronologically, and tamper-proof in a distributed network. In this paper, we present a blockchain-based industrial marketplace, where machines have an identity and account for selecting, ordering, and paying materials in an automated manner using smart contracts. This allows manufacturers with a low real-net-output-ratio, such as car manufacturers that depend on numerous suppliers, to optimize their purchasing processes. Using our case study, we demonstrate prototypical implementation of the decentralized marketplace and its applications in the area of industrial maintenance. Furthermore, we conducted a semi-structured interview with procurement and information technology experts from the automotive industry. The results indicate that our prototype offers a promising approach streamlining procurement processes within the next two to five years.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Daniel Miehle", "from": "Technical University of Munich, Germany"}, {"name": "Matthias M. Meyer", "from": "Bundeswehr University Munich, Germany"}, {"name": "Andre Luckow", "from": "Munich University of Applied Sciences, Germany"}, {"name": "Bernd Bruegge", "from": "Technical University of Munich, Germany"}, {"name": "Michael Essig", "from": "Bundeswehr University Munich, Germany"}], "IEEE keywords": ["Blockchain", "Procurement", "Smart contracts", "Maintenance engineering", "Task analysis", "Companies", "Distributed ledger"], "Author Keywords": ["Blockchain Technology", "Smart Contract", "Machine-to-Machine Economy", "Smart Maintenance", "Smart Procurement", "Industry 4.0"]}