{"Title": "Research on blockchain technology in cryptographic exploration", "Pages": null, "Cites in Papers": 11, "Cites in Patents": 0, "Full Text Views": 1121, "Publisher": "IEEE", "DOI": "10.1109/ICBASE51474.2020.00033", "Date of Publication": "30 October 2020 - 01 November 2020", "abstract": "Building a traditional factory into a smart factory is one of the goals of “Industry 4.0”. As factories move towards smart development, the existing network security systems can no longer meet the needs of enterprises and users. Aiming at the hidden dangers of information leakage and illegal access to the data of cryptographic production facilities and products in the smart factory, the article combines the core technology of the Internet of Things radio frequency identification (RFID) technology and blockchain technology, and proposes a blockchain-based technology, the lightweight password security authentication mechanism of the smart factory RFID system, which has the characteristics of lightweight, anti-data leakage, and low management cost. It can ensure the safe and reliable access of industrial data while preventing the application of RFID in smart factories. Security issues such as replay attacks, man-in-the-middle attacks, and server spoofing attacks also provide new ideas for the research on data security protection for smart factories.", "Published in": [{"name": "2020 International Conference on Big Data & Artificial Intelligence & Software Engineering (ICBASE)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9403712/proceeding"}], "Authors": [{"name": "Yang Cheng", "from": "State Grid Blockchain Technology (beijing) Co.,Ltd, Beijing, China"}, {"name": "Han Shaoqin", "from": "State Grid Blockchain Technology (beijing) Co.,Ltd, Beijing, China"}], "IEEE keywords": ["Blockchain", "Production facilities", "Software reliability", "Cryptography", "Servers", "Internet of Things", "Smart manufacturing"], "Author Keywords": ["Password", "SmartFactory", "Blockchain", "RFID", "Authentication"]}