{"Title": "Security Assessment Model for Blockchain Software and Hardware Fusion Device Based on Decision Tree Algorithm", "Pages": null, "Cites in Papers": 33, "Cites in Patents": 0, "Full Text Views": 33, "Publisher": "IEEE", "DOI": "10.1109/ICIRDC62824.2023.00110", "Date of Publication": "29-31 December 2023", "abstract": "As the core hub for carrying various blockchain applications upstream and connecting network infrastructure downstream, blockchain infrastructure provides necessary storage, transmission, computing, development, and testing for the implementation of blockchain applications. This article attempts to propose a security evaluation model for blockchain software and hardware fusion devices based on decision tree algorithms. From the perspective of blockchain technology architecture, it fully reveals the security risks of evaluated blockchain projects for software and hardware fusion devices. It is necessary to conduct a comprehensive analysis of various technologies that affect the security risks of blockchain software and hardware fusion devices. By reusing the kernel through decision tree algorithm, a system chip that meets predetermined requirements can be quickly constructed, integrating processor modules and some commonly used functional modules. The research results indicate that the detection rate of the experimental group model is consistently higher than that of the traditional model. During the detection rate process, the average value of the experimental group is as high as 89.3%, which is much higher than the traditional model. Furthermore, the error detection rate curve remains at the lowest position, indicating the effectiveness of the proposed evaluation model.", "Published in": [{"name": "2023 International Conference on Internet of Things, Robotics and Distributed Computing (ICIRDC)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10510672/proceeding"}], "Authors": [{"name": "Ke Yang", "from": "State Grid Digital Technology Holding Co., Ltd., Beijing, China"}, {"name": "Shuang Sun", "from": "State Grid Digital Technology Holding Co., Ltd., Beijing, China"}, {"name": "Mingyang Lei", "from": "State Grid Blockchain Technology (Beijing) Co., Ltd., Beijing, China"}, {"name": "Weiyu Wang", "from": "State Grid Blockchain Technology (Beijing) Co., Ltd., Beijing, China"}, {"name": "Xiukui Pan", "from": "State Grid Blockchain Technology (Beijing) Co., Ltd., Beijing, China"}], "IEEE keywords": ["Computational modeling", "Software algorithms", "Hardware", "Software", "Blockchains", "Safety", "Security"], "Author Keywords": ["Decision tree algorithm", "Blockchain", "Software and hardware integration device", "Security assessment model"]}