{"Title": "EduCoin: a Secure and Efficient Payment Solution for MOOC Environment", "Pages": null, "Cites in Papers": 7, "Cites in Patents": 0, "Full Text Views": 406, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00074", "Date of Publication": "14-17 July 2019", "abstract": "Nowadays, the rise in popularity of massive open online courses (MOOCs) is significant. However, current online education service heavily relies on a third-party platform, which acts as a middleman to process transactions occurred among system participants. On the one hand, this centralized business model is based on database management system, once compromised, the data consistency and safety of transaction records can no longer be guaranteed. On the other hand, it's more expensive to resolve disputes and possible fraud transactions via a mediator than a direct peer-to-peer trusted payment. Aiming at solving issues regarding security and inefficiencies, we propose a crypto-asset EduCoin which is designed for secure and efficient payment in MOOC environment. Specially, we present a multi-party business model based on permissioned blockchain, Composer smart contracts and network topologies that utilize the three-tiered functional architecture of Fabric to achieve fast payment and trusted audit. By leveraging benchmark tools Caliper and Hitchhiker, we develop typical workloads based on transaction scenarios applying EduCoin. The experimental results demonstrate the practicality of EduCoin and offer insights into the design trade-offs and performance bottlenecks in production. We have released EduCoin for public use.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Lingling Lu", "from": "College of Computer Science, Zhejiang University, Hangzhou, P.R. China"}, {"name": "Jianhai Chen", "from": "College of Computer Science, Zhejiang University, Hangzhou, P.R. China"}, {"name": "Zijun Tian", "from": "College of Computer Science, Zhejiang University, Hangzhou, P.R. China"}, {"name": "Qinming He", "from": "College of Computer Science, Zhejiang University, Hangzhou, P.R. China"}, {"name": "Butian Huang", "from": "College of Computer Science, Zhejiang University, Hangzhou, P.R. China"}, {"name": "Yang Xiang", "from": "Swinburne Research, Swinburne University of Technology, Victoria, Australia"}, {"name": "Zhenguang Liu", "from": "College of Computer and Information Engineering, Zhejiang Gongshang University, Hangzhou, P.R. China"}], "IEEE keywords": ["Blockchain", "Fabrics", "Access control", "Peer-to-peer computing", "Smart contracts", "Organizations"], "Author Keywords": ["Permissioned Blockchain", "Crypto Asset", "MOOC", "Payment Solution", "Performance Evaluation"]}