{"Title": "Implicit Authentication in Neural Key Exchange Based on the Randomization of the Public Blockchain", "Pages": null, "Cites in Papers": 5, "Cites in Patents": 0, "Full Text Views": 595, "Publisher": "IEEE", "DOI": "10.1109/Blockchain50366.2020.00079", "Date of Publication": "02-06 November 2020", "abstract": "A neural key exchange is a secret key exchange technique based on neural synchronization of the neural network. Since the neural key exchange is based on synchronizing weights within the neural network structure, the security of the algorithm does not depend on the attacker's computational capabilities. However, due to the neural key exchange's repetitive mutual-learning processes, using explicit user authentication methods -such as a public key certificate- is inefficient due to high communication overhead. Implicit authentication based on information that only authorized users know can significantly reduce overhead in communications. However, there was a lack of realistic methods to distribute secret information for authentication among authorized users. In this paper, we propose the concept idea of distributing shared secret values for implicit authentication based on the randomness of the public blockchain. Moreover, we present a method to prevent the unintentional disclosure of shared secret values to third parties in the network due to the transparency of the blockchain.", "Published in": [{"name": "2020 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9284404/proceeding"}], "Authors": [{"name": "Siwan Noh", "from": "Department of Information Security, Pukyong National University, Busan, Republic of Korea"}, {"name": "Kyung-Hyune Rhee", "from": "Department of IT Convergence and Application Engineering, Pukyong National University, Busan, Republic of Korea"}], "IEEE keywords": ["Protocols", "Neural networks", "Authentication", "Public key", "Blockchain", "Synchronization", "Periodic structures"], "Author Keywords": ["neural key exchange", "authenticated key exchange", "blockchain"]}