{"Title": "A Carbon Emissions Verification Mechanism Based on Blockchain and Reverse Auction", "Pages": null, "Cites in Papers": 169, "Cites in Patents": 0, "Full Text Views": 169, "Publisher": "IEEE", "DOI": "10.1109/AIBT57480.2023.00021", "Date of Publication": "02-04 June 2023", "abstract": "With the establishment of the Carbon Peaking and Carbon Neutrality targets, Carbon Emissions Trading(CET), as an important emissions reduction policy tool, needs to be supported by more accurate carbon emissions data. However, the problems of low credibility of data and mismatch between government budget and work requirements are existing in the current carbon emissions data verification business. In this paper, we proposed a blockchain-based carbon verification mechanism to address the problem of low credibility of carbon emissions data, and realized the full traceability of verification data through a data control model of \"private chain + alliance chain\". Then we designed a reverse auction algorithm based on ring signature to address the problem of mismatch between government budget and work requirements. We also use the alliance chain platform FISCO BCOS as the underlying architecture, designed the corresponding smart contract, and verify the feasibility of the system. The results are conducive to promoting the market-oriented and benign development of carbon verification business.", "Published in": [{"name": "2023 2nd International Conference on Artificial Intelligence and Blockchain Technology (AIBT)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10248020/proceeding"}], "Authors": [{"name": "Lixuan Che", "from": "Weifang Vocational College, Weifang, China"}, {"name": "Entang Li", "from": "Shandong Luruan Digital Technology Co., Ltd, Jinan, China"}, {"name": "Hongwei Xin", "from": "Shandong Luruan Digital Technology Co., Ltd, Jinan, China"}, {"name": "Jianhui Zhang", "from": "Shandong Luruan Digital Technology Co., Ltd, Jinan, China"}, {"name": "Chonghao Xu", "from": "Shandong Luruan Digital Technology Co., Ltd, Jinan, China"}, {"name": "Qiang Li", "from": "Shandong Luruan Digital Technology Co., Ltd, Jinan, China"}, {"name": "Linrui Li", "from": "Guangzhou Istitute of Technology, Xidian University, Guangzhou, China"}], "IEEE keywords": ["Government", "Smart contracts", "Carbon dioxide", "Emissions trading", "Carbon neutral", "Data models", "Blockchains"], "Author Keywords": ["carbon emissions trading", "carbon verification", "blockchain", "reverse auction"]}