{"Title": "Research and Design of Electric Power Engineering Project Management System Bsed on Blockchain Technology", "Pages": null, "Cites in Papers": 4, "Cites in Patents": 0, "Full Text Views": 793, "Publisher": "IEEE", "DOI": "10.1109/ICBCTIS55569.2022.00029", "Date of Publication": "15-17 July 2022", "abstract": "The characteristics of electric power engineering projects, such as multiple types, multiple links, multiple related parties, and decentralized construction have formed complex contracts and employment relationships. Numerous stakeholders make the owner's ability to control all parties involved in the project very limited, and the problems of information islands still exist. Firstly, electric power engineering project management problems, such as qualifications of contractors or subcontractors, subcontracting in breach of contract, lack of transparency in the payment of workers' wages, arrears of wages, withholding and embezzlement of contract funds, and malicious debt collection, were analysed. Then, the data deposit, enterprise and personnel credit management, contract management, project progress management, and funds management based on the blockchain technology were studied. Finally, the blockchian based electric power engineering project management system was designed.", "Published in": [{"name": "2022 International Conference on Blockchain Technology and Information Security (ICBCTIS)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9844748/proceeding"}], "Authors": [{"name": "Qinglei Guo", "from": "State Grid E-Commerce Co., Ltd., Beijing, China"}, {"name": "Shuai Chen", "from": "State Grid E-Commerce Co., Ltd., Beijing, China"}, {"name": "Junsheng Wang", "from": "State Grid E-Commerce Co., Ltd., Beijing, China"}, {"name": "Xiaoting Pan", "from": "State Grid E-Commerce Co., Ltd., Beijing, China"}], "IEEE keywords": ["Contract management", "Supply chains", "Project management", "Information security", "Subcontracting", "Power systems", "Blockchains"], "Author Keywords": ["electric power project", "management system", "blockchain"]}