{"Title": "Blockchain Dividing Based on Node Community Clustering in Intelligent Manufacturing CPS", "Pages": null, "Cites in Papers": 18, "Cites in Patents": 0, "Full Text Views": 974, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00025", "Date of Publication": "14-17 July 2019", "abstract": "The blockchain technology becomes a key facilitator for Intelligent Manufacturing as it enables intelligent nodes to participate in global manufacturing networks with secure ledgers and smart contracts features. However, Traditional centralized storage cannot meet performance and security requirements and fully distributed storage consumes a large amount of computing, storage and network resources, which is inefficient and difficult to implement. In this paper, we propose a clustering strategy on node community clustering by constructing a trust model based on the decentralization of blockchain technology. We introduce a multi-chain storage structure. Our experiments show that the proposed strategy reduces data synchronization time and storage space, improves system performance by enabling efficient parallel processing.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Suisheng Li", "from": "College of Computer, Guangdong University of Technology, Guangzhou, China"}, {"name": "Hong Xiao", "from": "College of Computer, Guangdong University of Technology, Guangzhou, China"}, {"name": "Hao Wang", "from": "Department of Computer Science, Norwegian Univ. of Sci.&Tech., Norway"}, {"name": "Tao Wang", "from": "College of Automation, Guangdong University of Technology, Guangzhou, China"}, {"name": "Jingwei Qiao", "from": "College of Computer, Guangdong University of Technology, Guangzhou, China"}, {"name": "Shaofeng Liu", "from": "College of Computer, Guangdong University of Technology, Guangzhou, China"}], "IEEE keywords": ["Blockchain", "Manufacturing", "Memory", "Synchronization", "Production", "Database systems"], "Author Keywords": ["Intelligent", "Manufacturing", "Blockchain", "Multi-chain", "Strategy of Blockchain Dividing"]}