{"Title": "On Sharding Permissioned Blockchains", "Pages": null, "Cites in Papers": 26, "Cites in Patents": 0, "Full Text Views": 1766, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00044", "Date of Publication": "14-17 July 2019", "abstract": "Permissioned Blockchain systems rely mainly on Byzantine fault-tolerant protocols to establish consensus on the order of transactions. While Byzantine fault-tolerant protocols mostly guarantee consistency (safety) in an asynchronous network using 3f+1 machines to overcome the simultaneous malicious failure of any f nodes, in many systems, e.g., blockchain systems, the number of available nodes (resources) is much more than 3f + 1. To utilize such extra resources, in this paper we introduce a model that leverages transaction parallelism by partitioning the nodes into clusters (partitions) and processing independent transactions on different partitions simultaneously. The model also shards the blockchain ledger, assigns different shards of the blockchain ledger to different clusters, and includes both intra-shard and cross-shard transactions. Since more than one cluster is involved in each cross-shard transaction, the ledger is formed as a directed acyclic graph.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Mohammad Javad Amiri", "from": "Department of Computer Science, University of California Santa Barbara, Santa Barbara, California"}, {"name": "Divyakant Agrawal", "from": "Department of Computer Science, University of California Santa Barbara, Santa Barbara, California"}, {"name": "Amr El Abbadi", "from": "Department of Computer Science, University of California Santa Barbara, Santa Barbara, California"}], "IEEE keywords": ["Fault tolerance", "Fault tolerant systems", "Fabrics", "Directed acyclic graph", "Consensus protocol"], "Author Keywords": ["Permissioned Blockchain", "Scalability", "Data Sharding", "Directed Acyclic Graph"]}