{"Title": "Multi-Blockchain Model for Data Sharing with Bell-LaPadula Access Control", "Pages": null, "Cites in Papers": 91, "Cites in Patents": 0, "Full Text Views": 91, "Publisher": "IEEE", "DOI": "10.1109/Blockchain60715.2023.00018", "Date of Publication": "17-21 December 2023", "abstract": "In recent years, the technologies of blockchains, the Internet of Things (IoT), etc. technologies have been drawing attention across different industries. In our experience, during a pandemic, we look for innovations and personalization of secure data sharing on Electronic Health Records (EHRs) to provide better healthcare services. In the paper, we propose a decentralized record management system which is to share data over multiple independent blockchain entities. Each blockchain runs under the administration of an independent healthcare organization. In our design, data would be shared and integrated among multiple Hospital Information Systems (HIS) across different healthcare organizations. It gives doctors and healthcare personnel an easy and safe way to obtain the health records of patients across hospitals dynamically worldwide through negotiated Service-Layer Agreements (SLAs) to provide accurate medical services. Our system leverages blockchain properties to manage access authentication, retrieve medical data, and add new patient data entries. Without a centralized system and database, the design autonomously, dynamically, and securely governs the retrieval and storage of data traffic based on the SLAs. Further, we integrate the system design with the Bell-LaPadula access control model to maintain the confidentiality of security organized in a non-discretionary fashion for different layers of secrecy. Since an HIS runs within the security bounds of a healthcare authority, we can adopt the Proof-of-Authority (PoA) consensus algorithm, which is developed by the Go Ethereum (Geth) team. The PoA provides an efficient, low computational power consumption approach for securely validating the blockchains.", "Published in": [{"name": "2023 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10411431/proceeding"}], "Authors": [{"name": "H. C. Chong", "from": "Faculty of Applied Sciences, Macao Polytechnic University, Macao, China"}, {"name": "K. L. Eddie Law", "from": "Faculty of Applied Sciences, Macao Polytechnic University, Macao, China"}], "IEEE keywords": ["Industries", "Access control", "Hospitals", "Organizations", "Blockchains", "Internet of Things", "System analysis and design"], "Author Keywords": ["Multiple Blockchain", "EHR", "Electronic Health Records", "Hospital Information Systems", "HIS", "Internet of things", "IoT", "Bell-LaPadula", "PoA", "Proof-of-Authority", "SLA", "Service-Layer Agreement", "Ethereum", "Smart contracts"]}