{"Title": "A Blockchain Based Fund Management System for Construction Projects - A Comprehensive Case Study in Xiong'an New Area China", "Pages": null, "Cites in Papers": 62, "Cites in Patents": 0, "Full Text Views": 62, "Publisher": "IEEE", "DOI": "10.1109/SDS59856.2023.10329054", "Date of Publication": "23-25 October 2023", "abstract": "As large-scale construction projects become increasingly complex, the use and integration of advanced technologies are being emphasized more and more. However, the construction industry often lags behind most industries in the application of digital technologies. In recent years, a decentralized, peer-to-peer blockchain technology has attracted widespread attention from academia and industry. This paper provides a solution that combines blockchain technology with construction project fund management. The system involves participants such as the owner's unit, construction companies, government departments, banks, etc., adopting the technical architecture of the “Xiong'an Blockchain Underlying System”. The core business and key logic processing are all implemented through smart contracts, ensuring the transparency and traceability of the fund payment process. The goal of ensuring investment quality, standardizing investment behavior, and strengthening cost control is achieved through blockchain technology. The application of this system in the management of Xiong'an construction projects has verified that blockchain technology plays a significant positive role in strengthening fund management, enhancing fund supervision, and ensuring fund safety in the construction process of engineering projects. It helps to eliminate the common problems of multi-party trust and transparent supervision in the industry and can further improve the investment benefits of government investment projects and improve the management system and operation mechanism of investment projects.", "Published in": [{"name": "2023 Tenth International Conference on Software Defined Systems (SDS)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10328971/proceeding"}], "Authors": [{"name": "Wenlue Song", "from": "School of Computer Science and Engineering, Beihang University, Beijing, China"}, {"name": "Hanyuan Wu", "from": "Xiong'an Blockchain Lab, Xiong'an Intelligent City Innovation Federation, Xiong'an, New Area, China"}, {"name": "Hongwei Meng", "from": "Xiong'an Blockchain Lab, Xiong'an Intelligent City Innovation Federation, Xiong'an, New Area, China"}, {"name": "Yifu Bian", "from": "Xiong'an Blockchain Lab, Xiong'an Intelligent City Innovation Federation, Xiong'an, New Area, China"}, {"name": "Cong Tang", "from": "Temi Tech ltd Beijing, Xiong'an Huoshu Tech ltd Hebei, Beijing, China"}, {"name": "Jiaqi Xi", "from": "Beijing University of Technology, Beijing, China"}, {"name": "Haogang Zhu", "from": "School of Computer Science and Engineering, Beihang University, Beijing, China"}], "IEEE keywords": ["Costs", "Government", "Smart contracts", "Computer architecture", "Software", "Blockchains", "Safety"], "Author Keywords": ["Blockchain", "Fund Management", "Smart Contract", "Construction Projects", "Xiong'an"]}