{"Title": "Blockchain-Based Software Systems: Taxonomy Development", "Pages": null, "Cites in Papers": 2, "Cites in Patents": 0, "Full Text Views": 467, "Publisher": "IEEE", "DOI": "10.1109/Blockchain53845.2021.00075", "Date of Publication": "06-08 December 2021", "abstract": "At an era of new emerging technologies, and spotting lights to blockchain technology specifically; many promises take place. Blockchain has attracted many researchers and practitioners from various professions and disciplines, due to the powerful characteristics behind adopting such technology. And in order to formulate a better understanding of it, many researchers are interested in classifying the Blockchain-Based Software Systems (BBSSs). Unfortunately, none of the available taxonomies in the literature considers the various Software Engineering (SWE) aspects for building a BBSS. A blockchain subject matter expert (SME) may absorb a specific aspect understanding from each of the related taxonomies, and in order to have a complete understanding of the various options available for building a BBSS, they will have to flip from a resource to another in order to collect the scattered information they need. So, this paper aims to assist the blockchain SMEs to articulate a comprehensive understanding of the various and most recent concepts and design decisions available, in order to implement or propose a BBSS solution. The taxonomy is derived from the fundamental knowledge and the major SWE aspects which a BBSS implementer or researcher has to consider, and thus is not biased to a specific SWE aspect.", "Published in": [{"name": "2021 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9680465/proceeding"}], "Authors": [{"name": "Lamia Alashaikh", "from": "College of Computer and Information Sciences, King Saud University, Riyadh, Saudi Arabia"}], "IEEE keywords": ["Conferences", "Taxonomy", "Buildings", "Software systems", "Blockchains", "Software engineering"], "Author Keywords": ["blockchain", "Blockchain-Based Software System (BBSS)", "taxonomy", "Subject Matter Expert (SME)", "Software Engineering (SWE) aspect"]}