{"Title": "Secured Inter-Healthcare Patient Health Records Exchange Architecture", "Pages": null, "Cites in Papers": 8, "Cites in Patents": 0, "Full Text Views": 435, "Publisher": "IEEE", "DOI": "10.1109/Blockchain50366.2020.00066", "Date of Publication": "02-06 November 2020", "abstract": "The increase in cyberattacks against the healthcare system, notably Electronic Health Records (EHRs) breaches, has cost the healthcare providers more in recent years. This situation is estimated to increase in the coming years as the healthcare systems are proposing a consortium EHRs repository. In an attempt to secure these health records, researchers propose firewalls, cryptography, cloud antivirus. Although these approaches proved useful and practical in protecting EHRs; however, the shared data security cannot be guaranteed. More specifically, maintaining the integrity and consistency of shared EHRs becomes a significant concern. In this on-going research, we propose a blockchain-based solution that facilitates a scalable and secured inter-healthcare EHRs exchange. These healthcare providers maintain their records on separate blockchain networks and are independent of each other. The proposed architecture can detect and prevent malicious activities on both EHRs at rest and in transit. It can also verify the integrity and consistency of EHR requests and replies from other healthcare systems and presents them in a format that can be easily understood by different healthcare nodes. We evaluate the security analysis against frequently encounter outsider and insider threats within a healthcare system in the preliminary result. The result shows that the architecture detects and prevents insider threats from uploading compromising EHRs into the blockchain and prevents unauthorized retrieval of patient information.", "Published in": [{"name": "2020 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9284404/proceeding"}], "Authors": [{"name": "Oluwaseyi Ajayi", "from": "City College, City University of New York"}, {"name": "Meryem Abouali", "from": "City College, City University of New York"}, {"name": "Tarek Saadawi", "from": "City College, City University of New York"}], "IEEE keywords": ["Firewalls (computing)", "Medical services", "Blockchain", "Time factors", "Cryptography", "Electronic medical records", "Interoperability"], "Author Keywords": ["Blockchain", "Electronic Health Records", "Compromised EHR", "Healthcare System", "Security"]}