{"Title": "Towards a Framework for Understanding the Performance of Blockchains", "Pages": null, "Cites in Papers": 7, "Cites in Patents": 0, "Full Text Views": 1059, "Publisher": "IEEE", "DOI": "10.1109/BRAINS52497.2021.9569810", "Date of Publication": "27-30 September 2021", "abstract": "Blockchain and Distributed Ledger Technology (DLT) appears to be at a worldwide threshold of acceptance and adoption. Since their inception, several innovative projects have been proposing solutions to the blockchain trilemma, improving blockchain features and its technical limitations. However, the adoption of blockchain as a technology or a software component, requires a comprehensive understanding and characterization of their technical principles and characteristics. The latter introduces an uncertainty for an organization to decide which blockchain protocol best meets its needs and demands. In general, there is a lack of proper testing and software engineering practices for assessing the usage of blockchains usage and understanding their performance. Towards that direction, this paper presents an architecture for a blockchain benchmarking framework which aims at the deployment and evaluation of different blockchain protocols, focusing on different aspects such as security and scalability. A set of modules is introduced for testing and evaluating the behaviour of blockchain protocols under different test scenarios.", "Published in": [{"name": "2021 3rd Conference on Blockchain Research & Applications for Innovative Networks and Services (BRAINS)", "link": "https://ieeexplore.ieee.org/xpl/conhome/9568781/proceeding"}], "Authors": [{"name": "Marios Touloupou", "from": "Department of Digital Innovation, University of Nicosia, Nicosia, Cyprus"}, {"name": "Klitos Christodoulou", "from": "Department of Digital Innovation, University of Nicosia, Nicosia, Cyprus"}, {"name": "Antonis Inglezakis", "from": "Department of Digital Innovation, University of Nicosia, Nicosia, Cyprus"}, {"name": "Elias Iosif", "from": "Department of Digital Innovation, University of Nicosia, Nicosia, Cyprus"}, {"name": "Marinos Themistocleous", "from": "Department of Digital Innovation, University of Nicosia, Nicosia, Cyprus"}], "IEEE keywords": ["Protocols", "Uncertainty", "Distributed ledger", "Computer architecture", "Benchmark testing", "Software", "Blockchains"], "Author Keywords": ["blockchain", "benchmarking framework", "testing", "reproducibility", "XRP ledger", "consensus", "protocols"]}