{"Title": "Bitcoin Options Pricing Using LSTM-Based Prediction Model and Blockchain Statistics", "Pages": null, "Cites in Papers": 16, "Cites in Patents": 0, "Full Text Views": 1464, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00018", "Date of Publication": "14-17 July 2019", "abstract": "Although Bitcoin and other cryptocurrencies continue to attract attention, the inaccurate pricing of Bitcoin options has resulted in an inefficient crypto derivative market. In this paper, we adopt a multiple input LSTM-based prediction model in conjunction with the Black-Scholes (BS) model to address this challenge in Bitcoin option pricing. We discuss the relationship between on/off-chain transactions and predict the implied price volatility of the next 30 days, which is the main factor in the BS model. First, we analyze the Blockchain statistics and social network trends of Bitcoin as inputs to our model, including the liveness of Blockchain wallet, the scale of active Blockchain nodes and the impact factor of Google, Reddit, Twitter to name a few. Next, we implement the LSTM-based prediction model and evaluate it in various historical window sizes and network parameters. Finally, we compare the performance with the baseline model without Blockchain statistics inputs. The experimental results show that the proposed multi-input LSTM-based prediction model provides the risk-informed pricing of the Bitcoin call options and our Blockchain statistics reduce the root-mean-square error (RMSE) by up to 46.2%.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Lun Li", "from": "School of Computer and Information Technology, Beijing Jiaotong University, Beijing, China"}, {"name": "Ali Arab", "from": "Department of Finance and Economics, Pace University, New York, NY"}, {"name": "Jiqiang Liu", "from": "School of Computer and Information Technology, Beijing Jiaotong University, Beijing, China"}, {"name": "Jingxian Liu", "from": "School of Computer and Information Technology, Beijing Jiaotong University, Beijing, China"}, {"name": "Zhu Han", "from": "Department of Electrical and Computer Engineering, University of Houston, Houston, Texas"}], "IEEE keywords": ["Bitcoin", "Blockchain", "Predictive models", "Pricing", "Market research", "Analytical models"], "Author Keywords": ["Bitcoin", "Blockchain", "Prediction", "Deep learning", "LSTM", "Option pricing"]}