{"Title": "Points Transaction Mechanisms Based on Blockchain Technology", "Pages": null, "Cites in Papers": 103, "Cites in Patents": 0, "Full Text Views": 103, "Publisher": "IEEE", "DOI": "10.1109/CCSB58128.2022.00018", "Date of Publication": "28-30 October 2022", "abstract": "The Loyalty program is an effective incentive measure for companies to maintain individual users. However, the traditional loyalty program has problems such as inability to interact across platforms and lack of credibility. The points alliance is an effective measure to solve the above problems. By formulating the corresponding points exchange agreement within the alliance, the barriers of data interaction between different platforms can be broken. Blockchain technology has the characteristics of decentralization and distribution, which is consistent with the technical needs of the points alliance. Based on the research of decentralized exchange, this paper designs a blockchain-based points trading mechanism, and explains the details of points trading and the implementation of order matching. The mechanism proposed in this paper helps to increase the probability of successful exchange of points, thus increasing the use value of loyalty points.", "Published in": [{"name": "2022 2nd International Conference on Computer Science and Blockchain (CCSB)", "link": "https://ieeexplore.ieee.org/xpl/conhome/10071526/proceeding"}], "Authors": [{"name": "Jinfei Wu", "from": "College of Information Science and Engineering, Huaqiao University, Xiamen, China"}, {"name": "Jiayuan Zhang", "from": "College of Information Science and Engineering, Huaqiao University, Xiamen, China"}, {"name": "Rongxin Guo", "from": "College of Engineering, Huaqiao University, Quanzhou, China"}, {"name": "Wanting Tang", "from": "College of Information Science and Engineering, Huaqiao University, Xiamen, China"}], "IEEE keywords": ["Computer science", "Supply and demand", "Pricing", "Companies", "Blockchains"], "Author Keywords": ["blockchain", "loyalty program", "decentralized transactions exchange", "transaction mechnisms"]}