{"Title": "Access Control for Electronic Health Records with Hybrid Blockchain-Edge Architecture", "Pages": null, "Cites in Papers": 90, "Cites in Patents": 0, "Full Text Views": 3713, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00015", "Date of Publication": "14-17 July 2019", "abstract": "The global Electronic Health Record (EHR) market is growing dramatically and expected to reach $39.7 billions by 2022. To safe-guard security and privacy of EHR, access control is an essential mechanism for managing EHR data. This paper proposes a hybrid architecture to facilitate access control of EHR data by using both blockchain and edge node. Within the architecture, a blockchain-based controller manages identity and access control policies and serves as a tamper-proof log of access events. In addition, off-chain edge nodes store the EHR data and apply policies specified in Abbreviated Language For Authorization (ALFA) to enforce attribute-based access control on EHR data in collaboration with the blockchain-based access control logs. We evaluate the proposed hybrid architecture by utilizing Hyperledger Composer Fabric blockchain to measure the performance of executing smart contracts and ACL policies in terms of transaction processing time and response time against unauthorized data retrieval.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Hao Guo", "from": "Department of Computer and Information Sciences, University of Delaware, U.S.A."}, {"name": "Wanxin Li", "from": "Department of Civil and Environmental Engineering, University of Delaware, U.S.A."}, {"name": "Mark Nejad", "from": "Department of Civil and Environmental Engineering, University of Delaware, U.S.A."}, {"name": "Chien-Chung Shen", "from": "Department of Computer and Information Sciences, University of Delaware, U.S.A."}], "IEEE keywords": ["Access control", "Blockchain", "Distributed ledger", "Fabrics", "Medical services", "Smart contracts", "Computer architecture"], "Author Keywords": ["Attribute-based Access Control", "Access Control List", "Blockchain", "Edge Computing", "Hyperledger", "Smart Contract"]}