{"Title": "Enhancing Blockchain Traceability with DAG-Based Tokens", "Pages": null, "Cites in Papers": 15, "Cites in Patents": 0, "Full Text Views": 1499, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00036", "Date of Publication": "14-17 July 2019", "abstract": "Blockchain technology has positively impacted traceability across various industries such as logistics and shipping. By overcoming the problem of data silos among organizations and concentration of authority, this innovative approach allows a decentralized and tamper-resistant ledger to be built. On the other hand, the use of non-fungible tokens, a new concept for projecting digital and physical goods on a blockchain, is expected to be able to represent complicated operations in traceability systems. However, the existing token design lacks an efficient model for retrieval of past histories. The most popular way to retrieve past information on tokens is to use blockchain explorers, which are centralized trusted parties. Otherwise, so far there is only a naive way to examine all block headers, and it takes a vast amount of time. Our preliminary study shows that the processing time for retrieving all histories of 1,030 tokens on the Ethereum mainnet takes approximately 57 minutes. We propose a new token design based on a directed acyclic graph (DAG) that allows token histories to be efficiently explored without examining the whole blockchain. The model associates each state of the token from past to latest and covers expressions of relationships between tokens, such as merge and split. Our implementation and evaluation reveal that the DAG-based token design significantly improves the efficiency of exploring token transfer histories. The results show that our method can complete the exploration for 1,030 tokens in a matter of seconds and maintains performance over the long term even if the blockchain grows.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Hiroki Watanabe", "from": "NTT Service Evolution Labs., NTT Corp."}, {"name": "Tatsuro Ishida", "from": "NTT Service Evolution Labs., NTT Corp."}, {"name": "Shigenori Ohashi", "from": "NTT Service Evolution Labs., NTT Corp."}, {"name": "Shigeru Fujimura", "from": "NTT Service Evolution Labs., NTT Corp."}, {"name": "Atsushi Nakadaira", "from": "NTT Service Evolution Labs., NTT Corp."}, {"name": "Kota Hidaka", "from": "NTT Service Evolution Labs., NTT Corp."}, {"name": "Jay Kishigami", "from": "Muroran Institute of Technology"}], "IEEE keywords": ["Blockchain", "History", "Smart contracts", "Supply chains", "Standards", "Industries", "Reliability"], "Author Keywords": ["Blockchain", "DAG", "Token", "Ethereum"]}