{"Title": "A Blockchain Oracle Interoperability Technique for Permissioned Blockchain", "Pages": null, "Cites in Papers": 145, "Cites in Patents": 0, "Full Text Views": 145, "Publisher": "IEEE", "DOI": "10.1109/ACCESS.2024.3400672", "Date of Publication": "13 May 2024", "abstract": "Blockchain interoperability has become an essential requirement for the advancement of blockchain technology in numerous fields. Enterprise organizations are increasingly utilizing permissioned blockchains to manage and store their organizations’ data and transactions in a private immutable ledger. Interoperability enables permissioned blockchain platforms to communicate and exchange information which is paramount for fully exploiting permissioned blockchains as facilitators for B2B applications. Additionally, the cross-network invocation of smart contracts under agreed conditions enhances business operations. Blockchain oracles can enable permissioned blockchain interoperability and cross-network transactions in a seamless and private manner. However, they have not been studied in the literature as interoperability techniques between permission blockchains. This study proposes a blockchain oracle interoperability technique designed specifically for permissioned blockchain platforms. We presented the architecture of the blockchain oracle interoperability technique and a prototypical implementation to demonstrate the practicality of the proposed technique. In addition, we obtained cross-network transaction latency measurements and analyzed the results.", "Published in": [{"name": "IEEE Access", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6287639"}], "Authors": [{"name": "Asma A. Alhussayen", "from": "Faculty of Computing and Information Technology, King Abdulaziz University, Jeddah, Saudi Arabia"}, {"name": "Kamal Jambi", "from": "Faculty of Computing and Information Technology, King Abdulaziz University, Jeddah, Saudi Arabia"}, {"name": "Maher Khemakhem", "from": "Faculty of Computing and Information Technology, King Abdulaziz University, Jeddah, Saudi Arabia"}, {"name": "Fathy E. Eassa", "from": "Faculty of Computing and Information Technology, King Abdulaziz University, Jeddah, Saudi Arabia"}], "IEEE keywords": ["Blockchains", "Interoperability", "Peer-to-peer computing", "Smart contracts", "Business", "Distributed ledger", "Consensus protocol", "Transaction databases"], "Author Keywords": ["Permissioned blockchain", "blockchain interoperability", "blockchain oracle", "cross-network transactions"]}