{"Title": "NutBaaS: A Blockchain-as-a-Service Platform", "Pages": null, "Cites in Papers": 130, "Cites in Patents": 0, "Full Text Views": 25580, "Publisher": "IEEE", "DOI": "10.1109/ACCESS.2019.2941905", "Date of Publication": "17 September 2019", "abstract": "Blockchain, originated from Bitcoin system, has drawn intense attention from the academic community because of its decentralization, persistency, anonymity and auditability. In the past decade, the blockchain technology has evolved and became viable for various applications beyond the domain of finance. However, due to the complexity of blockchain technology, it is usually difficult and costly for most developers or teams to build, maintain and monitor a blockchain network that supports their applications. Most common developers or teams are unable to ensure the reliability and security of the blockchain system, which to a certain extent affects the quality of their applications. In this paper, we develop a BaaS platform called NutBaaS, which provides blockchain service over cloud computing environments, such as network deployment and system monitoring, smart contracts analysis and testing. Based on these services, developers can focus on the business code to explore how to apply blockchain technology more appropriately to their business scenarios, without bothering to maintain and monitor the system.", "Published in": [{"name": "IEEE Access", "link": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6287639"}], "Authors": [{"name": "Weilin Zheng", "from": "Sun Yat-Sen University, Guangzhou, Guangdong, CN"}, {"name": "Zibin Zheng", "from": "Sun Yat-Sen University, Guangzhou, Guangdong, CN"}, {"name": "Xiangping Chen", "from": "Sun Yat-Sen University, Guangzhou, Guangdong, CN"}, {"name": "Kemian Dai", "from": "Department of Blockchain Development, Badou Financial Blockchain Technology Company Ltd., Guangzhou, China"}, {"name": "Peishan Li", "from": "Department of Blockchain Development, Badou Financial Blockchain Technology Company Ltd., Guangzhou, China"}, {"name": "Renfei Chen", "from": "Department of Blockchain Development, Badou Financial Blockchain Technology Company Ltd., Guangzhou, China"}], "IEEE keywords": ["Blockchain", "Peer-to-peer computing", "Monitoring", "Cloud computing", "Smart contracts"], "Author Keywords": ["Blockchain", "blockchain-as-a-service", "cloud computing", "smart contracts"]}