{"Title": "BlockSIM: A practical simulation tool for optimal network design, stability and planning", "Pages": null, "Cites in Papers": 22, "Cites in Patents": 0, "Full Text Views": 1269, "Publisher": "IEEE", "DOI": "10.1109/BLOC.2019.8751320", "Date of Publication": "14-17 May 2019", "abstract": "As the benefits of blockchain become clear, in the past year we have witnessed an explosive growth in the use of blockchain based systems. However, as with any new technology, adoption of blockchain carries with it, as yet not widely known, risks that should be properly evaluated and understood prior to design and development. Given the purely distributed nature of blockchain, in which nodes can span continents, a key aspect in planning and designing blockchain systems which is not readily incorporated in a modern architect’s vernacular is consideration of eventual consistency, system stability and scalability when designing blockchain based systems. This is compounded by the fact that, as yet, very few practical tools are available to help architects better understand and plan for the above. In this paper we introduce BlockSIM, a comprehensive and open source blockchain system simulation tool which can assist blockchain architects better evaluate the performance of planned private blockchain networks by running scenarios and decide the optimal system parameters suited for their purposes. We compare the results of our simulation with real blockchain networks and demonstrate that BlockSIM can be used effectively by architects of blockchain systems to plan and implement scalable, stable and resilient blockchain networks. Finally, we demonstrate via a real life example how architects can apply BlockSIM to plan and design real-world blockchain systems.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain and Cryptocurrency (ICBC)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8744142/proceeding"}], "Authors": [{"name": "Santosh Pandey", "from": "R&D engineering lead (AI and Database technologies) Rosebay Consulting, Kathmandu, Nepal"}, {"name": "Gopal Ojha", "from": "R&D engineering lead (Blockchain technologies) Rosebay Consulting, Kathmandu, Nepal"}, {"name": "Bikesh Shrestha", "from": "Blockchain development engineer Rosebay Consulting, Kathmandu, Nepal"}, {"name": "Rohit Kumar", "from": "Rosebay Group, Kathmandu, Nepal"}], "IEEE keywords": ["Blockchain", "Scalability", "Stability analysis", "Planning"], "Author Keywords": ["Blockchain", "Enterprise design", "Performance", "Eventual interactive consistency", "Scalability", "Architecture", "Open source"]}