{"Title": "A Lightweight Blockchain-Based Privacy Protection for Smart Surveillance at the Edge", "Pages": null, "Cites in Papers": 36, "Cites in Patents": 0, "Full Text Views": 3025, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00080", "Date of Publication": "14-17 July 2019", "abstract": "Witnessing the increasingly pervasive deployment of security video surveillance systems(VSS), more and more individuals have become concerned with the issues of privacy violations. While the majority of the public have a favorable view of surveillance in terms of crime deterrence, individuals do not accept the invasive monitoring of their private life. To date, however, there is not a lightweight and secure privacy-preserving solution for video surveillance systems. The recent success of blockchain (BC) technologies and their applications in the Internet of Things (IoT) shed a light on this challenging issue. In this paper, we propose a Lightweight, Blockchain-based Privacy protection (Lib-Pri) scheme for surveillance cameras at the edge. It enables the VSS to perform surveillance without compromising the privacy of people captured in the videos. The Lib-Pri system transforms the deployed VSS into a system that functions as a federated blockchain network capable of carrying out integrity checking, blurring keys management, feature sharing, and video access sanctioning. The policy-based enforcement of privacy measures is carried out at the edge devices for real-time video analytics without cluttering the network.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Alem Fitwi", "from": "Dept. of Electrical & Computer Engineering, SUNY, Binghamton, NY, USA"}, {"name": "Yu Chen", "from": "Dept. of Electrical & Computer Engineering, SUNY, Binghamton, NY, USA"}, {"name": "Sencun Zhu", "from": "Dept. of Computer Science and Engineering, Penn State University, PA, USA"}], "IEEE keywords": ["Privacy", "Surveillance", "Blockchain", "Image edge detection", "Smart cameras", "Object detection"], "Author Keywords": ["Privacy", "Lightweight Blockchain", "Smart Surveillance", "Edge Device", "Off-Site Storage"]}