{"Title": "Toward a Decentralized, Trust-Less Marketplace for Brokered IoT Data Trading Using Blockchain", "Pages": null, "Cites in Papers": 42, "Cites in Patents": 0, "Full Text Views": 1761, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00053", "Date of Publication": "14-17 July 2019", "abstract": "As data marketplaces are becoming common place, it is also becoming clear that data streams generated from Internet of Things (IoT) devices hold value for potential third party consumers. We envision a marketplace for IoT data streams that can unlock such potential value in a scalable way, by enabling any pairs of data providers and consumers to engage in data exchange transactions without any prior assumption of mutual trust. We present a marketplace model and architecture to support trading of streaming data, from the advertising of data assets to the stipulation of legally binding trading agreements, to their fulfilment and payment settlement. Crucially, we show that by using blockchain technology and Smart Contracts in particular, we can offer participants a trade-off between the cost of transactional data exchange, and the risk of data loss when trading with untrusted third parties. We experimentally assess such trade-offs on a testbed using Ethereum Smart Contracts.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Shaimaa Bajoudah", "from": "School of Computing, Newcastle University, Newcastle Upon Tyne, UK"}, {"name": "Changyu Dong", "from": "School of Computing, Newcastle University, Newcastle Upon Tyne, UK"}, {"name": "Paolo Missier", "from": "School of Computing, Newcastle University, Newcastle Upon Tyne, UK"}], "IEEE keywords": ["Blockchain", "Smart contracts", "Data models", "Internet of Things", "Real-time systems", "Trade agreements", "Proposals"], "Author Keywords": ["Smart Contract", "Decentralized Marketplace", "Ethereum Blockchain", "Trading IoT data"]}