{"Title": "Scalable Privacy-Preserving Query Processing over Ethereum Blockchain", "Pages": null, "Cites in Papers": 20, "Cites in Patents": 0, "Full Text Views": 1700, "Publisher": "IEEE", "DOI": "10.1109/Blockchain.2019.00061", "Date of Publication": "14-17 July 2019", "abstract": "Blockchain technologies have recently received considerable attention, partly due to the success of cryptocurrency applications such as Bitcoin and Ethereum. As the adoption of blockchain technologies by various sectors increases, there is a demand for tools that enable regulatory enforcement, which include monitoring, examining and ensuring compliance of the data stored by the blockchain systems, all in a privacy preserving way. Current blockchain solutions store transactions in append-only and immutable fashion without any indexing, which contributes to limited and inefficient queries. Additionally, there is no support for privacy-preserving query processing. To address these issues, in this paper, we propose a system that can provide auditors, enforcing regulatory compliance, with efficient, scalable and richer blockchain query processing over Hadoop and synchronized Ethereum clients. The system additionally ensures auditors' privacy by utilizing cryptography techniques over semi-trusted servers to protect the auditors' identities, queries and their results.", "Published in": [{"name": "2019 IEEE International Conference on Blockchain (Blockchain)", "link": "https://ieeexplore.ieee.org/xpl/conhome/8938397/proceeding"}], "Authors": [{"name": "Shlomi Linoy", "from": "University of New Brunswick, Fredericton, Canada"}, {"name": "Hassan Mahdikhani", "from": "University of New Brunswick, Fredericton, Canada"}, {"name": "Suprio Ray", "from": "University of New Brunswick, Fredericton, Canada"}, {"name": "Rongxing Lu", "from": "University of New Brunswick, Fredericton, Canada"}, {"name": "Natalia Stakhanova", "from": "University of New Brunswick, Fredericton, Canada"}, {"name": "Ali Ghorbani", "from": "University of New Brunswick, Fredericton, Canada"}], "IEEE keywords": ["Servers", "Blockchain", "Cryptography", "Task analysis", "Indexes", "Query processing", "Privacy"], "Author Keywords": ["blockchain, privacy, bigdata, database"]}